#![allow(non_camel_case_types, non_snake_case, non_upper_case_globals)]

unsafe extern "C" {
    pub fn GetPjrtApi() -> *const PJRT_Api;
}

/* automatically generated by rust-bindgen 0.72.1 */

pub const PJRT_API_MAJOR: u32 = 0;
pub const PJRT_API_MINOR: u32 = 90;
pub const PJRT_API_FFI_EXTENSION_VERSION: u32 = 3;
pub const PJRT_API_LAYOUTS_EXTENSION_VERSION: u32 = 3;
pub const PJRT_API_MEMORY_DESCRIPTIONS_EXTENSION_VERSION: u32 = 1;
pub const PJRT_API_PHASE_COMPILE_EXTENSION_VERSION: u32 = 1;
pub const PJRT_API_PROFILER_EXTENSION_VERSION: u32 = 1;
pub const XLA_FFI_API_MAJOR: u32 = 0;
pub const XLA_FFI_API_MINOR: u32 = 2;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Gpu_Custom_Call: PJRT_Extension_Type = 0;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Profiler: PJRT_Extension_Type = 1;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Custom_Partitioner: PJRT_Extension_Type = 2;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Stream: PJRT_Extension_Type = 3;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Layouts: PJRT_Extension_Type = 4;
pub const PJRT_Extension_Type_PJRT_Extension_Type_FFI: PJRT_Extension_Type = 5;
pub const PJRT_Extension_Type_PJRT_Extension_Type_MemoryDescriptions: PJRT_Extension_Type = 6;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Triton: PJRT_Extension_Type = 7;
pub const PJRT_Extension_Type_PJRT_Extension_Type_RawBuffer: PJRT_Extension_Type = 8;
pub const PJRT_Extension_Type_PJRT_Extension_Type_PhaseCompile: PJRT_Extension_Type = 9;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Example: PJRT_Extension_Type = 10;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Unknown: PJRT_Extension_Type = 11;
pub const PJRT_Extension_Type_PJRT_Extension_Type_CrossHostTransfers: PJRT_Extension_Type = 12;
pub const PJRT_Extension_Type_PJRT_Extension_Type_ExecutableMetadata: PJRT_Extension_Type = 13;
pub const PJRT_Extension_Type_PJRT_Extension_Type_Callback: PJRT_Extension_Type = 14;
pub const PJRT_Extension_Type_PJRT_Extension_Type_HostAllocator: PJRT_Extension_Type = 15;
pub const PJRT_Extension_Type_PJRT_Extension_Type_TpuTopology: PJRT_Extension_Type = 16;
pub type PJRT_Extension_Type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Extension_Base {
    pub struct_size: usize,
    pub type_: PJRT_Extension_Type,
    pub next: *mut PJRT_Extension_Base,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Extension_Base"][::std::mem::size_of::<PJRT_Extension_Base>() - 24usize];
    ["Alignment of PJRT_Extension_Base"][::std::mem::align_of::<PJRT_Extension_Base>() - 8usize];
    ["Offset of field: PJRT_Extension_Base::struct_size"]
        [::std::mem::offset_of!(PJRT_Extension_Base, struct_size) - 0usize];
    ["Offset of field: PJRT_Extension_Base::type_"][::std::mem::offset_of!(PJRT_Extension_Base, type_) - 8usize];
    ["Offset of field: PJRT_Extension_Base::next"][::std::mem::offset_of!(PJRT_Extension_Base, next) - 16usize];
};
pub const PJRT_Extension_Base_STRUCT_SIZE: _bindgen_ty_1 = 24;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Api_Version {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub major_version: ::std::os::raw::c_int,
    pub minor_version: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Api_Version"][::std::mem::size_of::<PJRT_Api_Version>() - 24usize];
    ["Alignment of PJRT_Api_Version"][::std::mem::align_of::<PJRT_Api_Version>() - 8usize];
    ["Offset of field: PJRT_Api_Version::struct_size"][::std::mem::offset_of!(PJRT_Api_Version, struct_size) - 0usize];
    ["Offset of field: PJRT_Api_Version::extension_start"]
        [::std::mem::offset_of!(PJRT_Api_Version, extension_start) - 8usize];
    ["Offset of field: PJRT_Api_Version::major_version"]
        [::std::mem::offset_of!(PJRT_Api_Version, major_version) - 16usize];
    ["Offset of field: PJRT_Api_Version::minor_version"]
        [::std::mem::offset_of!(PJRT_Api_Version, minor_version) - 20usize];
};
pub const PJRT_Api_Version_STRUCT_SIZE: _bindgen_ty_2 = 24;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Error {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Error_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub error: *mut PJRT_Error,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Error_Destroy_Args"][::std::mem::size_of::<PJRT_Error_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_Error_Destroy_Args"][::std::mem::align_of::<PJRT_Error_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_Error_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Error_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Error_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Error_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Error_Destroy_Args::error"]
        [::std::mem::offset_of!(PJRT_Error_Destroy_Args, error) - 16usize];
};
pub const PJRT_Error_Destroy_Args_STRUCT_SIZE: _bindgen_ty_3 = 24;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub type PJRT_Error_Destroy = ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Error_Destroy_Args)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Error_Message_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub error: *const PJRT_Error,
    pub message: *const ::std::os::raw::c_char,
    pub message_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Error_Message_Args"][::std::mem::size_of::<PJRT_Error_Message_Args>() - 40usize];
    ["Alignment of PJRT_Error_Message_Args"][::std::mem::align_of::<PJRT_Error_Message_Args>() - 8usize];
    ["Offset of field: PJRT_Error_Message_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Error_Message_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Error_Message_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Error_Message_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Error_Message_Args::error"]
        [::std::mem::offset_of!(PJRT_Error_Message_Args, error) - 16usize];
    ["Offset of field: PJRT_Error_Message_Args::message"]
        [::std::mem::offset_of!(PJRT_Error_Message_Args, message) - 24usize];
    ["Offset of field: PJRT_Error_Message_Args::message_size"]
        [::std::mem::offset_of!(PJRT_Error_Message_Args, message_size) - 32usize];
};
pub const PJRT_Error_Message_Args_STRUCT_SIZE: _bindgen_ty_4 = 40;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub type PJRT_Error_Message = ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Error_Message_Args)>;
pub const PJRT_Error_Code_PJRT_Error_Code_OK: PJRT_Error_Code = 0;
pub const PJRT_Error_Code_PJRT_Error_Code_CANCELLED: PJRT_Error_Code = 1;
pub const PJRT_Error_Code_PJRT_Error_Code_UNKNOWN: PJRT_Error_Code = 2;
pub const PJRT_Error_Code_PJRT_Error_Code_INVALID_ARGUMENT: PJRT_Error_Code = 3;
pub const PJRT_Error_Code_PJRT_Error_Code_DEADLINE_EXCEEDED: PJRT_Error_Code = 4;
pub const PJRT_Error_Code_PJRT_Error_Code_NOT_FOUND: PJRT_Error_Code = 5;
pub const PJRT_Error_Code_PJRT_Error_Code_ALREADY_EXISTS: PJRT_Error_Code = 6;
pub const PJRT_Error_Code_PJRT_Error_Code_PERMISSION_DENIED: PJRT_Error_Code = 7;
pub const PJRT_Error_Code_PJRT_Error_Code_RESOURCE_EXHAUSTED: PJRT_Error_Code = 8;
pub const PJRT_Error_Code_PJRT_Error_Code_FAILED_PRECONDITION: PJRT_Error_Code = 9;
pub const PJRT_Error_Code_PJRT_Error_Code_ABORTED: PJRT_Error_Code = 10;
pub const PJRT_Error_Code_PJRT_Error_Code_OUT_OF_RANGE: PJRT_Error_Code = 11;
pub const PJRT_Error_Code_PJRT_Error_Code_UNIMPLEMENTED: PJRT_Error_Code = 12;
pub const PJRT_Error_Code_PJRT_Error_Code_INTERNAL: PJRT_Error_Code = 13;
pub const PJRT_Error_Code_PJRT_Error_Code_UNAVAILABLE: PJRT_Error_Code = 14;
pub const PJRT_Error_Code_PJRT_Error_Code_DATA_LOSS: PJRT_Error_Code = 15;
pub const PJRT_Error_Code_PJRT_Error_Code_UNAUTHENTICATED: PJRT_Error_Code = 16;
pub type PJRT_Error_Code = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Error_GetCode_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub error: *const PJRT_Error,
    pub code: PJRT_Error_Code,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Error_GetCode_Args"][::std::mem::size_of::<PJRT_Error_GetCode_Args>() - 32usize];
    ["Alignment of PJRT_Error_GetCode_Args"][::std::mem::align_of::<PJRT_Error_GetCode_Args>() - 8usize];
    ["Offset of field: PJRT_Error_GetCode_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Error_GetCode_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Error_GetCode_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Error_GetCode_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Error_GetCode_Args::error"]
        [::std::mem::offset_of!(PJRT_Error_GetCode_Args, error) - 16usize];
    ["Offset of field: PJRT_Error_GetCode_Args::code"][::std::mem::offset_of!(PJRT_Error_GetCode_Args, code) - 24usize];
};
pub const PJRT_Error_GetCode_Args_STRUCT_SIZE: _bindgen_ty_5 = 28;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub type PJRT_Error_GetCode =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Error_GetCode_Args) -> *mut PJRT_Error>;
pub type PJRT_CallbackError = ::std::option::Option<
    unsafe extern "C" fn(
        code: PJRT_Error_Code,
        message: *const ::std::os::raw::c_char,
        message_size: usize,
    ) -> *mut PJRT_Error,
>;
pub const PJRT_NamedValue_Type_PJRT_NamedValue_kString: PJRT_NamedValue_Type = 0;
pub const PJRT_NamedValue_Type_PJRT_NamedValue_kInt64: PJRT_NamedValue_Type = 1;
pub const PJRT_NamedValue_Type_PJRT_NamedValue_kInt64List: PJRT_NamedValue_Type = 2;
pub const PJRT_NamedValue_Type_PJRT_NamedValue_kFloat: PJRT_NamedValue_Type = 3;
pub const PJRT_NamedValue_Type_PJRT_NamedValue_kBool: PJRT_NamedValue_Type = 4;
pub type PJRT_NamedValue_Type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct PJRT_NamedValue {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub name: *const ::std::os::raw::c_char,
    pub name_size: usize,
    pub type_: PJRT_NamedValue_Type,
    pub __bindgen_anon_1: PJRT_NamedValue__bindgen_ty_1,
    pub value_size: usize,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union PJRT_NamedValue__bindgen_ty_1 {
    pub string_value: *const ::std::os::raw::c_char,
    pub int64_value: i64,
    pub int64_array_value: *const i64,
    pub float_value: f32,
    pub bool_value: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_NamedValue__bindgen_ty_1"][::std::mem::size_of::<PJRT_NamedValue__bindgen_ty_1>() - 8usize];
    ["Alignment of PJRT_NamedValue__bindgen_ty_1"][::std::mem::align_of::<PJRT_NamedValue__bindgen_ty_1>() - 8usize];
    ["Offset of field: PJRT_NamedValue__bindgen_ty_1::string_value"]
        [::std::mem::offset_of!(PJRT_NamedValue__bindgen_ty_1, string_value) - 0usize];
    ["Offset of field: PJRT_NamedValue__bindgen_ty_1::int64_value"]
        [::std::mem::offset_of!(PJRT_NamedValue__bindgen_ty_1, int64_value) - 0usize];
    ["Offset of field: PJRT_NamedValue__bindgen_ty_1::int64_array_value"]
        [::std::mem::offset_of!(PJRT_NamedValue__bindgen_ty_1, int64_array_value) - 0usize];
    ["Offset of field: PJRT_NamedValue__bindgen_ty_1::float_value"]
        [::std::mem::offset_of!(PJRT_NamedValue__bindgen_ty_1, float_value) - 0usize];
    ["Offset of field: PJRT_NamedValue__bindgen_ty_1::bool_value"]
        [::std::mem::offset_of!(PJRT_NamedValue__bindgen_ty_1, bool_value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_NamedValue"][::std::mem::size_of::<PJRT_NamedValue>() - 56usize];
    ["Alignment of PJRT_NamedValue"][::std::mem::align_of::<PJRT_NamedValue>() - 8usize];
    ["Offset of field: PJRT_NamedValue::struct_size"][::std::mem::offset_of!(PJRT_NamedValue, struct_size) - 0usize];
    ["Offset of field: PJRT_NamedValue::extension_start"]
        [::std::mem::offset_of!(PJRT_NamedValue, extension_start) - 8usize];
    ["Offset of field: PJRT_NamedValue::name"][::std::mem::offset_of!(PJRT_NamedValue, name) - 16usize];
    ["Offset of field: PJRT_NamedValue::name_size"][::std::mem::offset_of!(PJRT_NamedValue, name_size) - 24usize];
    ["Offset of field: PJRT_NamedValue::type_"][::std::mem::offset_of!(PJRT_NamedValue, type_) - 32usize];
    ["Offset of field: PJRT_NamedValue::value_size"][::std::mem::offset_of!(PJRT_NamedValue, value_size) - 48usize];
};
pub const PJRT_NamedValue_STRUCT_SIZE: _bindgen_ty_6 = 56;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Plugin_Initialize_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Plugin_Initialize_Args"][::std::mem::size_of::<PJRT_Plugin_Initialize_Args>() - 16usize];
    ["Alignment of PJRT_Plugin_Initialize_Args"][::std::mem::align_of::<PJRT_Plugin_Initialize_Args>() - 8usize];
    ["Offset of field: PJRT_Plugin_Initialize_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Plugin_Initialize_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Plugin_Initialize_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Plugin_Initialize_Args, extension_start) - 8usize];
};
pub const PJRT_Plugin_Initialize_Args_STRUCT_SIZE: _bindgen_ty_7 = 16;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub type PJRT_Plugin_Initialize =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Plugin_Initialize_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Plugin_Attributes_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub attributes: *const PJRT_NamedValue,
    pub num_attributes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Plugin_Attributes_Args"][::std::mem::size_of::<PJRT_Plugin_Attributes_Args>() - 32usize];
    ["Alignment of PJRT_Plugin_Attributes_Args"][::std::mem::align_of::<PJRT_Plugin_Attributes_Args>() - 8usize];
    ["Offset of field: PJRT_Plugin_Attributes_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Plugin_Attributes_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Plugin_Attributes_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Plugin_Attributes_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Plugin_Attributes_Args::attributes"]
        [::std::mem::offset_of!(PJRT_Plugin_Attributes_Args, attributes) - 16usize];
    ["Offset of field: PJRT_Plugin_Attributes_Args::num_attributes"]
        [::std::mem::offset_of!(PJRT_Plugin_Attributes_Args, num_attributes) - 24usize];
};
pub const PJRT_Plugin_Attributes_Args_STRUCT_SIZE: _bindgen_ty_8 = 32;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub type PJRT_Plugin_Attributes =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Plugin_Attributes_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Event {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Event_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub event: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Event_Destroy_Args"][::std::mem::size_of::<PJRT_Event_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_Event_Destroy_Args"][::std::mem::align_of::<PJRT_Event_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_Event_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Event_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Event_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Event_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Event_Destroy_Args::event"]
        [::std::mem::offset_of!(PJRT_Event_Destroy_Args, event) - 16usize];
};
pub const PJRT_Event_Destroy_Args_STRUCT_SIZE: _bindgen_ty_9 = 24;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub type PJRT_Event_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Event_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Event_IsReady_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub event: *mut PJRT_Event,
    pub is_ready: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Event_IsReady_Args"][::std::mem::size_of::<PJRT_Event_IsReady_Args>() - 32usize];
    ["Alignment of PJRT_Event_IsReady_Args"][::std::mem::align_of::<PJRT_Event_IsReady_Args>() - 8usize];
    ["Offset of field: PJRT_Event_IsReady_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Event_IsReady_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Event_IsReady_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Event_IsReady_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Event_IsReady_Args::event"]
        [::std::mem::offset_of!(PJRT_Event_IsReady_Args, event) - 16usize];
    ["Offset of field: PJRT_Event_IsReady_Args::is_ready"]
        [::std::mem::offset_of!(PJRT_Event_IsReady_Args, is_ready) - 24usize];
};
pub const PJRT_Event_IsReady_Args_STRUCT_SIZE: _bindgen_ty_10 = 25;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
pub type PJRT_Event_IsReady =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Event_IsReady_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Event_Error_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub event: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Event_Error_Args"][::std::mem::size_of::<PJRT_Event_Error_Args>() - 24usize];
    ["Alignment of PJRT_Event_Error_Args"][::std::mem::align_of::<PJRT_Event_Error_Args>() - 8usize];
    ["Offset of field: PJRT_Event_Error_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Event_Error_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Event_Error_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Event_Error_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Event_Error_Args::event"][::std::mem::offset_of!(PJRT_Event_Error_Args, event) - 16usize];
};
pub const PJRT_Event_Error_Args_STRUCT_SIZE: _bindgen_ty_11 = 24;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
pub type PJRT_Event_Error =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Event_Error_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Event_Await_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub event: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Event_Await_Args"][::std::mem::size_of::<PJRT_Event_Await_Args>() - 24usize];
    ["Alignment of PJRT_Event_Await_Args"][::std::mem::align_of::<PJRT_Event_Await_Args>() - 8usize];
    ["Offset of field: PJRT_Event_Await_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Event_Await_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Event_Await_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Event_Await_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Event_Await_Args::event"][::std::mem::offset_of!(PJRT_Event_Await_Args, event) - 16usize];
};
pub const PJRT_Event_Await_Args_STRUCT_SIZE: _bindgen_ty_12 = 24;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
pub type PJRT_Event_Await =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Event_Await_Args) -> *mut PJRT_Error>;
pub type PJRT_Event_OnReadyCallback =
    ::std::option::Option<unsafe extern "C" fn(error: *mut PJRT_Error, user_arg: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Event_OnReady_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub event: *mut PJRT_Event,
    pub callback: PJRT_Event_OnReadyCallback,
    pub user_arg: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Event_OnReady_Args"][::std::mem::size_of::<PJRT_Event_OnReady_Args>() - 40usize];
    ["Alignment of PJRT_Event_OnReady_Args"][::std::mem::align_of::<PJRT_Event_OnReady_Args>() - 8usize];
    ["Offset of field: PJRT_Event_OnReady_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Event_OnReady_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Event_OnReady_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Event_OnReady_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Event_OnReady_Args::event"]
        [::std::mem::offset_of!(PJRT_Event_OnReady_Args, event) - 16usize];
    ["Offset of field: PJRT_Event_OnReady_Args::callback"]
        [::std::mem::offset_of!(PJRT_Event_OnReady_Args, callback) - 24usize];
    ["Offset of field: PJRT_Event_OnReady_Args::user_arg"]
        [::std::mem::offset_of!(PJRT_Event_OnReady_Args, user_arg) - 32usize];
};
pub const PJRT_Event_OnReady_Args_STRUCT_SIZE: _bindgen_ty_13 = 40;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
pub type PJRT_Event_OnReady =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Event_OnReady_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Event_Create_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub event: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Event_Create_Args"][::std::mem::size_of::<PJRT_Event_Create_Args>() - 24usize];
    ["Alignment of PJRT_Event_Create_Args"][::std::mem::align_of::<PJRT_Event_Create_Args>() - 8usize];
    ["Offset of field: PJRT_Event_Create_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Event_Create_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Event_Create_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Event_Create_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Event_Create_Args::event"][::std::mem::offset_of!(PJRT_Event_Create_Args, event) - 16usize];
};
pub const PJRT_Event_Create_Args_STRUCT_SIZE: _bindgen_ty_14 = 24;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
pub type PJRT_Event_Create =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Event_Create_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Event_Set_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub event: *mut PJRT_Event,
    pub error_code: PJRT_Error_Code,
    pub error_message: *const ::std::os::raw::c_char,
    pub error_message_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Event_Set_Args"][::std::mem::size_of::<PJRT_Event_Set_Args>() - 48usize];
    ["Alignment of PJRT_Event_Set_Args"][::std::mem::align_of::<PJRT_Event_Set_Args>() - 8usize];
    ["Offset of field: PJRT_Event_Set_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Event_Set_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Event_Set_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Event_Set_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Event_Set_Args::event"][::std::mem::offset_of!(PJRT_Event_Set_Args, event) - 16usize];
    ["Offset of field: PJRT_Event_Set_Args::error_code"]
        [::std::mem::offset_of!(PJRT_Event_Set_Args, error_code) - 24usize];
    ["Offset of field: PJRT_Event_Set_Args::error_message"]
        [::std::mem::offset_of!(PJRT_Event_Set_Args, error_message) - 32usize];
    ["Offset of field: PJRT_Event_Set_Args::error_message_size"]
        [::std::mem::offset_of!(PJRT_Event_Set_Args, error_message_size) - 40usize];
};
pub const PJRT_Event_Set_Args_STRUCT_SIZE: _bindgen_ty_15 = 48;
pub type _bindgen_ty_15 = ::std::os::raw::c_uint;
pub type PJRT_Event_Set =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Event_Set_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Memory {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_DeviceDescription {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_FulfillAliasBufferCallback {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_PhaseCompiler {
    _unused: [u8; 0],
}
pub type PJRT_KeyValueGetCallback_ValueDeleter =
    ::std::option::Option<unsafe extern "C" fn(value: *mut ::std::os::raw::c_char)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_KeyValueGetCallback_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub key: *const ::std::os::raw::c_char,
    pub key_size: usize,
    pub timeout_in_ms: ::std::os::raw::c_int,
    pub callback_error: *mut PJRT_CallbackError,
    pub user_arg: *mut ::std::os::raw::c_void,
    pub value: *mut ::std::os::raw::c_char,
    pub value_size: usize,
    pub value_deleter_callback: PJRT_KeyValueGetCallback_ValueDeleter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_KeyValueGetCallback_Args"][::std::mem::size_of::<PJRT_KeyValueGetCallback_Args>() - 80usize];
    ["Alignment of PJRT_KeyValueGetCallback_Args"][::std::mem::align_of::<PJRT_KeyValueGetCallback_Args>() - 8usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::key"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, key) - 16usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::key_size"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, key_size) - 24usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::timeout_in_ms"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, timeout_in_ms) - 32usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::callback_error"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, callback_error) - 40usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::user_arg"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, user_arg) - 48usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::value"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, value) - 56usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::value_size"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, value_size) - 64usize];
    ["Offset of field: PJRT_KeyValueGetCallback_Args::value_deleter_callback"]
        [::std::mem::offset_of!(PJRT_KeyValueGetCallback_Args, value_deleter_callback) - 72usize];
};
pub const PJRT_KeyValueGetCallback_Args_STRUCT_SIZE: _bindgen_ty_16 = 80;
pub type _bindgen_ty_16 = ::std::os::raw::c_uint;
pub type PJRT_KeyValueGetCallback =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_KeyValueGetCallback_Args) -> *mut PJRT_Error>;
pub type PJRT_KeyValueTryGetCallback_ValueDeleter =
    ::std::option::Option<unsafe extern "C" fn(value: *mut ::std::os::raw::c_char)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_KeyValueTryGetCallback_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub key: *const ::std::os::raw::c_char,
    pub key_size: usize,
    pub callback_error: *mut PJRT_CallbackError,
    pub user_arg: *mut ::std::os::raw::c_void,
    pub value: *mut ::std::os::raw::c_char,
    pub value_size: usize,
    pub value_deleter_callback: PJRT_KeyValueTryGetCallback_ValueDeleter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_KeyValueTryGetCallback_Args"][::std::mem::size_of::<PJRT_KeyValueTryGetCallback_Args>() - 72usize];
    ["Alignment of PJRT_KeyValueTryGetCallback_Args"]
        [::std::mem::align_of::<PJRT_KeyValueTryGetCallback_Args>() - 8usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::key"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, key) - 16usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::key_size"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, key_size) - 24usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::callback_error"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, callback_error) - 32usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::user_arg"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, user_arg) - 40usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::value"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, value) - 48usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::value_size"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, value_size) - 56usize];
    ["Offset of field: PJRT_KeyValueTryGetCallback_Args::value_deleter_callback"]
        [::std::mem::offset_of!(PJRT_KeyValueTryGetCallback_Args, value_deleter_callback) - 64usize];
};
pub const PJRT_KeyValueTryGetCallback_Args_STRUCT_SIZE: _bindgen_ty_17 = 72;
pub type _bindgen_ty_17 = ::std::os::raw::c_uint;
pub type PJRT_KeyValueTryGetCallback =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_KeyValueTryGetCallback_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_KeyValuePutCallback_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub key: *const ::std::os::raw::c_char,
    pub key_size: usize,
    pub value: *const ::std::os::raw::c_char,
    pub value_size: usize,
    pub callback_error: *mut PJRT_CallbackError,
    pub user_arg: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_KeyValuePutCallback_Args"][::std::mem::size_of::<PJRT_KeyValuePutCallback_Args>() - 64usize];
    ["Alignment of PJRT_KeyValuePutCallback_Args"][::std::mem::align_of::<PJRT_KeyValuePutCallback_Args>() - 8usize];
    ["Offset of field: PJRT_KeyValuePutCallback_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_KeyValuePutCallback_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_KeyValuePutCallback_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_KeyValuePutCallback_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_KeyValuePutCallback_Args::key"]
        [::std::mem::offset_of!(PJRT_KeyValuePutCallback_Args, key) - 16usize];
    ["Offset of field: PJRT_KeyValuePutCallback_Args::key_size"]
        [::std::mem::offset_of!(PJRT_KeyValuePutCallback_Args, key_size) - 24usize];
    ["Offset of field: PJRT_KeyValuePutCallback_Args::value"]
        [::std::mem::offset_of!(PJRT_KeyValuePutCallback_Args, value) - 32usize];
    ["Offset of field: PJRT_KeyValuePutCallback_Args::value_size"]
        [::std::mem::offset_of!(PJRT_KeyValuePutCallback_Args, value_size) - 40usize];
    ["Offset of field: PJRT_KeyValuePutCallback_Args::callback_error"]
        [::std::mem::offset_of!(PJRT_KeyValuePutCallback_Args, callback_error) - 48usize];
    ["Offset of field: PJRT_KeyValuePutCallback_Args::user_arg"]
        [::std::mem::offset_of!(PJRT_KeyValuePutCallback_Args, user_arg) - 56usize];
};
pub const PJRT_KeyValuePutCallback_Args_STRUCT_SIZE: _bindgen_ty_18 = 64;
pub type _bindgen_ty_18 = ::std::os::raw::c_uint;
pub type PJRT_KeyValuePutCallback =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_KeyValuePutCallback_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_Create_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub create_options: *const PJRT_NamedValue,
    pub num_options: usize,
    pub kv_get_callback: PJRT_KeyValueGetCallback,
    pub kv_get_user_arg: *mut ::std::os::raw::c_void,
    pub kv_put_callback: PJRT_KeyValuePutCallback,
    pub kv_put_user_arg: *mut ::std::os::raw::c_void,
    pub client: *mut PJRT_Client,
    pub kv_try_get_callback: PJRT_KeyValueTryGetCallback,
    pub kv_try_get_user_arg: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_Create_Args"][::std::mem::size_of::<PJRT_Client_Create_Args>() - 88usize];
    ["Alignment of PJRT_Client_Create_Args"][::std::mem::align_of::<PJRT_Client_Create_Args>() - 8usize];
    ["Offset of field: PJRT_Client_Create_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_Create_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_Create_Args::create_options"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, create_options) - 16usize];
    ["Offset of field: PJRT_Client_Create_Args::num_options"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, num_options) - 24usize];
    ["Offset of field: PJRT_Client_Create_Args::kv_get_callback"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, kv_get_callback) - 32usize];
    ["Offset of field: PJRT_Client_Create_Args::kv_get_user_arg"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, kv_get_user_arg) - 40usize];
    ["Offset of field: PJRT_Client_Create_Args::kv_put_callback"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, kv_put_callback) - 48usize];
    ["Offset of field: PJRT_Client_Create_Args::kv_put_user_arg"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, kv_put_user_arg) - 56usize];
    ["Offset of field: PJRT_Client_Create_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, client) - 64usize];
    ["Offset of field: PJRT_Client_Create_Args::kv_try_get_callback"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, kv_try_get_callback) - 72usize];
    ["Offset of field: PJRT_Client_Create_Args::kv_try_get_user_arg"]
        [::std::mem::offset_of!(PJRT_Client_Create_Args, kv_try_get_user_arg) - 80usize];
};
pub const PJRT_Client_Create_Args_STRUCT_SIZE: _bindgen_ty_19 = 88;
pub type _bindgen_ty_19 = ::std::os::raw::c_uint;
pub type PJRT_Client_Create =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_Create_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_Destroy_Args"][::std::mem::size_of::<PJRT_Client_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_Client_Destroy_Args"][::std::mem::align_of::<PJRT_Client_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_Client_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_Destroy_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_Destroy_Args, client) - 16usize];
};
pub const PJRT_Client_Destroy_Args_STRUCT_SIZE: _bindgen_ty_20 = 24;
pub type _bindgen_ty_20 = ::std::os::raw::c_uint;
pub type PJRT_Client_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_PlatformName_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub platform_name: *const ::std::os::raw::c_char,
    pub platform_name_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_PlatformName_Args"][::std::mem::size_of::<PJRT_Client_PlatformName_Args>() - 40usize];
    ["Alignment of PJRT_Client_PlatformName_Args"][::std::mem::align_of::<PJRT_Client_PlatformName_Args>() - 8usize];
    ["Offset of field: PJRT_Client_PlatformName_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_PlatformName_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_PlatformName_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_PlatformName_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_PlatformName_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_PlatformName_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_PlatformName_Args::platform_name"]
        [::std::mem::offset_of!(PJRT_Client_PlatformName_Args, platform_name) - 24usize];
    ["Offset of field: PJRT_Client_PlatformName_Args::platform_name_size"]
        [::std::mem::offset_of!(PJRT_Client_PlatformName_Args, platform_name_size) - 32usize];
};
pub const PJRT_Client_PlatformName_Args_STRUCT_SIZE: _bindgen_ty_21 = 40;
pub type _bindgen_ty_21 = ::std::os::raw::c_uint;
pub type PJRT_Client_PlatformName =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_PlatformName_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_ProcessIndex_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub process_index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_ProcessIndex_Args"][::std::mem::size_of::<PJRT_Client_ProcessIndex_Args>() - 32usize];
    ["Alignment of PJRT_Client_ProcessIndex_Args"][::std::mem::align_of::<PJRT_Client_ProcessIndex_Args>() - 8usize];
    ["Offset of field: PJRT_Client_ProcessIndex_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_ProcessIndex_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_ProcessIndex_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_ProcessIndex_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_ProcessIndex_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_ProcessIndex_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_ProcessIndex_Args::process_index"]
        [::std::mem::offset_of!(PJRT_Client_ProcessIndex_Args, process_index) - 24usize];
};
pub const PJRT_Client_ProcessIndex_Args_STRUCT_SIZE: _bindgen_ty_22 = 28;
pub type _bindgen_ty_22 = ::std::os::raw::c_uint;
pub type PJRT_Client_ProcessIndex =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_ProcessIndex_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_PlatformVersion_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub platform_version: *const ::std::os::raw::c_char,
    pub platform_version_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_PlatformVersion_Args"][::std::mem::size_of::<PJRT_Client_PlatformVersion_Args>() - 40usize];
    ["Alignment of PJRT_Client_PlatformVersion_Args"]
        [::std::mem::align_of::<PJRT_Client_PlatformVersion_Args>() - 8usize];
    ["Offset of field: PJRT_Client_PlatformVersion_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_PlatformVersion_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_PlatformVersion_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_PlatformVersion_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_PlatformVersion_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_PlatformVersion_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_PlatformVersion_Args::platform_version"]
        [::std::mem::offset_of!(PJRT_Client_PlatformVersion_Args, platform_version) - 24usize];
    ["Offset of field: PJRT_Client_PlatformVersion_Args::platform_version_size"]
        [::std::mem::offset_of!(PJRT_Client_PlatformVersion_Args, platform_version_size) - 32usize];
};
pub const PJRT_Client_PlatformVersion_Args_STRUCT_SIZE: _bindgen_ty_23 = 40;
pub type _bindgen_ty_23 = ::std::os::raw::c_uint;
pub type PJRT_Client_PlatformVersion =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_PlatformVersion_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_TopologyDescription_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub topology: *mut PJRT_TopologyDescription,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_TopologyDescription_Args"]
        [::std::mem::size_of::<PJRT_Client_TopologyDescription_Args>() - 32usize];
    ["Alignment of PJRT_Client_TopologyDescription_Args"]
        [::std::mem::align_of::<PJRT_Client_TopologyDescription_Args>() - 8usize];
    ["Offset of field: PJRT_Client_TopologyDescription_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_TopologyDescription_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_TopologyDescription_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_TopologyDescription_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_TopologyDescription_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_TopologyDescription_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_TopologyDescription_Args::topology"]
        [::std::mem::offset_of!(PJRT_Client_TopologyDescription_Args, topology) - 24usize];
};
pub const PJRT_Client_TopologyDescription_Args_STRUCT_SIZE: _bindgen_ty_24 = 32;
pub type _bindgen_ty_24 = ::std::os::raw::c_uint;
pub type PJRT_Client_TopologyDescription =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_TopologyDescription_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_Devices_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub devices: *const *mut PJRT_Device,
    pub num_devices: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_Devices_Args"][::std::mem::size_of::<PJRT_Client_Devices_Args>() - 40usize];
    ["Alignment of PJRT_Client_Devices_Args"][::std::mem::align_of::<PJRT_Client_Devices_Args>() - 8usize];
    ["Offset of field: PJRT_Client_Devices_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_Devices_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_Devices_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_Devices_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_Devices_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_Devices_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_Devices_Args::devices"]
        [::std::mem::offset_of!(PJRT_Client_Devices_Args, devices) - 24usize];
    ["Offset of field: PJRT_Client_Devices_Args::num_devices"]
        [::std::mem::offset_of!(PJRT_Client_Devices_Args, num_devices) - 32usize];
};
pub const PJRT_Client_Devices_Args_STRUCT_SIZE: _bindgen_ty_25 = 40;
pub type _bindgen_ty_25 = ::std::os::raw::c_uint;
pub type PJRT_Client_Devices =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_Devices_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_AddressableDevices_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub addressable_devices: *const *mut PJRT_Device,
    pub num_addressable_devices: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_AddressableDevices_Args"]
        [::std::mem::size_of::<PJRT_Client_AddressableDevices_Args>() - 40usize];
    ["Alignment of PJRT_Client_AddressableDevices_Args"]
        [::std::mem::align_of::<PJRT_Client_AddressableDevices_Args>() - 8usize];
    ["Offset of field: PJRT_Client_AddressableDevices_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_AddressableDevices_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_AddressableDevices_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_AddressableDevices_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_AddressableDevices_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_AddressableDevices_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_AddressableDevices_Args::addressable_devices"]
        [::std::mem::offset_of!(PJRT_Client_AddressableDevices_Args, addressable_devices) - 24usize];
    ["Offset of field: PJRT_Client_AddressableDevices_Args::num_addressable_devices"]
        [::std::mem::offset_of!(PJRT_Client_AddressableDevices_Args, num_addressable_devices) - 32usize];
};
pub const PJRT_Client_AddressableDevices_Args_STRUCT_SIZE: _bindgen_ty_26 = 40;
pub type _bindgen_ty_26 = ::std::os::raw::c_uint;
pub type PJRT_Client_AddressableDevices =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_AddressableDevices_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_LookupDevice_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub id: ::std::os::raw::c_int,
    pub device: *mut PJRT_Device,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_LookupDevice_Args"][::std::mem::size_of::<PJRT_Client_LookupDevice_Args>() - 40usize];
    ["Alignment of PJRT_Client_LookupDevice_Args"][::std::mem::align_of::<PJRT_Client_LookupDevice_Args>() - 8usize];
    ["Offset of field: PJRT_Client_LookupDevice_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_LookupDevice_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_LookupDevice_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_LookupDevice_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_LookupDevice_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_LookupDevice_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_LookupDevice_Args::id"]
        [::std::mem::offset_of!(PJRT_Client_LookupDevice_Args, id) - 24usize];
    ["Offset of field: PJRT_Client_LookupDevice_Args::device"]
        [::std::mem::offset_of!(PJRT_Client_LookupDevice_Args, device) - 32usize];
};
pub const PJRT_Client_LookupDevice_Args_STRUCT_SIZE: _bindgen_ty_27 = 40;
pub type _bindgen_ty_27 = ::std::os::raw::c_uint;
pub type PJRT_Client_LookupDevice =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_LookupDevice_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_LookupAddressableDevice_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub local_hardware_id: ::std::os::raw::c_int,
    pub addressable_device: *mut PJRT_Device,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_LookupAddressableDevice_Args"]
        [::std::mem::size_of::<PJRT_Client_LookupAddressableDevice_Args>() - 40usize];
    ["Alignment of PJRT_Client_LookupAddressableDevice_Args"]
        [::std::mem::align_of::<PJRT_Client_LookupAddressableDevice_Args>() - 8usize];
    ["Offset of field: PJRT_Client_LookupAddressableDevice_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_LookupAddressableDevice_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_LookupAddressableDevice_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_LookupAddressableDevice_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_LookupAddressableDevice_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_LookupAddressableDevice_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_LookupAddressableDevice_Args::local_hardware_id"]
        [::std::mem::offset_of!(PJRT_Client_LookupAddressableDevice_Args, local_hardware_id) - 24usize];
    ["Offset of field: PJRT_Client_LookupAddressableDevice_Args::addressable_device"]
        [::std::mem::offset_of!(PJRT_Client_LookupAddressableDevice_Args, addressable_device) - 32usize];
};
pub const PJRT_Client_LookupAddressableDevice_Args_STRUCT_SIZE: _bindgen_ty_28 = 40;
pub type _bindgen_ty_28 = ::std::os::raw::c_uint;
pub type PJRT_Client_LookupAddressableDevice =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_LookupAddressableDevice_Args) -> *mut PJRT_Error>;
pub const PJRT_ProcessState_PJRT_ProcessState_kUnspecified: PJRT_ProcessState = 0;
pub const PJRT_ProcessState_PJRT_ProcessState_kUninitialized: PJRT_ProcessState = 1;
pub const PJRT_ProcessState_PJRT_ProcessState_kDisconnected: PJRT_ProcessState = 2;
pub const PJRT_ProcessState_PJRT_ProcessState_kConnected: PJRT_ProcessState = 3;
pub const PJRT_ProcessState_PJRT_ProcessState_kError: PJRT_ProcessState = 4;
pub type PJRT_ProcessState = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_ProcessInfo {
    pub struct_size: usize,
    pub task_id: ::std::os::raw::c_int,
    pub incarnation_id: u64,
    pub state: PJRT_ProcessState,
    pub error_code: ::std::os::raw::c_int,
    pub error_message: *const ::std::os::raw::c_char,
    pub error_message_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_ProcessInfo"][::std::mem::size_of::<PJRT_ProcessInfo>() - 48usize];
    ["Alignment of PJRT_ProcessInfo"][::std::mem::align_of::<PJRT_ProcessInfo>() - 8usize];
    ["Offset of field: PJRT_ProcessInfo::struct_size"][::std::mem::offset_of!(PJRT_ProcessInfo, struct_size) - 0usize];
    ["Offset of field: PJRT_ProcessInfo::task_id"][::std::mem::offset_of!(PJRT_ProcessInfo, task_id) - 8usize];
    ["Offset of field: PJRT_ProcessInfo::incarnation_id"]
        [::std::mem::offset_of!(PJRT_ProcessInfo, incarnation_id) - 16usize];
    ["Offset of field: PJRT_ProcessInfo::state"][::std::mem::offset_of!(PJRT_ProcessInfo, state) - 24usize];
    ["Offset of field: PJRT_ProcessInfo::error_code"][::std::mem::offset_of!(PJRT_ProcessInfo, error_code) - 28usize];
    ["Offset of field: PJRT_ProcessInfo::error_message"]
        [::std::mem::offset_of!(PJRT_ProcessInfo, error_message) - 32usize];
    ["Offset of field: PJRT_ProcessInfo::error_message_size"]
        [::std::mem::offset_of!(PJRT_ProcessInfo, error_message_size) - 40usize];
};
pub const PJRT_ProcessInfo_STRUCT_SIZE: _bindgen_ty_29 = 48;
pub type _bindgen_ty_29 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_UpdateGlobalProcessInfo_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub process_infos: *mut PJRT_ProcessInfo,
    pub num_process_infos: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_UpdateGlobalProcessInfo_Args"]
        [::std::mem::size_of::<PJRT_Client_UpdateGlobalProcessInfo_Args>() - 40usize];
    ["Alignment of PJRT_Client_UpdateGlobalProcessInfo_Args"]
        [::std::mem::align_of::<PJRT_Client_UpdateGlobalProcessInfo_Args>() - 8usize];
    ["Offset of field: PJRT_Client_UpdateGlobalProcessInfo_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_UpdateGlobalProcessInfo_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_UpdateGlobalProcessInfo_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_UpdateGlobalProcessInfo_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_UpdateGlobalProcessInfo_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_UpdateGlobalProcessInfo_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_UpdateGlobalProcessInfo_Args::process_infos"]
        [::std::mem::offset_of!(PJRT_Client_UpdateGlobalProcessInfo_Args, process_infos) - 24usize];
    ["Offset of field: PJRT_Client_UpdateGlobalProcessInfo_Args::num_process_infos"]
        [::std::mem::offset_of!(PJRT_Client_UpdateGlobalProcessInfo_Args, num_process_infos) - 32usize];
};
pub const PJRT_Client_UpdateGlobalProcessInfo_Args_STRUCT_SIZE: _bindgen_ty_30 = 40;
pub type _bindgen_ty_30 = ::std::os::raw::c_uint;
pub type PJRT_Client_UpdateGlobalProcessInfo =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_UpdateGlobalProcessInfo_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_AddressableMemories_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub addressable_memories: *const *mut PJRT_Memory,
    pub num_addressable_memories: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_AddressableMemories_Args"]
        [::std::mem::size_of::<PJRT_Client_AddressableMemories_Args>() - 40usize];
    ["Alignment of PJRT_Client_AddressableMemories_Args"]
        [::std::mem::align_of::<PJRT_Client_AddressableMemories_Args>() - 8usize];
    ["Offset of field: PJRT_Client_AddressableMemories_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_AddressableMemories_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_AddressableMemories_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_AddressableMemories_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_AddressableMemories_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_AddressableMemories_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_AddressableMemories_Args::addressable_memories"]
        [::std::mem::offset_of!(PJRT_Client_AddressableMemories_Args, addressable_memories) - 24usize];
    ["Offset of field: PJRT_Client_AddressableMemories_Args::num_addressable_memories"]
        [::std::mem::offset_of!(PJRT_Client_AddressableMemories_Args, num_addressable_memories) - 32usize];
};
pub const PJRT_Client_AddressableMemories_Args_STRUCT_SIZE: _bindgen_ty_31 = 40;
pub type _bindgen_ty_31 = ::std::os::raw::c_uint;
pub type PJRT_Client_AddressableMemories =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_AddressableMemories_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Program {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub code: *mut ::std::os::raw::c_char,
    pub code_size: usize,
    pub format: *const ::std::os::raw::c_char,
    pub format_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Program"][::std::mem::size_of::<PJRT_Program>() - 48usize];
    ["Alignment of PJRT_Program"][::std::mem::align_of::<PJRT_Program>() - 8usize];
    ["Offset of field: PJRT_Program::struct_size"][::std::mem::offset_of!(PJRT_Program, struct_size) - 0usize];
    ["Offset of field: PJRT_Program::extension_start"][::std::mem::offset_of!(PJRT_Program, extension_start) - 8usize];
    ["Offset of field: PJRT_Program::code"][::std::mem::offset_of!(PJRT_Program, code) - 16usize];
    ["Offset of field: PJRT_Program::code_size"][::std::mem::offset_of!(PJRT_Program, code_size) - 24usize];
    ["Offset of field: PJRT_Program::format"][::std::mem::offset_of!(PJRT_Program, format) - 32usize];
    ["Offset of field: PJRT_Program::format_size"][::std::mem::offset_of!(PJRT_Program, format_size) - 40usize];
};
pub const PJRT_Program_STRUCT_SIZE: _bindgen_ty_32 = 48;
pub type _bindgen_ty_32 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_Compile_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub program: *const PJRT_Program,
    pub compile_options: *const ::std::os::raw::c_char,
    pub compile_options_size: usize,
    pub executable: *mut PJRT_LoadedExecutable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_Compile_Args"][::std::mem::size_of::<PJRT_Client_Compile_Args>() - 56usize];
    ["Alignment of PJRT_Client_Compile_Args"][::std::mem::align_of::<PJRT_Client_Compile_Args>() - 8usize];
    ["Offset of field: PJRT_Client_Compile_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_Compile_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_Compile_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_Compile_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_Compile_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_Compile_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_Compile_Args::program"]
        [::std::mem::offset_of!(PJRT_Client_Compile_Args, program) - 24usize];
    ["Offset of field: PJRT_Client_Compile_Args::compile_options"]
        [::std::mem::offset_of!(PJRT_Client_Compile_Args, compile_options) - 32usize];
    ["Offset of field: PJRT_Client_Compile_Args::compile_options_size"]
        [::std::mem::offset_of!(PJRT_Client_Compile_Args, compile_options_size) - 40usize];
    ["Offset of field: PJRT_Client_Compile_Args::executable"]
        [::std::mem::offset_of!(PJRT_Client_Compile_Args, executable) - 48usize];
};
pub const PJRT_Client_Compile_Args_STRUCT_SIZE: _bindgen_ty_33 = 56;
pub type _bindgen_ty_33 = ::std::os::raw::c_uint;
pub type PJRT_Client_Compile =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_Compile_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_DefaultDeviceAssignment_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub num_replicas: ::std::os::raw::c_int,
    pub num_partitions: ::std::os::raw::c_int,
    pub default_assignment_size: usize,
    pub default_assignment: *mut ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_DefaultDeviceAssignment_Args"]
        [::std::mem::size_of::<PJRT_Client_DefaultDeviceAssignment_Args>() - 48usize];
    ["Alignment of PJRT_Client_DefaultDeviceAssignment_Args"]
        [::std::mem::align_of::<PJRT_Client_DefaultDeviceAssignment_Args>() - 8usize];
    ["Offset of field: PJRT_Client_DefaultDeviceAssignment_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_DefaultDeviceAssignment_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_DefaultDeviceAssignment_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_DefaultDeviceAssignment_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_DefaultDeviceAssignment_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_DefaultDeviceAssignment_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_DefaultDeviceAssignment_Args::num_replicas"]
        [::std::mem::offset_of!(PJRT_Client_DefaultDeviceAssignment_Args, num_replicas) - 24usize];
    ["Offset of field: PJRT_Client_DefaultDeviceAssignment_Args::num_partitions"]
        [::std::mem::offset_of!(PJRT_Client_DefaultDeviceAssignment_Args, num_partitions) - 28usize];
    ["Offset of field: PJRT_Client_DefaultDeviceAssignment_Args::default_assignment_size"]
        [::std::mem::offset_of!(PJRT_Client_DefaultDeviceAssignment_Args, default_assignment_size) - 32usize];
    ["Offset of field: PJRT_Client_DefaultDeviceAssignment_Args::default_assignment"]
        [::std::mem::offset_of!(PJRT_Client_DefaultDeviceAssignment_Args, default_assignment) - 40usize];
};
pub const PJRT_Client_DefaultDeviceAssignment_Args_STRUCT_SIZE: _bindgen_ty_34 = 48;
pub type _bindgen_ty_34 = ::std::os::raw::c_uint;
pub type PJRT_Client_DefaultDeviceAssignment =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_DefaultDeviceAssignment_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_DmaMap_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub data: *mut ::std::os::raw::c_void,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_DmaMap_Args"][::std::mem::size_of::<PJRT_Client_DmaMap_Args>() - 40usize];
    ["Alignment of PJRT_Client_DmaMap_Args"][::std::mem::align_of::<PJRT_Client_DmaMap_Args>() - 8usize];
    ["Offset of field: PJRT_Client_DmaMap_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_DmaMap_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_DmaMap_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_DmaMap_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_DmaMap_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_DmaMap_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_DmaMap_Args::data"][::std::mem::offset_of!(PJRT_Client_DmaMap_Args, data) - 24usize];
    ["Offset of field: PJRT_Client_DmaMap_Args::size"][::std::mem::offset_of!(PJRT_Client_DmaMap_Args, size) - 32usize];
};
pub const PJRT_Client_DmaMap_Args_STRUCT_SIZE: _bindgen_ty_35 = 40;
pub type _bindgen_ty_35 = ::std::os::raw::c_uint;
pub type PJRT_Client_DmaMap =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_DmaMap_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_DmaUnmap_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_DmaUnmap_Args"][::std::mem::size_of::<PJRT_Client_DmaUnmap_Args>() - 32usize];
    ["Alignment of PJRT_Client_DmaUnmap_Args"][::std::mem::align_of::<PJRT_Client_DmaUnmap_Args>() - 8usize];
    ["Offset of field: PJRT_Client_DmaUnmap_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_DmaUnmap_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_DmaUnmap_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_DmaUnmap_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_DmaUnmap_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_DmaUnmap_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_DmaUnmap_Args::data"]
        [::std::mem::offset_of!(PJRT_Client_DmaUnmap_Args, data) - 24usize];
};
pub const PJRT_Client_DmaUnmap_Args_STRUCT_SIZE: _bindgen_ty_36 = 32;
pub type _bindgen_ty_36 = ::std::os::raw::c_uint;
pub type PJRT_Client_DmaUnmap =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_DmaUnmap_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_Destroy_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_Destroy_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_Destroy_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_Destroy_Args, transfer_manager) - 16usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_Destroy_Args_STRUCT_SIZE: _bindgen_ty_37 = 24;
pub type _bindgen_ty_37 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_Destroy = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_Destroy_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_TransferData_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
    pub buffer_index: ::std::os::raw::c_int,
    pub data: *const ::std::os::raw::c_void,
    pub offset: i64,
    pub transfer_size: i64,
    pub is_last_transfer: bool,
    pub done_with_h2d_transfer: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_TransferData_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_TransferData_Args>() - 72usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_TransferData_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_TransferData_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferData_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferData_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferData_Args, transfer_manager) - 16usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::buffer_index"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferData_Args, buffer_index) - 24usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::data"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferData_Args, data) - 32usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::offset"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferData_Args, offset) - 40usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::transfer_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferData_Args, transfer_size) - 48usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::is_last_transfer"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferData_Args, is_last_transfer) - 56usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferData_Args::done_with_h2d_transfer"][::std::mem::offset_of!(
        PJRT_AsyncHostToDeviceTransferManager_TransferData_Args,
        done_with_h2d_transfer
    ) - 64usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_TransferData_Args_STRUCT_SIZE: _bindgen_ty_38 = 72;
pub type _bindgen_ty_38 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_TransferData = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_TransferData_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
    pub buffer_index: ::std::os::raw::c_int,
    pub buffer_out: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args>() - 40usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args, transfer_manager) - 16usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args::buffer_index"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args, buffer_index) - 24usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args::buffer_out"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args, buffer_out) - 32usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args_STRUCT_SIZE: _bindgen_ty_39 = 40;
pub type _bindgen_ty_39 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_Device_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
    pub device_out: *mut PJRT_Device,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_Device_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_Device_Args>() - 32usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_Device_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_Device_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_Device_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_Device_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_Device_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_Device_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_Device_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_Device_Args, transfer_manager) - 16usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_Device_Args::device_out"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_Device_Args, device_out) - 24usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_Device_Args_STRUCT_SIZE: _bindgen_ty_40 = 32;
pub type _bindgen_ty_40 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_Device = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_Device_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
    pub buffer_count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args>() - 32usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args, transfer_manager) - 16usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args::buffer_count"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args, buffer_count) - 24usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args_STRUCT_SIZE: _bindgen_ty_41 = 32;
pub type _bindgen_ty_41 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_BufferCount = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_BufferCount_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
    pub buffer_index: ::std::os::raw::c_int,
    pub buffer_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args>() - 40usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args, transfer_manager) - 16usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args::buffer_index"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args, buffer_index) - 24usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args::buffer_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args, buffer_size) - 32usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args_STRUCT_SIZE: _bindgen_ty_42 = 40;
pub type _bindgen_ty_42 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_BufferSize = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_BufferSize_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
    pub buffer_index: ::std::os::raw::c_int,
    pub error_code: PJRT_Error_Code,
    pub error_message: *const ::std::os::raw::c_char,
    pub error_message_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args>() - 48usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args, transfer_manager) - 16usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args::buffer_index"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args, buffer_index) - 24usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args::error_code"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args, error_code) - 28usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args::error_message"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args, error_message) - 32usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args::error_message_size"][::std::mem::offset_of!(
        PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args,
        error_message_size
    ) - 40usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args_STRUCT_SIZE: _bindgen_ty_43 = 48;
pub type _bindgen_ty_43 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_SetBufferError = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_SetBufferError_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
    pub transfer_metadata: *const PJRT_NamedValue,
    pub num_metadata: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args>() - 40usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args, transfer_manager) - 16usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args::transfer_metadata"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args, transfer_metadata) - 24usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args::num_metadata"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args, num_metadata) - 32usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args_STRUCT_SIZE: _bindgen_ty_44 = 40;
pub type _bindgen_ty_44 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_AddMetadata = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_AddMetadata_Args) -> *mut PJRT_Error,
>;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_INVALID: PJRT_Buffer_Type = 0;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_PRED: PJRT_Buffer_Type = 1;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_S8: PJRT_Buffer_Type = 2;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_S16: PJRT_Buffer_Type = 3;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_S32: PJRT_Buffer_Type = 4;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_S64: PJRT_Buffer_Type = 5;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_U8: PJRT_Buffer_Type = 6;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_U16: PJRT_Buffer_Type = 7;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_U32: PJRT_Buffer_Type = 8;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_U64: PJRT_Buffer_Type = 9;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F16: PJRT_Buffer_Type = 10;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F32: PJRT_Buffer_Type = 11;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F64: PJRT_Buffer_Type = 12;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_BF16: PJRT_Buffer_Type = 13;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_C64: PJRT_Buffer_Type = 14;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_C128: PJRT_Buffer_Type = 15;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F8E5M2: PJRT_Buffer_Type = 16;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F8E4M3FN: PJRT_Buffer_Type = 17;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F8E4M3B11FNUZ: PJRT_Buffer_Type = 18;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F8E5M2FNUZ: PJRT_Buffer_Type = 19;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F8E4M3FNUZ: PJRT_Buffer_Type = 20;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_S4: PJRT_Buffer_Type = 21;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_U4: PJRT_Buffer_Type = 22;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_TOKEN: PJRT_Buffer_Type = 23;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_S2: PJRT_Buffer_Type = 24;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_U2: PJRT_Buffer_Type = 25;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F8E4M3: PJRT_Buffer_Type = 26;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F8E3M4: PJRT_Buffer_Type = 27;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F8E8M0FNU: PJRT_Buffer_Type = 28;
pub const PJRT_Buffer_Type_PJRT_Buffer_Type_F4E2M1FN: PJRT_Buffer_Type = 29;
pub type PJRT_Buffer_Type = ::std::os::raw::c_uint;
pub const PJRT_HostBufferSemantics_PJRT_HostBufferSemantics_kImmutableOnlyDuringCall: PJRT_HostBufferSemantics = 0;
pub const PJRT_HostBufferSemantics_PJRT_HostBufferSemantics_kImmutableUntilTransferCompletes: PJRT_HostBufferSemantics =
    1;
pub const PJRT_HostBufferSemantics_PJRT_HostBufferSemantics_kImmutableZeroCopy: PJRT_HostBufferSemantics = 2;
pub const PJRT_HostBufferSemantics_PJRT_HostBufferSemantics_kMutableZeroCopy: PJRT_HostBufferSemantics = 3;
pub type PJRT_HostBufferSemantics = ::std::os::raw::c_uint;
pub const PJRT_Buffer_MemoryLayout_Type_PJRT_Buffer_MemoryLayout_Type_Tiled: PJRT_Buffer_MemoryLayout_Type = 0;
pub const PJRT_Buffer_MemoryLayout_Type_PJRT_Buffer_MemoryLayout_Type_Strides: PJRT_Buffer_MemoryLayout_Type = 1;
pub type PJRT_Buffer_MemoryLayout_Type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_MemoryLayout_Tiled {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub minor_to_major: *const i64,
    pub minor_to_major_size: usize,
    pub tile_dims: *const i64,
    pub tile_dim_sizes: *const usize,
    pub num_tiles: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_MemoryLayout_Tiled"][::std::mem::size_of::<PJRT_Buffer_MemoryLayout_Tiled>() - 56usize];
    ["Alignment of PJRT_Buffer_MemoryLayout_Tiled"][::std::mem::align_of::<PJRT_Buffer_MemoryLayout_Tiled>() - 8usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Tiled::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Tiled, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Tiled::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Tiled, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Tiled::minor_to_major"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Tiled, minor_to_major) - 16usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Tiled::minor_to_major_size"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Tiled, minor_to_major_size) - 24usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Tiled::tile_dims"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Tiled, tile_dims) - 32usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Tiled::tile_dim_sizes"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Tiled, tile_dim_sizes) - 40usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Tiled::num_tiles"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Tiled, num_tiles) - 48usize];
};
pub const PJRT_Buffer_MemoryLayout_Tiled_STRUCT_SIZE: _bindgen_ty_45 = 56;
pub type _bindgen_ty_45 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_MemoryLayout_Strides {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub byte_strides: *const i64,
    pub num_byte_strides: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_MemoryLayout_Strides"][::std::mem::size_of::<PJRT_Buffer_MemoryLayout_Strides>() - 32usize];
    ["Alignment of PJRT_Buffer_MemoryLayout_Strides"]
        [::std::mem::align_of::<PJRT_Buffer_MemoryLayout_Strides>() - 8usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Strides::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Strides, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Strides::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Strides, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Strides::byte_strides"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Strides, byte_strides) - 16usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout_Strides::num_byte_strides"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout_Strides, num_byte_strides) - 24usize];
};
pub const PJRT_Buffer_MemoryLayout_Strides_STRUCT_SIZE: _bindgen_ty_46 = 32;
pub type _bindgen_ty_46 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct PJRT_Buffer_MemoryLayout {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub __bindgen_anon_1: PJRT_Buffer_MemoryLayout__bindgen_ty_1,
    pub type_: PJRT_Buffer_MemoryLayout_Type,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union PJRT_Buffer_MemoryLayout__bindgen_ty_1 {
    pub tiled: PJRT_Buffer_MemoryLayout_Tiled,
    pub strides: PJRT_Buffer_MemoryLayout_Strides,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_MemoryLayout__bindgen_ty_1"]
        [::std::mem::size_of::<PJRT_Buffer_MemoryLayout__bindgen_ty_1>() - 56usize];
    ["Alignment of PJRT_Buffer_MemoryLayout__bindgen_ty_1"]
        [::std::mem::align_of::<PJRT_Buffer_MemoryLayout__bindgen_ty_1>() - 8usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout__bindgen_ty_1::tiled"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout__bindgen_ty_1, tiled) - 0usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout__bindgen_ty_1::strides"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout__bindgen_ty_1, strides) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_MemoryLayout"][::std::mem::size_of::<PJRT_Buffer_MemoryLayout>() - 80usize];
    ["Alignment of PJRT_Buffer_MemoryLayout"][::std::mem::align_of::<PJRT_Buffer_MemoryLayout>() - 8usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_MemoryLayout::type_"]
        [::std::mem::offset_of!(PJRT_Buffer_MemoryLayout, type_) - 72usize];
};
pub const PJRT_Buffer_MemoryLayout_STRUCT_SIZE: _bindgen_ty_47 = 76;
pub type _bindgen_ty_47 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
    pub buffer_index: ::std::os::raw::c_int,
    pub data: *const ::std::os::raw::c_void,
    pub shape_dims: *const i64,
    pub shape_num_dims: usize,
    pub shape_element_type: PJRT_Buffer_Type,
    pub shape_layout: *mut PJRT_Buffer_MemoryLayout,
    pub done_with_h2d_transfer: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args"]
        [::std::mem::size_of::<PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args>() - 80usize];
    ["Alignment of PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args"]
        [::std::mem::align_of::<PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::transfer_manager"][::std::mem::offset_of!(
        PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args,
        transfer_manager
    ) - 16usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::buffer_index"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args, buffer_index) - 24usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::data"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args, data) - 32usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::shape_dims"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args, shape_dims) - 40usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::shape_num_dims"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args, shape_num_dims) - 48usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::shape_element_type"][::std::mem::offset_of!(
        PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args,
        shape_element_type
    ) - 56usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::shape_layout"]
        [::std::mem::offset_of!(PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args, shape_layout) - 64usize];
    ["Offset of field: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args::done_with_h2d_transfer"][::std::mem::offset_of!(
        PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args,
        done_with_h2d_transfer
    )
        - 72usize];
};
pub const PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args_STRUCT_SIZE: _bindgen_ty_48 = 80;
pub type _bindgen_ty_48 = ::std::os::raw::c_uint;
pub type PJRT_AsyncHostToDeviceTransferManager_TransferLiteral = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_AsyncHostToDeviceTransferManager_TransferLiteral_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_CreateUninitializedBuffer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub shape_dims: *const i64,
    pub shape_num_dims: usize,
    pub shape_element_type: PJRT_Buffer_Type,
    pub shape_layout: *mut PJRT_Buffer_MemoryLayout,
    pub device: *mut PJRT_Device,
    pub memory: *mut PJRT_Memory,
    pub buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_CreateUninitializedBuffer_Args"]
        [::std::mem::size_of::<PJRT_Client_CreateUninitializedBuffer_Args>() - 80usize];
    ["Alignment of PJRT_Client_CreateUninitializedBuffer_Args"]
        [::std::mem::align_of::<PJRT_Client_CreateUninitializedBuffer_Args>() - 8usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::shape_dims"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, shape_dims) - 24usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::shape_num_dims"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, shape_num_dims) - 32usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::shape_element_type"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, shape_element_type) - 40usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::shape_layout"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, shape_layout) - 48usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::device"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, device) - 56usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::memory"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, memory) - 64usize];
    ["Offset of field: PJRT_Client_CreateUninitializedBuffer_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Client_CreateUninitializedBuffer_Args, buffer) - 72usize];
};
pub const PJRT_Client_CreateUninitializedBuffer_Args_STRUCT_SIZE: _bindgen_ty_49 = 80;
pub type _bindgen_ty_49 = ::std::os::raw::c_uint;
pub type PJRT_Client_CreateUninitializedBuffer = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Client_CreateUninitializedBuffer_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_CreateErrorBuffer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub error_code: PJRT_Error_Code,
    pub error_message: *const ::std::os::raw::c_char,
    pub error_message_size: usize,
    pub shape_dims: *const i64,
    pub shape_num_dims: usize,
    pub shape_element_type: PJRT_Buffer_Type,
    pub shape_layout: *mut PJRT_Buffer_MemoryLayout,
    pub memory: *mut PJRT_Memory,
    pub buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_CreateErrorBuffer_Args"]
        [::std::mem::size_of::<PJRT_Client_CreateErrorBuffer_Args>() - 96usize];
    ["Alignment of PJRT_Client_CreateErrorBuffer_Args"]
        [::std::mem::align_of::<PJRT_Client_CreateErrorBuffer_Args>() - 8usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::error_code"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, error_code) - 24usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::error_message"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, error_message) - 32usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::error_message_size"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, error_message_size) - 40usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::shape_dims"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, shape_dims) - 48usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::shape_num_dims"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, shape_num_dims) - 56usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::shape_element_type"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, shape_element_type) - 64usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::shape_layout"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, shape_layout) - 72usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::memory"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, memory) - 80usize];
    ["Offset of field: PJRT_Client_CreateErrorBuffer_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Client_CreateErrorBuffer_Args, buffer) - 88usize];
};
pub const PJRT_Client_CreateErrorBuffer_Args_STRUCT_SIZE: _bindgen_ty_50 = 96;
pub type _bindgen_ty_50 = ::std::os::raw::c_uint;
pub type PJRT_Client_CreateErrorBuffer =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_CreateErrorBuffer_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_CreateAliasBuffer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub memory: *mut PJRT_Memory,
    pub shape_dims: *const i64,
    pub shape_num_dims: usize,
    pub shape_element_type: PJRT_Buffer_Type,
    pub shape_layout: *mut PJRT_Buffer_MemoryLayout,
    pub alias_buffer: *mut PJRT_Buffer,
    pub fulfill_alias_buffer_cb: *mut PJRT_FulfillAliasBufferCallback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_CreateAliasBuffer_Args"]
        [::std::mem::size_of::<PJRT_Client_CreateAliasBuffer_Args>() - 80usize];
    ["Alignment of PJRT_Client_CreateAliasBuffer_Args"]
        [::std::mem::align_of::<PJRT_Client_CreateAliasBuffer_Args>() - 8usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::memory"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, memory) - 24usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::shape_dims"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, shape_dims) - 32usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::shape_num_dims"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, shape_num_dims) - 40usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::shape_element_type"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, shape_element_type) - 48usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::shape_layout"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, shape_layout) - 56usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::alias_buffer"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, alias_buffer) - 64usize];
    ["Offset of field: PJRT_Client_CreateAliasBuffer_Args::fulfill_alias_buffer_cb"]
        [::std::mem::offset_of!(PJRT_Client_CreateAliasBuffer_Args, fulfill_alias_buffer_cb) - 72usize];
};
pub const PJRT_Client_CreateAliasBuffer_Args_STRUCT_SIZE: _bindgen_ty_51 = 80;
pub type _bindgen_ty_51 = ::std::os::raw::c_uint;
pub type PJRT_Client_CreateAliasBuffer =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_CreateAliasBuffer_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_FulfillAliasBuffer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub buffer: *mut PJRT_Buffer,
    pub status_code: PJRT_Error_Code,
    pub error_message: *const ::std::os::raw::c_char,
    pub error_message_size: usize,
    pub fulfill_alias_buffer_cb: *mut PJRT_FulfillAliasBufferCallback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_FulfillAliasBuffer_Args"]
        [::std::mem::size_of::<PJRT_Client_FulfillAliasBuffer_Args>() - 64usize];
    ["Alignment of PJRT_Client_FulfillAliasBuffer_Args"]
        [::std::mem::align_of::<PJRT_Client_FulfillAliasBuffer_Args>() - 8usize];
    ["Offset of field: PJRT_Client_FulfillAliasBuffer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_FulfillAliasBuffer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_FulfillAliasBuffer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_FulfillAliasBuffer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_FulfillAliasBuffer_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_FulfillAliasBuffer_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_FulfillAliasBuffer_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Client_FulfillAliasBuffer_Args, buffer) - 24usize];
    ["Offset of field: PJRT_Client_FulfillAliasBuffer_Args::status_code"]
        [::std::mem::offset_of!(PJRT_Client_FulfillAliasBuffer_Args, status_code) - 32usize];
    ["Offset of field: PJRT_Client_FulfillAliasBuffer_Args::error_message"]
        [::std::mem::offset_of!(PJRT_Client_FulfillAliasBuffer_Args, error_message) - 40usize];
    ["Offset of field: PJRT_Client_FulfillAliasBuffer_Args::error_message_size"]
        [::std::mem::offset_of!(PJRT_Client_FulfillAliasBuffer_Args, error_message_size) - 48usize];
    ["Offset of field: PJRT_Client_FulfillAliasBuffer_Args::fulfill_alias_buffer_cb"]
        [::std::mem::offset_of!(PJRT_Client_FulfillAliasBuffer_Args, fulfill_alias_buffer_cb) - 56usize];
};
pub const PJRT_Client_FulfillAliasBuffer_Args_STRUCT_SIZE: _bindgen_ty_52 = 64;
pub type _bindgen_ty_52 = ::std::os::raw::c_uint;
pub type PJRT_Client_FulfillAliasBuffer =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_FulfillAliasBuffer_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_BufferFromHostBuffer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub data: *const ::std::os::raw::c_void,
    pub type_: PJRT_Buffer_Type,
    pub dims: *const i64,
    pub num_dims: usize,
    pub byte_strides: *const i64,
    pub num_byte_strides: usize,
    pub host_buffer_semantics: PJRT_HostBufferSemantics,
    pub device: *mut PJRT_Device,
    pub memory: *mut PJRT_Memory,
    pub device_layout: *mut PJRT_Buffer_MemoryLayout,
    pub done_with_host_buffer: *mut PJRT_Event,
    pub buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_BufferFromHostBuffer_Args"]
        [::std::mem::size_of::<PJRT_Client_BufferFromHostBuffer_Args>() - 120usize];
    ["Alignment of PJRT_Client_BufferFromHostBuffer_Args"]
        [::std::mem::align_of::<PJRT_Client_BufferFromHostBuffer_Args>() - 8usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::data"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, data) - 24usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::type_"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, type_) - 32usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::dims"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, dims) - 40usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::num_dims"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, num_dims) - 48usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::byte_strides"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, byte_strides) - 56usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::num_byte_strides"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, num_byte_strides) - 64usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::host_buffer_semantics"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, host_buffer_semantics) - 72usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::device"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, device) - 80usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::memory"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, memory) - 88usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::device_layout"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, device_layout) - 96usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::done_with_host_buffer"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, done_with_host_buffer) - 104usize];
    ["Offset of field: PJRT_Client_BufferFromHostBuffer_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Client_BufferFromHostBuffer_Args, buffer) - 112usize];
};
pub const PJRT_Client_BufferFromHostBuffer_Args_STRUCT_SIZE: _bindgen_ty_53 = 120;
pub type _bindgen_ty_53 = ::std::os::raw::c_uint;
pub type PJRT_Client_BufferFromHostBuffer =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Client_BufferFromHostBuffer_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_CreateViewOfDeviceBuffer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub device_buffer_ptr: *mut ::std::os::raw::c_void,
    pub dims: *const i64,
    pub num_dims: usize,
    pub element_type: PJRT_Buffer_Type,
    pub layout: *mut PJRT_Buffer_MemoryLayout,
    pub device: *mut PJRT_Device,
    pub on_delete_callback: ::std::option::Option<
        unsafe extern "C" fn(device_buffer_ptr: *mut ::std::os::raw::c_void, user_arg: *mut ::std::os::raw::c_void),
    >,
    pub on_delete_callback_arg: *mut ::std::os::raw::c_void,
    pub stream: isize,
    pub buffer: *mut PJRT_Buffer,
    pub memory: *mut PJRT_Memory,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_CreateViewOfDeviceBuffer_Args"]
        [::std::mem::size_of::<PJRT_Client_CreateViewOfDeviceBuffer_Args>() - 112usize];
    ["Alignment of PJRT_Client_CreateViewOfDeviceBuffer_Args"]
        [::std::mem::align_of::<PJRT_Client_CreateViewOfDeviceBuffer_Args>() - 8usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::device_buffer_ptr"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, device_buffer_ptr) - 24usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::dims"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, dims) - 32usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::num_dims"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, num_dims) - 40usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::element_type"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, element_type) - 48usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::layout"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, layout) - 56usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::device"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, device) - 64usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::on_delete_callback"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, on_delete_callback) - 72usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::on_delete_callback_arg"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, on_delete_callback_arg) - 80usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::stream"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, stream) - 88usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, buffer) - 96usize];
    ["Offset of field: PJRT_Client_CreateViewOfDeviceBuffer_Args::memory"]
        [::std::mem::offset_of!(PJRT_Client_CreateViewOfDeviceBuffer_Args, memory) - 104usize];
};
pub const PJRT_Client_CreateViewOfDeviceBuffer_Args_STRUCT_SIZE: _bindgen_ty_54 = 112;
pub type _bindgen_ty_54 = ::std::os::raw::c_uint;
pub type PJRT_Client_CreateViewOfDeviceBuffer = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Client_CreateViewOfDeviceBuffer_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_ShapeSpec {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub dims: *const i64,
    pub num_dims: usize,
    pub element_type: PJRT_Buffer_Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_ShapeSpec"][::std::mem::size_of::<PJRT_ShapeSpec>() - 40usize];
    ["Alignment of PJRT_ShapeSpec"][::std::mem::align_of::<PJRT_ShapeSpec>() - 8usize];
    ["Offset of field: PJRT_ShapeSpec::struct_size"][::std::mem::offset_of!(PJRT_ShapeSpec, struct_size) - 0usize];
    ["Offset of field: PJRT_ShapeSpec::extension_start"]
        [::std::mem::offset_of!(PJRT_ShapeSpec, extension_start) - 8usize];
    ["Offset of field: PJRT_ShapeSpec::dims"][::std::mem::offset_of!(PJRT_ShapeSpec, dims) - 16usize];
    ["Offset of field: PJRT_ShapeSpec::num_dims"][::std::mem::offset_of!(PJRT_ShapeSpec, num_dims) - 24usize];
    ["Offset of field: PJRT_ShapeSpec::element_type"][::std::mem::offset_of!(PJRT_ShapeSpec, element_type) - 32usize];
};
pub const PJRT_ShapeSpec_STRUCT_SIZE: _bindgen_ty_55 = 36;
pub type _bindgen_ty_55 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Client_CreateBuffersForAsyncHostToDevice_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub shape_specs: *mut PJRT_ShapeSpec,
    pub num_shape_specs: usize,
    pub device_layouts: *mut *mut PJRT_Buffer_MemoryLayout,
    pub num_device_layouts: usize,
    pub memory: *mut PJRT_Memory,
    pub transfer_manager: *mut PJRT_AsyncHostToDeviceTransferManager,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Client_CreateBuffersForAsyncHostToDevice_Args"]
        [::std::mem::size_of::<PJRT_Client_CreateBuffersForAsyncHostToDevice_Args>() - 72usize];
    ["Alignment of PJRT_Client_CreateBuffersForAsyncHostToDevice_Args"]
        [::std::mem::align_of::<PJRT_Client_CreateBuffersForAsyncHostToDevice_Args>() - 8usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::client"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, client) - 16usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::shape_specs"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, shape_specs) - 24usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::num_shape_specs"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, num_shape_specs) - 32usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::device_layouts"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, device_layouts) - 40usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::num_device_layouts"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, num_device_layouts) - 48usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::memory"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, memory) - 56usize];
    ["Offset of field: PJRT_Client_CreateBuffersForAsyncHostToDevice_Args::transfer_manager"]
        [::std::mem::offset_of!(PJRT_Client_CreateBuffersForAsyncHostToDevice_Args, transfer_manager) - 64usize];
};
pub const PJRT_Client_CreateBuffersForAsyncHostToDevice_Args_STRUCT_SIZE: _bindgen_ty_56 = 72;
pub type _bindgen_ty_56 = ::std::os::raw::c_uint;
pub type PJRT_Client_CreateBuffersForAsyncHostToDevice = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Client_CreateBuffersForAsyncHostToDevice_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_DeviceDescription_Id_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device_description: *mut PJRT_DeviceDescription,
    pub id: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_DeviceDescription_Id_Args"][::std::mem::size_of::<PJRT_DeviceDescription_Id_Args>() - 32usize];
    ["Alignment of PJRT_DeviceDescription_Id_Args"][::std::mem::align_of::<PJRT_DeviceDescription_Id_Args>() - 8usize];
    ["Offset of field: PJRT_DeviceDescription_Id_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Id_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_DeviceDescription_Id_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Id_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_DeviceDescription_Id_Args::device_description"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Id_Args, device_description) - 16usize];
    ["Offset of field: PJRT_DeviceDescription_Id_Args::id"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Id_Args, id) - 24usize];
};
pub const PJRT_DeviceDescription_Id_Args_STRUCT_SIZE: _bindgen_ty_57 = 28;
pub type _bindgen_ty_57 = ::std::os::raw::c_uint;
pub type PJRT_DeviceDescription_Id =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_DeviceDescription_Id_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_DeviceDescription_ProcessIndex_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device_description: *mut PJRT_DeviceDescription,
    pub process_index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_DeviceDescription_ProcessIndex_Args"]
        [::std::mem::size_of::<PJRT_DeviceDescription_ProcessIndex_Args>() - 32usize];
    ["Alignment of PJRT_DeviceDescription_ProcessIndex_Args"]
        [::std::mem::align_of::<PJRT_DeviceDescription_ProcessIndex_Args>() - 8usize];
    ["Offset of field: PJRT_DeviceDescription_ProcessIndex_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ProcessIndex_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_DeviceDescription_ProcessIndex_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ProcessIndex_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_DeviceDescription_ProcessIndex_Args::device_description"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ProcessIndex_Args, device_description) - 16usize];
    ["Offset of field: PJRT_DeviceDescription_ProcessIndex_Args::process_index"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ProcessIndex_Args, process_index) - 24usize];
};
pub const PJRT_DeviceDescription_ProcessIndex_Args_STRUCT_SIZE: _bindgen_ty_58 = 28;
pub type _bindgen_ty_58 = ::std::os::raw::c_uint;
pub type PJRT_DeviceDescription_ProcessIndex =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_DeviceDescription_ProcessIndex_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_DeviceDescription_Attributes_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device_description: *mut PJRT_DeviceDescription,
    pub num_attributes: usize,
    pub attributes: *const PJRT_NamedValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_DeviceDescription_Attributes_Args"]
        [::std::mem::size_of::<PJRT_DeviceDescription_Attributes_Args>() - 40usize];
    ["Alignment of PJRT_DeviceDescription_Attributes_Args"]
        [::std::mem::align_of::<PJRT_DeviceDescription_Attributes_Args>() - 8usize];
    ["Offset of field: PJRT_DeviceDescription_Attributes_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Attributes_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_DeviceDescription_Attributes_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Attributes_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_DeviceDescription_Attributes_Args::device_description"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Attributes_Args, device_description) - 16usize];
    ["Offset of field: PJRT_DeviceDescription_Attributes_Args::num_attributes"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Attributes_Args, num_attributes) - 24usize];
    ["Offset of field: PJRT_DeviceDescription_Attributes_Args::attributes"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Attributes_Args, attributes) - 32usize];
};
pub const PJRT_DeviceDescription_Attributes_Args_STRUCT_SIZE: _bindgen_ty_59 = 40;
pub type _bindgen_ty_59 = ::std::os::raw::c_uint;
pub type PJRT_DeviceDescription_Attributes =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_DeviceDescription_Attributes_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_DeviceDescription_Kind_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device_description: *mut PJRT_DeviceDescription,
    pub device_kind: *const ::std::os::raw::c_char,
    pub device_kind_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_DeviceDescription_Kind_Args"][::std::mem::size_of::<PJRT_DeviceDescription_Kind_Args>() - 40usize];
    ["Alignment of PJRT_DeviceDescription_Kind_Args"]
        [::std::mem::align_of::<PJRT_DeviceDescription_Kind_Args>() - 8usize];
    ["Offset of field: PJRT_DeviceDescription_Kind_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Kind_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_DeviceDescription_Kind_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Kind_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_DeviceDescription_Kind_Args::device_description"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Kind_Args, device_description) - 16usize];
    ["Offset of field: PJRT_DeviceDescription_Kind_Args::device_kind"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Kind_Args, device_kind) - 24usize];
    ["Offset of field: PJRT_DeviceDescription_Kind_Args::device_kind_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_Kind_Args, device_kind_size) - 32usize];
};
pub const PJRT_DeviceDescription_Kind_Args_STRUCT_SIZE: _bindgen_ty_60 = 40;
pub type _bindgen_ty_60 = ::std::os::raw::c_uint;
pub type PJRT_DeviceDescription_Kind =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_DeviceDescription_Kind_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_DeviceDescription_DebugString_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device_description: *mut PJRT_DeviceDescription,
    pub debug_string: *const ::std::os::raw::c_char,
    pub debug_string_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_DeviceDescription_DebugString_Args"]
        [::std::mem::size_of::<PJRT_DeviceDescription_DebugString_Args>() - 40usize];
    ["Alignment of PJRT_DeviceDescription_DebugString_Args"]
        [::std::mem::align_of::<PJRT_DeviceDescription_DebugString_Args>() - 8usize];
    ["Offset of field: PJRT_DeviceDescription_DebugString_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_DebugString_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_DeviceDescription_DebugString_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_DebugString_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_DeviceDescription_DebugString_Args::device_description"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_DebugString_Args, device_description) - 16usize];
    ["Offset of field: PJRT_DeviceDescription_DebugString_Args::debug_string"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_DebugString_Args, debug_string) - 24usize];
    ["Offset of field: PJRT_DeviceDescription_DebugString_Args::debug_string_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_DebugString_Args, debug_string_size) - 32usize];
};
pub const PJRT_DeviceDescription_DebugString_Args_STRUCT_SIZE: _bindgen_ty_61 = 40;
pub type _bindgen_ty_61 = ::std::os::raw::c_uint;
pub type PJRT_DeviceDescription_DebugString =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_DeviceDescription_DebugString_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_DeviceDescription_ToString_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device_description: *mut PJRT_DeviceDescription,
    pub to_string: *const ::std::os::raw::c_char,
    pub to_string_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_DeviceDescription_ToString_Args"]
        [::std::mem::size_of::<PJRT_DeviceDescription_ToString_Args>() - 40usize];
    ["Alignment of PJRT_DeviceDescription_ToString_Args"]
        [::std::mem::align_of::<PJRT_DeviceDescription_ToString_Args>() - 8usize];
    ["Offset of field: PJRT_DeviceDescription_ToString_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ToString_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_DeviceDescription_ToString_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ToString_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_DeviceDescription_ToString_Args::device_description"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ToString_Args, device_description) - 16usize];
    ["Offset of field: PJRT_DeviceDescription_ToString_Args::to_string"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ToString_Args, to_string) - 24usize];
    ["Offset of field: PJRT_DeviceDescription_ToString_Args::to_string_size"]
        [::std::mem::offset_of!(PJRT_DeviceDescription_ToString_Args, to_string_size) - 32usize];
};
pub const PJRT_DeviceDescription_ToString_Args_STRUCT_SIZE: _bindgen_ty_62 = 40;
pub type _bindgen_ty_62 = ::std::os::raw::c_uint;
pub type PJRT_DeviceDescription_ToString =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_DeviceDescription_ToString_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device_GetDescription_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device: *mut PJRT_Device,
    pub device_description: *mut PJRT_DeviceDescription,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Device_GetDescription_Args"][::std::mem::size_of::<PJRT_Device_GetDescription_Args>() - 32usize];
    ["Alignment of PJRT_Device_GetDescription_Args"]
        [::std::mem::align_of::<PJRT_Device_GetDescription_Args>() - 8usize];
    ["Offset of field: PJRT_Device_GetDescription_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Device_GetDescription_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Device_GetDescription_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Device_GetDescription_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Device_GetDescription_Args::device"]
        [::std::mem::offset_of!(PJRT_Device_GetDescription_Args, device) - 16usize];
    ["Offset of field: PJRT_Device_GetDescription_Args::device_description"]
        [::std::mem::offset_of!(PJRT_Device_GetDescription_Args, device_description) - 24usize];
};
pub const PJRT_Device_GetDescription_Args_STRUCT_SIZE: _bindgen_ty_63 = 32;
pub type _bindgen_ty_63 = ::std::os::raw::c_uint;
pub type PJRT_Device_GetDescription =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Device_GetDescription_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device_IsAddressable_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device: *mut PJRT_Device,
    pub is_addressable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Device_IsAddressable_Args"][::std::mem::size_of::<PJRT_Device_IsAddressable_Args>() - 32usize];
    ["Alignment of PJRT_Device_IsAddressable_Args"][::std::mem::align_of::<PJRT_Device_IsAddressable_Args>() - 8usize];
    ["Offset of field: PJRT_Device_IsAddressable_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Device_IsAddressable_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Device_IsAddressable_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Device_IsAddressable_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Device_IsAddressable_Args::device"]
        [::std::mem::offset_of!(PJRT_Device_IsAddressable_Args, device) - 16usize];
    ["Offset of field: PJRT_Device_IsAddressable_Args::is_addressable"]
        [::std::mem::offset_of!(PJRT_Device_IsAddressable_Args, is_addressable) - 24usize];
};
pub const PJRT_Device_IsAddressable_Args_STRUCT_SIZE: _bindgen_ty_64 = 25;
pub type _bindgen_ty_64 = ::std::os::raw::c_uint;
pub type PJRT_Device_IsAddressable =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Device_IsAddressable_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device_LocalHardwareId_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device: *mut PJRT_Device,
    pub local_hardware_id: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Device_LocalHardwareId_Args"][::std::mem::size_of::<PJRT_Device_LocalHardwareId_Args>() - 32usize];
    ["Alignment of PJRT_Device_LocalHardwareId_Args"]
        [::std::mem::align_of::<PJRT_Device_LocalHardwareId_Args>() - 8usize];
    ["Offset of field: PJRT_Device_LocalHardwareId_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Device_LocalHardwareId_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Device_LocalHardwareId_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Device_LocalHardwareId_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Device_LocalHardwareId_Args::device"]
        [::std::mem::offset_of!(PJRT_Device_LocalHardwareId_Args, device) - 16usize];
    ["Offset of field: PJRT_Device_LocalHardwareId_Args::local_hardware_id"]
        [::std::mem::offset_of!(PJRT_Device_LocalHardwareId_Args, local_hardware_id) - 24usize];
};
pub const PJRT_Device_LocalHardwareId_Args_STRUCT_SIZE: _bindgen_ty_65 = 28;
pub type _bindgen_ty_65 = ::std::os::raw::c_uint;
pub type PJRT_Device_LocalHardwareId =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Device_LocalHardwareId_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device_AddressableMemories_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device: *mut PJRT_Device,
    pub memories: *const *mut PJRT_Memory,
    pub num_memories: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Device_AddressableMemories_Args"]
        [::std::mem::size_of::<PJRT_Device_AddressableMemories_Args>() - 40usize];
    ["Alignment of PJRT_Device_AddressableMemories_Args"]
        [::std::mem::align_of::<PJRT_Device_AddressableMemories_Args>() - 8usize];
    ["Offset of field: PJRT_Device_AddressableMemories_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Device_AddressableMemories_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Device_AddressableMemories_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Device_AddressableMemories_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Device_AddressableMemories_Args::device"]
        [::std::mem::offset_of!(PJRT_Device_AddressableMemories_Args, device) - 16usize];
    ["Offset of field: PJRT_Device_AddressableMemories_Args::memories"]
        [::std::mem::offset_of!(PJRT_Device_AddressableMemories_Args, memories) - 24usize];
    ["Offset of field: PJRT_Device_AddressableMemories_Args::num_memories"]
        [::std::mem::offset_of!(PJRT_Device_AddressableMemories_Args, num_memories) - 32usize];
};
pub const PJRT_Device_AddressableMemories_Args_STRUCT_SIZE: _bindgen_ty_66 = 40;
pub type _bindgen_ty_66 = ::std::os::raw::c_uint;
pub type PJRT_Device_AddressableMemories =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Device_AddressableMemories_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device_DefaultMemory_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device: *mut PJRT_Device,
    pub memory: *mut PJRT_Memory,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Device_DefaultMemory_Args"][::std::mem::size_of::<PJRT_Device_DefaultMemory_Args>() - 32usize];
    ["Alignment of PJRT_Device_DefaultMemory_Args"][::std::mem::align_of::<PJRT_Device_DefaultMemory_Args>() - 8usize];
    ["Offset of field: PJRT_Device_DefaultMemory_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Device_DefaultMemory_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Device_DefaultMemory_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Device_DefaultMemory_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Device_DefaultMemory_Args::device"]
        [::std::mem::offset_of!(PJRT_Device_DefaultMemory_Args, device) - 16usize];
    ["Offset of field: PJRT_Device_DefaultMemory_Args::memory"]
        [::std::mem::offset_of!(PJRT_Device_DefaultMemory_Args, memory) - 24usize];
};
pub const PJRT_Device_DefaultMemory_Args_STRUCT_SIZE: _bindgen_ty_67 = 32;
pub type _bindgen_ty_67 = ::std::os::raw::c_uint;
pub type PJRT_Device_DefaultMemory =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Device_DefaultMemory_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device_MemoryStats_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device: *mut PJRT_Device,
    pub bytes_in_use: i64,
    pub peak_bytes_in_use: i64,
    pub peak_bytes_in_use_is_set: bool,
    pub num_allocs: i64,
    pub num_allocs_is_set: bool,
    pub largest_alloc_size: i64,
    pub largest_alloc_size_is_set: bool,
    pub bytes_limit: i64,
    pub bytes_limit_is_set: bool,
    pub bytes_reserved: i64,
    pub bytes_reserved_is_set: bool,
    pub peak_bytes_reserved: i64,
    pub peak_bytes_reserved_is_set: bool,
    pub bytes_reservable_limit: i64,
    pub bytes_reservable_limit_is_set: bool,
    pub largest_free_block_bytes: i64,
    pub largest_free_block_bytes_is_set: bool,
    pub pool_bytes: i64,
    pub pool_bytes_is_set: bool,
    pub peak_pool_bytes: i64,
    pub peak_pool_bytes_is_set: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Device_MemoryStats_Args"][::std::mem::size_of::<PJRT_Device_MemoryStats_Args>() - 192usize];
    ["Alignment of PJRT_Device_MemoryStats_Args"][::std::mem::align_of::<PJRT_Device_MemoryStats_Args>() - 8usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::device"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, device) - 16usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::bytes_in_use"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, bytes_in_use) - 24usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::peak_bytes_in_use"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, peak_bytes_in_use) - 32usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::peak_bytes_in_use_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, peak_bytes_in_use_is_set) - 40usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::num_allocs"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, num_allocs) - 48usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::num_allocs_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, num_allocs_is_set) - 56usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::largest_alloc_size"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, largest_alloc_size) - 64usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::largest_alloc_size_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, largest_alloc_size_is_set) - 72usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::bytes_limit"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, bytes_limit) - 80usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::bytes_limit_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, bytes_limit_is_set) - 88usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::bytes_reserved"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, bytes_reserved) - 96usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::bytes_reserved_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, bytes_reserved_is_set) - 104usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::peak_bytes_reserved"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, peak_bytes_reserved) - 112usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::peak_bytes_reserved_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, peak_bytes_reserved_is_set) - 120usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::bytes_reservable_limit"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, bytes_reservable_limit) - 128usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::bytes_reservable_limit_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, bytes_reservable_limit_is_set) - 136usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::largest_free_block_bytes"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, largest_free_block_bytes) - 144usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::largest_free_block_bytes_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, largest_free_block_bytes_is_set) - 152usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::pool_bytes"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, pool_bytes) - 160usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::pool_bytes_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, pool_bytes_is_set) - 168usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::peak_pool_bytes"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, peak_pool_bytes) - 176usize];
    ["Offset of field: PJRT_Device_MemoryStats_Args::peak_pool_bytes_is_set"]
        [::std::mem::offset_of!(PJRT_Device_MemoryStats_Args, peak_pool_bytes_is_set) - 184usize];
};
pub const PJRT_Device_MemoryStats_Args_STRUCT_SIZE: _bindgen_ty_68 = 185;
pub type _bindgen_ty_68 = ::std::os::raw::c_uint;
pub type PJRT_Device_MemoryStats =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Device_MemoryStats_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device_PoisonExecution_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device: *mut PJRT_Device,
    pub launch_id: i32,
    pub error_code: PJRT_Error_Code,
    pub error_message: *const ::std::os::raw::c_char,
    pub error_message_size: usize,
    pub poisoned: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Device_PoisonExecution_Args"][::std::mem::size_of::<PJRT_Device_PoisonExecution_Args>() - 56usize];
    ["Alignment of PJRT_Device_PoisonExecution_Args"]
        [::std::mem::align_of::<PJRT_Device_PoisonExecution_Args>() - 8usize];
    ["Offset of field: PJRT_Device_PoisonExecution_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Device_PoisonExecution_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Device_PoisonExecution_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Device_PoisonExecution_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Device_PoisonExecution_Args::device"]
        [::std::mem::offset_of!(PJRT_Device_PoisonExecution_Args, device) - 16usize];
    ["Offset of field: PJRT_Device_PoisonExecution_Args::launch_id"]
        [::std::mem::offset_of!(PJRT_Device_PoisonExecution_Args, launch_id) - 24usize];
    ["Offset of field: PJRT_Device_PoisonExecution_Args::error_code"]
        [::std::mem::offset_of!(PJRT_Device_PoisonExecution_Args, error_code) - 28usize];
    ["Offset of field: PJRT_Device_PoisonExecution_Args::error_message"]
        [::std::mem::offset_of!(PJRT_Device_PoisonExecution_Args, error_message) - 32usize];
    ["Offset of field: PJRT_Device_PoisonExecution_Args::error_message_size"]
        [::std::mem::offset_of!(PJRT_Device_PoisonExecution_Args, error_message_size) - 40usize];
    ["Offset of field: PJRT_Device_PoisonExecution_Args::poisoned"]
        [::std::mem::offset_of!(PJRT_Device_PoisonExecution_Args, poisoned) - 48usize];
};
pub const PJRT_Device_PoisonExecution_Args_STRUCT_SIZE: _bindgen_ty_69 = 49;
pub type _bindgen_ty_69 = ::std::os::raw::c_uint;
pub type PJRT_Device_PoisonExecution =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Device_PoisonExecution_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncTrackingEvent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Device_CreateAsyncTrackingEvent_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub device: *mut PJRT_Device,
    pub description: *const ::std::os::raw::c_char,
    pub description_size: usize,
    pub event: *mut PJRT_AsyncTrackingEvent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Device_CreateAsyncTrackingEvent_Args"]
        [::std::mem::size_of::<PJRT_Device_CreateAsyncTrackingEvent_Args>() - 48usize];
    ["Alignment of PJRT_Device_CreateAsyncTrackingEvent_Args"]
        [::std::mem::align_of::<PJRT_Device_CreateAsyncTrackingEvent_Args>() - 8usize];
    ["Offset of field: PJRT_Device_CreateAsyncTrackingEvent_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Device_CreateAsyncTrackingEvent_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Device_CreateAsyncTrackingEvent_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Device_CreateAsyncTrackingEvent_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Device_CreateAsyncTrackingEvent_Args::device"]
        [::std::mem::offset_of!(PJRT_Device_CreateAsyncTrackingEvent_Args, device) - 16usize];
    ["Offset of field: PJRT_Device_CreateAsyncTrackingEvent_Args::description"]
        [::std::mem::offset_of!(PJRT_Device_CreateAsyncTrackingEvent_Args, description) - 24usize];
    ["Offset of field: PJRT_Device_CreateAsyncTrackingEvent_Args::description_size"]
        [::std::mem::offset_of!(PJRT_Device_CreateAsyncTrackingEvent_Args, description_size) - 32usize];
    ["Offset of field: PJRT_Device_CreateAsyncTrackingEvent_Args::event"]
        [::std::mem::offset_of!(PJRT_Device_CreateAsyncTrackingEvent_Args, event) - 40usize];
};
pub const PJRT_Device_CreateAsyncTrackingEvent_Args_STRUCT_SIZE: _bindgen_ty_70 = 48;
pub type _bindgen_ty_70 = ::std::os::raw::c_uint;
pub type PJRT_Device_CreateAsyncTrackingEvent = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Device_CreateAsyncTrackingEvent_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_AsyncTrackingEvent_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub event: *mut PJRT_AsyncTrackingEvent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_AsyncTrackingEvent_Destroy_Args"]
        [::std::mem::size_of::<PJRT_AsyncTrackingEvent_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_AsyncTrackingEvent_Destroy_Args"]
        [::std::mem::align_of::<PJRT_AsyncTrackingEvent_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_AsyncTrackingEvent_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_AsyncTrackingEvent_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_AsyncTrackingEvent_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_AsyncTrackingEvent_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_AsyncTrackingEvent_Destroy_Args::event"]
        [::std::mem::offset_of!(PJRT_AsyncTrackingEvent_Destroy_Args, event) - 16usize];
};
pub const PJRT_AsyncTrackingEvent_Destroy_Args_STRUCT_SIZE: _bindgen_ty_71 = 24;
pub type _bindgen_ty_71 = ::std::os::raw::c_uint;
pub type PJRT_AsyncTrackingEvent_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_AsyncTrackingEvent_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Memory_Id_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub memory: *mut PJRT_Memory,
    pub id: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Memory_Id_Args"][::std::mem::size_of::<PJRT_Memory_Id_Args>() - 32usize];
    ["Alignment of PJRT_Memory_Id_Args"][::std::mem::align_of::<PJRT_Memory_Id_Args>() - 8usize];
    ["Offset of field: PJRT_Memory_Id_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Memory_Id_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Memory_Id_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Memory_Id_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Memory_Id_Args::memory"][::std::mem::offset_of!(PJRT_Memory_Id_Args, memory) - 16usize];
    ["Offset of field: PJRT_Memory_Id_Args::id"][::std::mem::offset_of!(PJRT_Memory_Id_Args, id) - 24usize];
};
pub const PJRT_Memory_Id_Args_STRUCT_SIZE: _bindgen_ty_72 = 28;
pub type _bindgen_ty_72 = ::std::os::raw::c_uint;
pub type PJRT_Memory_Id =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Memory_Id_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Memory_Kind_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub memory: *mut PJRT_Memory,
    pub kind: *const ::std::os::raw::c_char,
    pub kind_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Memory_Kind_Args"][::std::mem::size_of::<PJRT_Memory_Kind_Args>() - 40usize];
    ["Alignment of PJRT_Memory_Kind_Args"][::std::mem::align_of::<PJRT_Memory_Kind_Args>() - 8usize];
    ["Offset of field: PJRT_Memory_Kind_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Memory_Kind_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Memory_Kind_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Memory_Kind_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Memory_Kind_Args::memory"][::std::mem::offset_of!(PJRT_Memory_Kind_Args, memory) - 16usize];
    ["Offset of field: PJRT_Memory_Kind_Args::kind"][::std::mem::offset_of!(PJRT_Memory_Kind_Args, kind) - 24usize];
    ["Offset of field: PJRT_Memory_Kind_Args::kind_size"]
        [::std::mem::offset_of!(PJRT_Memory_Kind_Args, kind_size) - 32usize];
};
pub const PJRT_Memory_Kind_Args_STRUCT_SIZE: _bindgen_ty_73 = 40;
pub type _bindgen_ty_73 = ::std::os::raw::c_uint;
pub type PJRT_Memory_Kind =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Memory_Kind_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Memory_Kind_Id_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub memory: *mut PJRT_Memory,
    pub kind_id: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Memory_Kind_Id_Args"][::std::mem::size_of::<PJRT_Memory_Kind_Id_Args>() - 32usize];
    ["Alignment of PJRT_Memory_Kind_Id_Args"][::std::mem::align_of::<PJRT_Memory_Kind_Id_Args>() - 8usize];
    ["Offset of field: PJRT_Memory_Kind_Id_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Memory_Kind_Id_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Memory_Kind_Id_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Memory_Kind_Id_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Memory_Kind_Id_Args::memory"]
        [::std::mem::offset_of!(PJRT_Memory_Kind_Id_Args, memory) - 16usize];
    ["Offset of field: PJRT_Memory_Kind_Id_Args::kind_id"]
        [::std::mem::offset_of!(PJRT_Memory_Kind_Id_Args, kind_id) - 24usize];
};
pub const PJRT_Memory_Kind_Id_Args_STRUCT_SIZE: _bindgen_ty_74 = 28;
pub type _bindgen_ty_74 = ::std::os::raw::c_uint;
pub type PJRT_Memory_Kind_Id =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Memory_Kind_Id_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Memory_DebugString_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub memory: *mut PJRT_Memory,
    pub debug_string: *const ::std::os::raw::c_char,
    pub debug_string_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Memory_DebugString_Args"][::std::mem::size_of::<PJRT_Memory_DebugString_Args>() - 40usize];
    ["Alignment of PJRT_Memory_DebugString_Args"][::std::mem::align_of::<PJRT_Memory_DebugString_Args>() - 8usize];
    ["Offset of field: PJRT_Memory_DebugString_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Memory_DebugString_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Memory_DebugString_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Memory_DebugString_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Memory_DebugString_Args::memory"]
        [::std::mem::offset_of!(PJRT_Memory_DebugString_Args, memory) - 16usize];
    ["Offset of field: PJRT_Memory_DebugString_Args::debug_string"]
        [::std::mem::offset_of!(PJRT_Memory_DebugString_Args, debug_string) - 24usize];
    ["Offset of field: PJRT_Memory_DebugString_Args::debug_string_size"]
        [::std::mem::offset_of!(PJRT_Memory_DebugString_Args, debug_string_size) - 32usize];
};
pub const PJRT_Memory_DebugString_Args_STRUCT_SIZE: _bindgen_ty_75 = 40;
pub type _bindgen_ty_75 = ::std::os::raw::c_uint;
pub type PJRT_Memory_DebugString =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Memory_DebugString_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Memory_ToString_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub memory: *mut PJRT_Memory,
    pub to_string: *const ::std::os::raw::c_char,
    pub to_string_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Memory_ToString_Args"][::std::mem::size_of::<PJRT_Memory_ToString_Args>() - 40usize];
    ["Alignment of PJRT_Memory_ToString_Args"][::std::mem::align_of::<PJRT_Memory_ToString_Args>() - 8usize];
    ["Offset of field: PJRT_Memory_ToString_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Memory_ToString_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Memory_ToString_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Memory_ToString_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Memory_ToString_Args::memory"]
        [::std::mem::offset_of!(PJRT_Memory_ToString_Args, memory) - 16usize];
    ["Offset of field: PJRT_Memory_ToString_Args::to_string"]
        [::std::mem::offset_of!(PJRT_Memory_ToString_Args, to_string) - 24usize];
    ["Offset of field: PJRT_Memory_ToString_Args::to_string_size"]
        [::std::mem::offset_of!(PJRT_Memory_ToString_Args, to_string_size) - 32usize];
};
pub const PJRT_Memory_ToString_Args_STRUCT_SIZE: _bindgen_ty_76 = 40;
pub type _bindgen_ty_76 = ::std::os::raw::c_uint;
pub type PJRT_Memory_ToString =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Memory_ToString_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Memory_AddressableByDevices_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub memory: *mut PJRT_Memory,
    pub devices: *const *mut PJRT_Device,
    pub num_devices: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Memory_AddressableByDevices_Args"]
        [::std::mem::size_of::<PJRT_Memory_AddressableByDevices_Args>() - 40usize];
    ["Alignment of PJRT_Memory_AddressableByDevices_Args"]
        [::std::mem::align_of::<PJRT_Memory_AddressableByDevices_Args>() - 8usize];
    ["Offset of field: PJRT_Memory_AddressableByDevices_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Memory_AddressableByDevices_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Memory_AddressableByDevices_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Memory_AddressableByDevices_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Memory_AddressableByDevices_Args::memory"]
        [::std::mem::offset_of!(PJRT_Memory_AddressableByDevices_Args, memory) - 16usize];
    ["Offset of field: PJRT_Memory_AddressableByDevices_Args::devices"]
        [::std::mem::offset_of!(PJRT_Memory_AddressableByDevices_Args, devices) - 24usize];
    ["Offset of field: PJRT_Memory_AddressableByDevices_Args::num_devices"]
        [::std::mem::offset_of!(PJRT_Memory_AddressableByDevices_Args, num_devices) - 32usize];
};
pub const PJRT_Memory_AddressableByDevices_Args_STRUCT_SIZE: _bindgen_ty_77 = 40;
pub type _bindgen_ty_77 = ::std::os::raw::c_uint;
pub type PJRT_Memory_AddressableByDevices =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Memory_AddressableByDevices_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_ExecuteContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_ExecuteContext_Create_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub context: *mut PJRT_ExecuteContext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_ExecuteContext_Create_Args"][::std::mem::size_of::<PJRT_ExecuteContext_Create_Args>() - 24usize];
    ["Alignment of PJRT_ExecuteContext_Create_Args"]
        [::std::mem::align_of::<PJRT_ExecuteContext_Create_Args>() - 8usize];
    ["Offset of field: PJRT_ExecuteContext_Create_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_ExecuteContext_Create_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_ExecuteContext_Create_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_ExecuteContext_Create_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_ExecuteContext_Create_Args::context"]
        [::std::mem::offset_of!(PJRT_ExecuteContext_Create_Args, context) - 16usize];
};
pub const PJRT_ExecuteContext_Create_Args_STRUCT_SIZE: _bindgen_ty_78 = 24;
pub type _bindgen_ty_78 = ::std::os::raw::c_uint;
pub type PJRT_ExecuteContext_Create =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_ExecuteContext_Create_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_ExecuteContext_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub context: *mut PJRT_ExecuteContext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_ExecuteContext_Destroy_Args"][::std::mem::size_of::<PJRT_ExecuteContext_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_ExecuteContext_Destroy_Args"]
        [::std::mem::align_of::<PJRT_ExecuteContext_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_ExecuteContext_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_ExecuteContext_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_ExecuteContext_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_ExecuteContext_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_ExecuteContext_Destroy_Args::context"]
        [::std::mem::offset_of!(PJRT_ExecuteContext_Destroy_Args, context) - 16usize];
};
pub const PJRT_ExecuteContext_Destroy_Args_STRUCT_SIZE: _bindgen_ty_79 = 24;
pub type _bindgen_ty_79 = ::std::os::raw::c_uint;
pub type PJRT_ExecuteContext_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_ExecuteContext_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_Destroy_Args"][::std::mem::size_of::<PJRT_Executable_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_Executable_Destroy_Args"][::std::mem::align_of::<PJRT_Executable_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_Destroy_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_Destroy_Args, executable) - 16usize];
};
pub const PJRT_Executable_Destroy_Args_STRUCT_SIZE: _bindgen_ty_80 = 24;
pub type _bindgen_ty_80 = ::std::os::raw::c_uint;
pub type PJRT_Executable_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_LoadedExecutable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_LoadedExecutable_Destroy_Args"]
        [::std::mem::size_of::<PJRT_LoadedExecutable_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_LoadedExecutable_Destroy_Args"]
        [::std::mem::align_of::<PJRT_LoadedExecutable_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_LoadedExecutable_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_Destroy_Args::executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Destroy_Args, executable) - 16usize];
};
pub const PJRT_LoadedExecutable_Destroy_Args_STRUCT_SIZE: _bindgen_ty_81 = 24;
pub type _bindgen_ty_81 = ::std::os::raw::c_uint;
pub type PJRT_LoadedExecutable_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_LoadedExecutable_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable_GetExecutable_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub loaded_executable: *mut PJRT_LoadedExecutable,
    pub executable: *mut PJRT_Executable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_LoadedExecutable_GetExecutable_Args"]
        [::std::mem::size_of::<PJRT_LoadedExecutable_GetExecutable_Args>() - 32usize];
    ["Alignment of PJRT_LoadedExecutable_GetExecutable_Args"]
        [::std::mem::align_of::<PJRT_LoadedExecutable_GetExecutable_Args>() - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_GetExecutable_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetExecutable_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_LoadedExecutable_GetExecutable_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetExecutable_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_GetExecutable_Args::loaded_executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetExecutable_Args, loaded_executable) - 16usize];
    ["Offset of field: PJRT_LoadedExecutable_GetExecutable_Args::executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetExecutable_Args, executable) - 24usize];
};
pub const PJRT_LoadedExecutable_GetExecutable_Args_STRUCT_SIZE: _bindgen_ty_82 = 32;
pub type _bindgen_ty_82 = ::std::os::raw::c_uint;
pub type PJRT_LoadedExecutable_GetExecutable =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_LoadedExecutable_GetExecutable_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_DeviceAssignmentSerialized {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable_GetDeviceAssignment_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_LoadedExecutable,
    pub serialized_bytes: *const ::std::os::raw::c_char,
    pub serialized_bytes_size: usize,
    pub serialized_device_assignment: *mut PJRT_DeviceAssignmentSerialized,
    pub serialized_device_assignment_deleter:
        ::std::option::Option<unsafe extern "C" fn(da: *mut PJRT_DeviceAssignmentSerialized)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_LoadedExecutable_GetDeviceAssignment_Args"]
        [::std::mem::size_of::<PJRT_LoadedExecutable_GetDeviceAssignment_Args>() - 56usize];
    ["Alignment of PJRT_LoadedExecutable_GetDeviceAssignment_Args"]
        [::std::mem::align_of::<PJRT_LoadedExecutable_GetDeviceAssignment_Args>() - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_GetDeviceAssignment_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetDeviceAssignment_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_LoadedExecutable_GetDeviceAssignment_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetDeviceAssignment_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_GetDeviceAssignment_Args::executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetDeviceAssignment_Args, executable) - 16usize];
    ["Offset of field: PJRT_LoadedExecutable_GetDeviceAssignment_Args::serialized_bytes"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetDeviceAssignment_Args, serialized_bytes) - 24usize];
    ["Offset of field: PJRT_LoadedExecutable_GetDeviceAssignment_Args::serialized_bytes_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_GetDeviceAssignment_Args, serialized_bytes_size) - 32usize];
    ["Offset of field: PJRT_LoadedExecutable_GetDeviceAssignment_Args::serialized_device_assignment"][::std::mem::offset_of!(
        PJRT_LoadedExecutable_GetDeviceAssignment_Args,
        serialized_device_assignment
    ) - 40usize];
    ["Offset of field: PJRT_LoadedExecutable_GetDeviceAssignment_Args::serialized_device_assignment_deleter"][::std::mem::offset_of!(
        PJRT_LoadedExecutable_GetDeviceAssignment_Args,
        serialized_device_assignment_deleter
    )
        - 48usize];
};
pub const PJRT_LoadedExecutable_GetDeviceAssignment_Args_STRUCT_SIZE: _bindgen_ty_83 = 56;
pub type _bindgen_ty_83 = ::std::os::raw::c_uint;
pub type PJRT_LoadedExecutable_GetDeviceAssignment = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_LoadedExecutable_GetDeviceAssignment_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_Name_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub executable_name: *const ::std::os::raw::c_char,
    pub executable_name_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_Name_Args"][::std::mem::size_of::<PJRT_Executable_Name_Args>() - 40usize];
    ["Alignment of PJRT_Executable_Name_Args"][::std::mem::align_of::<PJRT_Executable_Name_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_Name_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_Name_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_Name_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_Name_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_Name_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_Name_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_Name_Args::executable_name"]
        [::std::mem::offset_of!(PJRT_Executable_Name_Args, executable_name) - 24usize];
    ["Offset of field: PJRT_Executable_Name_Args::executable_name_size"]
        [::std::mem::offset_of!(PJRT_Executable_Name_Args, executable_name_size) - 32usize];
};
pub const PJRT_Executable_Name_Args_STRUCT_SIZE: _bindgen_ty_84 = 40;
pub type _bindgen_ty_84 = ::std::os::raw::c_uint;
pub type PJRT_Executable_Name =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_Name_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_NumReplicas_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub num_replicas: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_NumReplicas_Args"][::std::mem::size_of::<PJRT_Executable_NumReplicas_Args>() - 32usize];
    ["Alignment of PJRT_Executable_NumReplicas_Args"]
        [::std::mem::align_of::<PJRT_Executable_NumReplicas_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_NumReplicas_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_NumReplicas_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_NumReplicas_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_NumReplicas_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_NumReplicas_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_NumReplicas_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_NumReplicas_Args::num_replicas"]
        [::std::mem::offset_of!(PJRT_Executable_NumReplicas_Args, num_replicas) - 24usize];
};
pub const PJRT_Executable_NumReplicas_Args_STRUCT_SIZE: _bindgen_ty_85 = 32;
pub type _bindgen_ty_85 = ::std::os::raw::c_uint;
pub type PJRT_Executable_NumReplicas =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_NumReplicas_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_NumPartitions_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub num_partitions: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_NumPartitions_Args"]
        [::std::mem::size_of::<PJRT_Executable_NumPartitions_Args>() - 32usize];
    ["Alignment of PJRT_Executable_NumPartitions_Args"]
        [::std::mem::align_of::<PJRT_Executable_NumPartitions_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_NumPartitions_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_NumPartitions_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_NumPartitions_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_NumPartitions_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_NumPartitions_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_NumPartitions_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_NumPartitions_Args::num_partitions"]
        [::std::mem::offset_of!(PJRT_Executable_NumPartitions_Args, num_partitions) - 24usize];
};
pub const PJRT_Executable_NumPartitions_Args_STRUCT_SIZE: _bindgen_ty_86 = 32;
pub type _bindgen_ty_86 = ::std::os::raw::c_uint;
pub type PJRT_Executable_NumPartitions =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_NumPartitions_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable_AddressableDevices_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_LoadedExecutable,
    pub addressable_devices: *const *mut PJRT_Device,
    pub num_addressable_devices: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_LoadedExecutable_AddressableDevices_Args"]
        [::std::mem::size_of::<PJRT_LoadedExecutable_AddressableDevices_Args>() - 40usize];
    ["Alignment of PJRT_LoadedExecutable_AddressableDevices_Args"]
        [::std::mem::align_of::<PJRT_LoadedExecutable_AddressableDevices_Args>() - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_AddressableDevices_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_AddressableDevices_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_LoadedExecutable_AddressableDevices_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_AddressableDevices_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_AddressableDevices_Args::executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_AddressableDevices_Args, executable) - 16usize];
    ["Offset of field: PJRT_LoadedExecutable_AddressableDevices_Args::addressable_devices"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_AddressableDevices_Args, addressable_devices) - 24usize];
    ["Offset of field: PJRT_LoadedExecutable_AddressableDevices_Args::num_addressable_devices"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_AddressableDevices_Args, num_addressable_devices) - 32usize];
};
pub const PJRT_LoadedExecutable_AddressableDevices_Args_STRUCT_SIZE: _bindgen_ty_87 = 40;
pub type _bindgen_ty_87 = ::std::os::raw::c_uint;
pub type PJRT_LoadedExecutable_AddressableDevices = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_LoadedExecutable_AddressableDevices_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_OptimizedProgram_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub program: *mut PJRT_Program,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_OptimizedProgram_Args"]
        [::std::mem::size_of::<PJRT_Executable_OptimizedProgram_Args>() - 32usize];
    ["Alignment of PJRT_Executable_OptimizedProgram_Args"]
        [::std::mem::align_of::<PJRT_Executable_OptimizedProgram_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_OptimizedProgram_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_OptimizedProgram_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_OptimizedProgram_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_OptimizedProgram_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_OptimizedProgram_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_OptimizedProgram_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_OptimizedProgram_Args::program"]
        [::std::mem::offset_of!(PJRT_Executable_OptimizedProgram_Args, program) - 24usize];
};
pub const PJRT_Executable_OptimizedProgram_Args_STRUCT_SIZE: _bindgen_ty_88 = 32;
pub type _bindgen_ty_88 = ::std::os::raw::c_uint;
pub type PJRT_Executable_OptimizedProgram =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_OptimizedProgram_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable_Delete_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_LoadedExecutable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_LoadedExecutable_Delete_Args"][::std::mem::size_of::<PJRT_LoadedExecutable_Delete_Args>() - 24usize];
    ["Alignment of PJRT_LoadedExecutable_Delete_Args"]
        [::std::mem::align_of::<PJRT_LoadedExecutable_Delete_Args>() - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_Delete_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Delete_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_LoadedExecutable_Delete_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Delete_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_Delete_Args::executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Delete_Args, executable) - 16usize];
};
pub const PJRT_LoadedExecutable_Delete_Args_STRUCT_SIZE: _bindgen_ty_89 = 24;
pub type _bindgen_ty_89 = ::std::os::raw::c_uint;
pub type PJRT_LoadedExecutable_Delete =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_LoadedExecutable_Delete_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable_IsDeleted_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_LoadedExecutable,
    pub is_deleted: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_LoadedExecutable_IsDeleted_Args"]
        [::std::mem::size_of::<PJRT_LoadedExecutable_IsDeleted_Args>() - 32usize];
    ["Alignment of PJRT_LoadedExecutable_IsDeleted_Args"]
        [::std::mem::align_of::<PJRT_LoadedExecutable_IsDeleted_Args>() - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_IsDeleted_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_IsDeleted_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_LoadedExecutable_IsDeleted_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_IsDeleted_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_IsDeleted_Args::executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_IsDeleted_Args, executable) - 16usize];
    ["Offset of field: PJRT_LoadedExecutable_IsDeleted_Args::is_deleted"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_IsDeleted_Args, is_deleted) - 24usize];
};
pub const PJRT_LoadedExecutable_IsDeleted_Args_STRUCT_SIZE: _bindgen_ty_90 = 25;
pub type _bindgen_ty_90 = ::std::os::raw::c_uint;
pub type PJRT_LoadedExecutable_IsDeleted =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_LoadedExecutable_IsDeleted_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Chunk {
    pub data: *mut ::std::os::raw::c_void,
    pub size: usize,
    pub deleter: ::std::option::Option<
        unsafe extern "C" fn(data: *mut ::std::os::raw::c_void, deleter_arg: *mut ::std::os::raw::c_void),
    >,
    pub deleter_arg: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Chunk"][::std::mem::size_of::<PJRT_Chunk>() - 32usize];
    ["Alignment of PJRT_Chunk"][::std::mem::align_of::<PJRT_Chunk>() - 8usize];
    ["Offset of field: PJRT_Chunk::data"][::std::mem::offset_of!(PJRT_Chunk, data) - 0usize];
    ["Offset of field: PJRT_Chunk::size"][::std::mem::offset_of!(PJRT_Chunk, size) - 8usize];
    ["Offset of field: PJRT_Chunk::deleter"][::std::mem::offset_of!(PJRT_Chunk, deleter) - 16usize];
    ["Offset of field: PJRT_Chunk::deleter_arg"][::std::mem::offset_of!(PJRT_Chunk, deleter_arg) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_CopyToDeviceStream {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TransferMetadata {
    _unused: [u8; 0],
}
pub type PJRT_SendCallback = ::std::option::Option<
    unsafe extern "C" fn(
        chunk: *mut PJRT_Chunk,
        callback_error: *mut PJRT_CallbackError,
        total_size_in_bytes: usize,
        done: bool,
        user_arg: *mut ::std::os::raw::c_void,
    ) -> *mut PJRT_Error,
>;
pub type PJRT_RecvCallback = ::std::option::Option<
    unsafe extern "C" fn(stream: *mut PJRT_CopyToDeviceStream, user_arg: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_SendCallbackInfo {
    pub channel_id: i64,
    pub user_arg: *mut ::std::os::raw::c_void,
    pub send_callback: PJRT_SendCallback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_SendCallbackInfo"][::std::mem::size_of::<PJRT_SendCallbackInfo>() - 24usize];
    ["Alignment of PJRT_SendCallbackInfo"][::std::mem::align_of::<PJRT_SendCallbackInfo>() - 8usize];
    ["Offset of field: PJRT_SendCallbackInfo::channel_id"]
        [::std::mem::offset_of!(PJRT_SendCallbackInfo, channel_id) - 0usize];
    ["Offset of field: PJRT_SendCallbackInfo::user_arg"]
        [::std::mem::offset_of!(PJRT_SendCallbackInfo, user_arg) - 8usize];
    ["Offset of field: PJRT_SendCallbackInfo::send_callback"]
        [::std::mem::offset_of!(PJRT_SendCallbackInfo, send_callback) - 16usize];
};
pub const PJRT_SendCallbackInfo_STRUCT_SIZE: _bindgen_ty_91 = 24;
pub type _bindgen_ty_91 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_RecvCallbackInfo {
    pub channel_id: i64,
    pub user_arg: *mut ::std::os::raw::c_void,
    pub recv_callback: PJRT_RecvCallback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_RecvCallbackInfo"][::std::mem::size_of::<PJRT_RecvCallbackInfo>() - 24usize];
    ["Alignment of PJRT_RecvCallbackInfo"][::std::mem::align_of::<PJRT_RecvCallbackInfo>() - 8usize];
    ["Offset of field: PJRT_RecvCallbackInfo::channel_id"]
        [::std::mem::offset_of!(PJRT_RecvCallbackInfo, channel_id) - 0usize];
    ["Offset of field: PJRT_RecvCallbackInfo::user_arg"]
        [::std::mem::offset_of!(PJRT_RecvCallbackInfo, user_arg) - 8usize];
    ["Offset of field: PJRT_RecvCallbackInfo::recv_callback"]
        [::std::mem::offset_of!(PJRT_RecvCallbackInfo, recv_callback) - 16usize];
};
pub const PJRT_RecvCallbackInfo_STRUCT_SIZE: _bindgen_ty_92 = 24;
pub type _bindgen_ty_92 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_ExecuteOptions {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub send_callbacks: *mut *mut PJRT_SendCallbackInfo,
    pub recv_callbacks: *mut *mut PJRT_RecvCallbackInfo,
    pub num_send_ops: usize,
    pub num_recv_ops: usize,
    pub launch_id: ::std::os::raw::c_int,
    pub non_donatable_input_indices: *const i64,
    pub num_non_donatable_input_indices: usize,
    pub context: *mut PJRT_ExecuteContext,
    pub call_location: *const ::std::os::raw::c_char,
    pub num_tasks: usize,
    pub task_ids: *mut ::std::os::raw::c_int,
    pub incarnation_ids: *mut i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_ExecuteOptions"][::std::mem::size_of::<PJRT_ExecuteOptions>() - 112usize];
    ["Alignment of PJRT_ExecuteOptions"][::std::mem::align_of::<PJRT_ExecuteOptions>() - 8usize];
    ["Offset of field: PJRT_ExecuteOptions::struct_size"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, struct_size) - 0usize];
    ["Offset of field: PJRT_ExecuteOptions::extension_start"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, extension_start) - 8usize];
    ["Offset of field: PJRT_ExecuteOptions::send_callbacks"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, send_callbacks) - 16usize];
    ["Offset of field: PJRT_ExecuteOptions::recv_callbacks"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, recv_callbacks) - 24usize];
    ["Offset of field: PJRT_ExecuteOptions::num_send_ops"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, num_send_ops) - 32usize];
    ["Offset of field: PJRT_ExecuteOptions::num_recv_ops"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, num_recv_ops) - 40usize];
    ["Offset of field: PJRT_ExecuteOptions::launch_id"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, launch_id) - 48usize];
    ["Offset of field: PJRT_ExecuteOptions::non_donatable_input_indices"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, non_donatable_input_indices) - 56usize];
    ["Offset of field: PJRT_ExecuteOptions::num_non_donatable_input_indices"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, num_non_donatable_input_indices) - 64usize];
    ["Offset of field: PJRT_ExecuteOptions::context"][::std::mem::offset_of!(PJRT_ExecuteOptions, context) - 72usize];
    ["Offset of field: PJRT_ExecuteOptions::call_location"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, call_location) - 80usize];
    ["Offset of field: PJRT_ExecuteOptions::num_tasks"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, num_tasks) - 88usize];
    ["Offset of field: PJRT_ExecuteOptions::task_ids"][::std::mem::offset_of!(PJRT_ExecuteOptions, task_ids) - 96usize];
    ["Offset of field: PJRT_ExecuteOptions::incarnation_ids"]
        [::std::mem::offset_of!(PJRT_ExecuteOptions, incarnation_ids) - 104usize];
};
pub const PJRT_ExecuteOptions_STRUCT_SIZE: _bindgen_ty_93 = 112;
pub type _bindgen_ty_93 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable_Execute_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_LoadedExecutable,
    pub options: *mut PJRT_ExecuteOptions,
    pub argument_lists: *const *const *mut PJRT_Buffer,
    pub num_devices: usize,
    pub num_args: usize,
    pub output_lists: *const *mut *mut PJRT_Buffer,
    pub device_complete_events: *mut *mut PJRT_Event,
    pub execute_device: *mut PJRT_Device,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_LoadedExecutable_Execute_Args"]
        [::std::mem::size_of::<PJRT_LoadedExecutable_Execute_Args>() - 80usize];
    ["Alignment of PJRT_LoadedExecutable_Execute_Args"]
        [::std::mem::align_of::<PJRT_LoadedExecutable_Execute_Args>() - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, executable) - 16usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::options"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, options) - 24usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::argument_lists"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, argument_lists) - 32usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::num_devices"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, num_devices) - 40usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::num_args"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, num_args) - 48usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::output_lists"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, output_lists) - 56usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::device_complete_events"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, device_complete_events) - 64usize];
    ["Offset of field: PJRT_LoadedExecutable_Execute_Args::execute_device"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Execute_Args, execute_device) - 72usize];
};
pub const PJRT_LoadedExecutable_Execute_Args_STRUCT_SIZE: _bindgen_ty_94 = 80;
pub type _bindgen_ty_94 = ::std::os::raw::c_uint;
pub type PJRT_LoadedExecutable_Execute =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_LoadedExecutable_Execute_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_NumOutputs_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub num_outputs: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_NumOutputs_Args"][::std::mem::size_of::<PJRT_Executable_NumOutputs_Args>() - 32usize];
    ["Alignment of PJRT_Executable_NumOutputs_Args"]
        [::std::mem::align_of::<PJRT_Executable_NumOutputs_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_NumOutputs_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_NumOutputs_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_NumOutputs_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_NumOutputs_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_NumOutputs_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_NumOutputs_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_NumOutputs_Args::num_outputs"]
        [::std::mem::offset_of!(PJRT_Executable_NumOutputs_Args, num_outputs) - 24usize];
};
pub const PJRT_Executable_NumOutputs_Args_STRUCT_SIZE: _bindgen_ty_95 = 32;
pub type _bindgen_ty_95 = ::std::os::raw::c_uint;
pub type PJRT_Executable_NumOutputs =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_NumOutputs_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_SizeOfGeneratedCodeInBytes_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub size_in_bytes: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_SizeOfGeneratedCodeInBytes_Args"]
        [::std::mem::size_of::<PJRT_Executable_SizeOfGeneratedCodeInBytes_Args>() - 32usize];
    ["Alignment of PJRT_Executable_SizeOfGeneratedCodeInBytes_Args"]
        [::std::mem::align_of::<PJRT_Executable_SizeOfGeneratedCodeInBytes_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_SizeOfGeneratedCodeInBytes_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_SizeOfGeneratedCodeInBytes_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_SizeOfGeneratedCodeInBytes_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_SizeOfGeneratedCodeInBytes_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_SizeOfGeneratedCodeInBytes_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_SizeOfGeneratedCodeInBytes_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_SizeOfGeneratedCodeInBytes_Args::size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_SizeOfGeneratedCodeInBytes_Args, size_in_bytes) - 24usize];
};
pub const PJRT_Executable_SizeOfGeneratedCodeInBytes_Args_STRUCT_SIZE: _bindgen_ty_96 = 32;
pub type _bindgen_ty_96 = ::std::os::raw::c_uint;
pub type PJRT_Executable_SizeOfGeneratedCodeInBytes = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Executable_SizeOfGeneratedCodeInBytes_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_Fingerprint_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub executable_fingerprint: *const ::std::os::raw::c_char,
    pub executable_fingerprint_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_Fingerprint_Args"][::std::mem::size_of::<PJRT_Executable_Fingerprint_Args>() - 40usize];
    ["Alignment of PJRT_Executable_Fingerprint_Args"]
        [::std::mem::align_of::<PJRT_Executable_Fingerprint_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_Fingerprint_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_Fingerprint_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_Fingerprint_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_Fingerprint_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_Fingerprint_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_Fingerprint_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_Fingerprint_Args::executable_fingerprint"]
        [::std::mem::offset_of!(PJRT_Executable_Fingerprint_Args, executable_fingerprint) - 24usize];
    ["Offset of field: PJRT_Executable_Fingerprint_Args::executable_fingerprint_size"]
        [::std::mem::offset_of!(PJRT_Executable_Fingerprint_Args, executable_fingerprint_size) - 32usize];
};
pub const PJRT_Executable_Fingerprint_Args_STRUCT_SIZE: _bindgen_ty_97 = 40;
pub type _bindgen_ty_97 = ::std::os::raw::c_uint;
pub type PJRT_Executable_Fingerprint =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_Fingerprint_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_GetCostAnalysis_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub num_properties: usize,
    pub properties: *const PJRT_NamedValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_GetCostAnalysis_Args"]
        [::std::mem::size_of::<PJRT_Executable_GetCostAnalysis_Args>() - 40usize];
    ["Alignment of PJRT_Executable_GetCostAnalysis_Args"]
        [::std::mem::align_of::<PJRT_Executable_GetCostAnalysis_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_GetCostAnalysis_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_GetCostAnalysis_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_GetCostAnalysis_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_GetCostAnalysis_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_GetCostAnalysis_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_GetCostAnalysis_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_GetCostAnalysis_Args::num_properties"]
        [::std::mem::offset_of!(PJRT_Executable_GetCostAnalysis_Args, num_properties) - 24usize];
    ["Offset of field: PJRT_Executable_GetCostAnalysis_Args::properties"]
        [::std::mem::offset_of!(PJRT_Executable_GetCostAnalysis_Args, properties) - 32usize];
};
pub const PJRT_Executable_GetCostAnalysis_Args_STRUCT_SIZE: _bindgen_ty_98 = 40;
pub type _bindgen_ty_98 = ::std::os::raw::c_uint;
pub type PJRT_Executable_GetCostAnalysis =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_GetCostAnalysis_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_GetCompiledMemoryStats_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub generated_code_size_in_bytes: i64,
    pub argument_size_in_bytes: i64,
    pub output_size_in_bytes: i64,
    pub alias_size_in_bytes: i64,
    pub temp_size_in_bytes: i64,
    pub host_generated_code_size_in_bytes: i64,
    pub host_argument_size_in_bytes: i64,
    pub host_output_size_in_bytes: i64,
    pub host_alias_size_in_bytes: i64,
    pub host_temp_size_in_bytes: i64,
    pub peak_memory_in_bytes: i64,
    pub total_size_in_bytes: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_GetCompiledMemoryStats_Args"]
        [::std::mem::size_of::<PJRT_Executable_GetCompiledMemoryStats_Args>() - 120usize];
    ["Alignment of PJRT_Executable_GetCompiledMemoryStats_Args"]
        [::std::mem::align_of::<PJRT_Executable_GetCompiledMemoryStats_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::generated_code_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, generated_code_size_in_bytes) - 24usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::argument_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, argument_size_in_bytes) - 32usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::output_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, output_size_in_bytes) - 40usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::alias_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, alias_size_in_bytes) - 48usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::temp_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, temp_size_in_bytes) - 56usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::host_generated_code_size_in_bytes"][::std::mem::offset_of!(
        PJRT_Executable_GetCompiledMemoryStats_Args,
        host_generated_code_size_in_bytes
    ) - 64usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::host_argument_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, host_argument_size_in_bytes) - 72usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::host_output_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, host_output_size_in_bytes) - 80usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::host_alias_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, host_alias_size_in_bytes) - 88usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::host_temp_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, host_temp_size_in_bytes) - 96usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::peak_memory_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, peak_memory_in_bytes) - 104usize];
    ["Offset of field: PJRT_Executable_GetCompiledMemoryStats_Args::total_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompiledMemoryStats_Args, total_size_in_bytes) - 112usize];
};
pub const PJRT_Executable_GetCompiledMemoryStats_Args_STRUCT_SIZE: _bindgen_ty_99 = 120;
pub type _bindgen_ty_99 = ::std::os::raw::c_uint;
pub type PJRT_Executable_GetCompiledMemoryStats = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Executable_GetCompiledMemoryStats_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_OutputElementTypes_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub output_types: *mut PJRT_Buffer_Type,
    pub num_output_types: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_OutputElementTypes_Args"]
        [::std::mem::size_of::<PJRT_Executable_OutputElementTypes_Args>() - 40usize];
    ["Alignment of PJRT_Executable_OutputElementTypes_Args"]
        [::std::mem::align_of::<PJRT_Executable_OutputElementTypes_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_OutputElementTypes_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_OutputElementTypes_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_OutputElementTypes_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_OutputElementTypes_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_OutputElementTypes_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_OutputElementTypes_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_OutputElementTypes_Args::output_types"]
        [::std::mem::offset_of!(PJRT_Executable_OutputElementTypes_Args, output_types) - 24usize];
    ["Offset of field: PJRT_Executable_OutputElementTypes_Args::num_output_types"]
        [::std::mem::offset_of!(PJRT_Executable_OutputElementTypes_Args, num_output_types) - 32usize];
};
pub const PJRT_Executable_OutputElementTypes_Args_STRUCT_SIZE: _bindgen_ty_100 = 40;
pub type _bindgen_ty_100 = ::std::os::raw::c_uint;
pub type PJRT_Executable_OutputElementTypes =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_OutputElementTypes_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_OutputDimensions_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub num_outputs: usize,
    pub dims: *const i64,
    pub dim_sizes: *const usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_OutputDimensions_Args"]
        [::std::mem::size_of::<PJRT_Executable_OutputDimensions_Args>() - 48usize];
    ["Alignment of PJRT_Executable_OutputDimensions_Args"]
        [::std::mem::align_of::<PJRT_Executable_OutputDimensions_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_OutputDimensions_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_OutputDimensions_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_OutputDimensions_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_OutputDimensions_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_OutputDimensions_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_OutputDimensions_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_OutputDimensions_Args::num_outputs"]
        [::std::mem::offset_of!(PJRT_Executable_OutputDimensions_Args, num_outputs) - 24usize];
    ["Offset of field: PJRT_Executable_OutputDimensions_Args::dims"]
        [::std::mem::offset_of!(PJRT_Executable_OutputDimensions_Args, dims) - 32usize];
    ["Offset of field: PJRT_Executable_OutputDimensions_Args::dim_sizes"]
        [::std::mem::offset_of!(PJRT_Executable_OutputDimensions_Args, dim_sizes) - 40usize];
};
pub const PJRT_Executable_OutputDimensions_Args_STRUCT_SIZE: _bindgen_ty_101 = 48;
pub type _bindgen_ty_101 = ::std::os::raw::c_uint;
pub type PJRT_Executable_OutputDimensions =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_OutputDimensions_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_OutputMemoryKinds_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub num_outputs: usize,
    pub memory_kinds: *const *const ::std::os::raw::c_char,
    pub memory_kind_sizes: *const usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_OutputMemoryKinds_Args"]
        [::std::mem::size_of::<PJRT_Executable_OutputMemoryKinds_Args>() - 48usize];
    ["Alignment of PJRT_Executable_OutputMemoryKinds_Args"]
        [::std::mem::align_of::<PJRT_Executable_OutputMemoryKinds_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_OutputMemoryKinds_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_OutputMemoryKinds_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_OutputMemoryKinds_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_OutputMemoryKinds_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_OutputMemoryKinds_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_OutputMemoryKinds_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_OutputMemoryKinds_Args::num_outputs"]
        [::std::mem::offset_of!(PJRT_Executable_OutputMemoryKinds_Args, num_outputs) - 24usize];
    ["Offset of field: PJRT_Executable_OutputMemoryKinds_Args::memory_kinds"]
        [::std::mem::offset_of!(PJRT_Executable_OutputMemoryKinds_Args, memory_kinds) - 32usize];
    ["Offset of field: PJRT_Executable_OutputMemoryKinds_Args::memory_kind_sizes"]
        [::std::mem::offset_of!(PJRT_Executable_OutputMemoryKinds_Args, memory_kind_sizes) - 40usize];
};
pub const PJRT_Executable_OutputMemoryKinds_Args_STRUCT_SIZE: _bindgen_ty_102 = 48;
pub type _bindgen_ty_102 = ::std::os::raw::c_uint;
pub type PJRT_Executable_OutputMemoryKinds =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_OutputMemoryKinds_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_SerializedExecutable {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_SerializedCompileOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_Serialize_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *const PJRT_Executable,
    pub serialized_bytes: *const ::std::os::raw::c_char,
    pub serialized_bytes_size: usize,
    pub serialized_executable: *mut PJRT_SerializedExecutable,
    pub serialized_executable_deleter:
        ::std::option::Option<unsafe extern "C" fn(exec: *mut PJRT_SerializedExecutable)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_Serialize_Args"][::std::mem::size_of::<PJRT_Executable_Serialize_Args>() - 56usize];
    ["Alignment of PJRT_Executable_Serialize_Args"][::std::mem::align_of::<PJRT_Executable_Serialize_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_Serialize_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_Serialize_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_Serialize_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_Serialize_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_Serialize_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_Serialize_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_Serialize_Args::serialized_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_Serialize_Args, serialized_bytes) - 24usize];
    ["Offset of field: PJRT_Executable_Serialize_Args::serialized_bytes_size"]
        [::std::mem::offset_of!(PJRT_Executable_Serialize_Args, serialized_bytes_size) - 32usize];
    ["Offset of field: PJRT_Executable_Serialize_Args::serialized_executable"]
        [::std::mem::offset_of!(PJRT_Executable_Serialize_Args, serialized_executable) - 40usize];
    ["Offset of field: PJRT_Executable_Serialize_Args::serialized_executable_deleter"]
        [::std::mem::offset_of!(PJRT_Executable_Serialize_Args, serialized_executable_deleter) - 48usize];
};
pub const PJRT_Executable_Serialize_Args_STRUCT_SIZE: _bindgen_ty_103 = 56;
pub type _bindgen_ty_103 = ::std::os::raw::c_uint;
pub type PJRT_Executable_Serialize =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_Serialize_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_GetCompileOptions_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_Executable,
    pub serialized_bytes: *const ::std::os::raw::c_char,
    pub serialized_bytes_size: usize,
    pub serialized_compile_options: *mut PJRT_SerializedCompileOptions,
    pub serialized_compile_options_deleter:
        ::std::option::Option<unsafe extern "C" fn(options: *mut PJRT_SerializedCompileOptions)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_GetCompileOptions_Args"]
        [::std::mem::size_of::<PJRT_Executable_GetCompileOptions_Args>() - 56usize];
    ["Alignment of PJRT_Executable_GetCompileOptions_Args"]
        [::std::mem::align_of::<PJRT_Executable_GetCompileOptions_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_GetCompileOptions_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompileOptions_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_GetCompileOptions_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompileOptions_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_GetCompileOptions_Args::executable"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompileOptions_Args, executable) - 16usize];
    ["Offset of field: PJRT_Executable_GetCompileOptions_Args::serialized_bytes"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompileOptions_Args, serialized_bytes) - 24usize];
    ["Offset of field: PJRT_Executable_GetCompileOptions_Args::serialized_bytes_size"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompileOptions_Args, serialized_bytes_size) - 32usize];
    ["Offset of field: PJRT_Executable_GetCompileOptions_Args::serialized_compile_options"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompileOptions_Args, serialized_compile_options) - 40usize];
    ["Offset of field: PJRT_Executable_GetCompileOptions_Args::serialized_compile_options_deleter"]
        [::std::mem::offset_of!(PJRT_Executable_GetCompileOptions_Args, serialized_compile_options_deleter) - 48usize];
};
pub const PJRT_Executable_GetCompileOptions_Args_STRUCT_SIZE: _bindgen_ty_104 = 56;
pub type _bindgen_ty_104 = ::std::os::raw::c_uint;
pub type PJRT_Executable_GetCompileOptions =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_GetCompileOptions_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Executable_DeserializeAndLoad_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub client: *mut PJRT_Client,
    pub serialized_executable: *const ::std::os::raw::c_char,
    pub serialized_executable_size: usize,
    pub loaded_executable: *mut PJRT_LoadedExecutable,
    pub overridden_serialized_compile_options: *const ::std::os::raw::c_char,
    pub overridden_serialized_compile_options_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Executable_DeserializeAndLoad_Args"]
        [::std::mem::size_of::<PJRT_Executable_DeserializeAndLoad_Args>() - 64usize];
    ["Alignment of PJRT_Executable_DeserializeAndLoad_Args"]
        [::std::mem::align_of::<PJRT_Executable_DeserializeAndLoad_Args>() - 8usize];
    ["Offset of field: PJRT_Executable_DeserializeAndLoad_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Executable_DeserializeAndLoad_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Executable_DeserializeAndLoad_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Executable_DeserializeAndLoad_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Executable_DeserializeAndLoad_Args::client"]
        [::std::mem::offset_of!(PJRT_Executable_DeserializeAndLoad_Args, client) - 16usize];
    ["Offset of field: PJRT_Executable_DeserializeAndLoad_Args::serialized_executable"]
        [::std::mem::offset_of!(PJRT_Executable_DeserializeAndLoad_Args, serialized_executable) - 24usize];
    ["Offset of field: PJRT_Executable_DeserializeAndLoad_Args::serialized_executable_size"]
        [::std::mem::offset_of!(PJRT_Executable_DeserializeAndLoad_Args, serialized_executable_size) - 32usize];
    ["Offset of field: PJRT_Executable_DeserializeAndLoad_Args::loaded_executable"]
        [::std::mem::offset_of!(PJRT_Executable_DeserializeAndLoad_Args, loaded_executable) - 40usize];
    ["Offset of field: PJRT_Executable_DeserializeAndLoad_Args::overridden_serialized_compile_options"][::std::mem::offset_of!(
        PJRT_Executable_DeserializeAndLoad_Args,
        overridden_serialized_compile_options
    ) - 48usize];
    ["Offset of field: PJRT_Executable_DeserializeAndLoad_Args::overridden_serialized_compile_options_size"][::std::mem::offset_of!(
        PJRT_Executable_DeserializeAndLoad_Args,
        overridden_serialized_compile_options_size
    )
        - 56usize];
};
pub const PJRT_Executable_DeserializeAndLoad_Args_STRUCT_SIZE: _bindgen_ty_105 = 64;
pub type _bindgen_ty_105 = ::std::os::raw::c_uint;
pub type PJRT_Executable_DeserializeAndLoad =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Executable_DeserializeAndLoad_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_LoadedExecutable_Fingerprint_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub executable: *mut PJRT_LoadedExecutable,
    pub executable_fingerprint: *const ::std::os::raw::c_char,
    pub executable_fingerprint_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_LoadedExecutable_Fingerprint_Args"]
        [::std::mem::size_of::<PJRT_LoadedExecutable_Fingerprint_Args>() - 40usize];
    ["Alignment of PJRT_LoadedExecutable_Fingerprint_Args"]
        [::std::mem::align_of::<PJRT_LoadedExecutable_Fingerprint_Args>() - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_Fingerprint_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Fingerprint_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_LoadedExecutable_Fingerprint_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Fingerprint_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_LoadedExecutable_Fingerprint_Args::executable"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Fingerprint_Args, executable) - 16usize];
    ["Offset of field: PJRT_LoadedExecutable_Fingerprint_Args::executable_fingerprint"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Fingerprint_Args, executable_fingerprint) - 24usize];
    ["Offset of field: PJRT_LoadedExecutable_Fingerprint_Args::executable_fingerprint_size"]
        [::std::mem::offset_of!(PJRT_LoadedExecutable_Fingerprint_Args, executable_fingerprint_size) - 32usize];
};
pub const PJRT_LoadedExecutable_Fingerprint_Args_STRUCT_SIZE: _bindgen_ty_106 = 40;
pub type _bindgen_ty_106 = ::std::os::raw::c_uint;
pub type PJRT_LoadedExecutable_Fingerprint =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_LoadedExecutable_Fingerprint_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_Destroy_Args"][::std::mem::size_of::<PJRT_Buffer_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_Buffer_Destroy_Args"][::std::mem::align_of::<PJRT_Buffer_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_Destroy_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_Destroy_Args, buffer) - 16usize];
};
pub const PJRT_Buffer_Destroy_Args_STRUCT_SIZE: _bindgen_ty_107 = 24;
pub type _bindgen_ty_107 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_ElementType_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub type_: PJRT_Buffer_Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_ElementType_Args"][::std::mem::size_of::<PJRT_Buffer_ElementType_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_ElementType_Args"][::std::mem::align_of::<PJRT_Buffer_ElementType_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_ElementType_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_ElementType_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_ElementType_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_ElementType_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_ElementType_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_ElementType_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_ElementType_Args::type_"]
        [::std::mem::offset_of!(PJRT_Buffer_ElementType_Args, type_) - 24usize];
};
pub const PJRT_Buffer_ElementType_Args_STRUCT_SIZE: _bindgen_ty_108 = 28;
pub type _bindgen_ty_108 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_ElementType =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_ElementType_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_Dimensions_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub dims: *const i64,
    pub num_dims: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_Dimensions_Args"][::std::mem::size_of::<PJRT_Buffer_Dimensions_Args>() - 40usize];
    ["Alignment of PJRT_Buffer_Dimensions_Args"][::std::mem::align_of::<PJRT_Buffer_Dimensions_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_Dimensions_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_Dimensions_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_Dimensions_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_Dimensions_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_Dimensions_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_Dimensions_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_Dimensions_Args::dims"]
        [::std::mem::offset_of!(PJRT_Buffer_Dimensions_Args, dims) - 24usize];
    ["Offset of field: PJRT_Buffer_Dimensions_Args::num_dims"]
        [::std::mem::offset_of!(PJRT_Buffer_Dimensions_Args, num_dims) - 32usize];
};
pub const PJRT_Buffer_Dimensions_Args_STRUCT_SIZE: _bindgen_ty_109 = 40;
pub type _bindgen_ty_109 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_Dimensions =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_Dimensions_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_UnpaddedDimensions_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub unpadded_dims: *const i64,
    pub num_dims: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_UnpaddedDimensions_Args"]
        [::std::mem::size_of::<PJRT_Buffer_UnpaddedDimensions_Args>() - 40usize];
    ["Alignment of PJRT_Buffer_UnpaddedDimensions_Args"]
        [::std::mem::align_of::<PJRT_Buffer_UnpaddedDimensions_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_UnpaddedDimensions_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_UnpaddedDimensions_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_UnpaddedDimensions_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_UnpaddedDimensions_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_UnpaddedDimensions_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_UnpaddedDimensions_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_UnpaddedDimensions_Args::unpadded_dims"]
        [::std::mem::offset_of!(PJRT_Buffer_UnpaddedDimensions_Args, unpadded_dims) - 24usize];
    ["Offset of field: PJRT_Buffer_UnpaddedDimensions_Args::num_dims"]
        [::std::mem::offset_of!(PJRT_Buffer_UnpaddedDimensions_Args, num_dims) - 32usize];
};
pub const PJRT_Buffer_UnpaddedDimensions_Args_STRUCT_SIZE: _bindgen_ty_110 = 40;
pub type _bindgen_ty_110 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_UnpaddedDimensions =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_UnpaddedDimensions_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_DynamicDimensionIndices_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub dynamic_dim_indices: *const usize,
    pub num_dynamic_dims: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_DynamicDimensionIndices_Args"]
        [::std::mem::size_of::<PJRT_Buffer_DynamicDimensionIndices_Args>() - 40usize];
    ["Alignment of PJRT_Buffer_DynamicDimensionIndices_Args"]
        [::std::mem::align_of::<PJRT_Buffer_DynamicDimensionIndices_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_DynamicDimensionIndices_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_DynamicDimensionIndices_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_DynamicDimensionIndices_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_DynamicDimensionIndices_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_DynamicDimensionIndices_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_DynamicDimensionIndices_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_DynamicDimensionIndices_Args::dynamic_dim_indices"]
        [::std::mem::offset_of!(PJRT_Buffer_DynamicDimensionIndices_Args, dynamic_dim_indices) - 24usize];
    ["Offset of field: PJRT_Buffer_DynamicDimensionIndices_Args::num_dynamic_dims"]
        [::std::mem::offset_of!(PJRT_Buffer_DynamicDimensionIndices_Args, num_dynamic_dims) - 32usize];
};
pub const PJRT_Buffer_DynamicDimensionIndices_Args_STRUCT_SIZE: _bindgen_ty_111 = 40;
pub type _bindgen_ty_111 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_DynamicDimensionIndices =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_DynamicDimensionIndices_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct PJRT_Buffer_GetMemoryLayout_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub layout: PJRT_Buffer_MemoryLayout,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_GetMemoryLayout_Args"][::std::mem::size_of::<PJRT_Buffer_GetMemoryLayout_Args>() - 104usize];
    ["Alignment of PJRT_Buffer_GetMemoryLayout_Args"]
        [::std::mem::align_of::<PJRT_Buffer_GetMemoryLayout_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_GetMemoryLayout_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_GetMemoryLayout_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_GetMemoryLayout_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_GetMemoryLayout_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_GetMemoryLayout_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_GetMemoryLayout_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_GetMemoryLayout_Args::layout"]
        [::std::mem::offset_of!(PJRT_Buffer_GetMemoryLayout_Args, layout) - 24usize];
};
pub const PJRT_Buffer_GetMemoryLayout_Args_STRUCT_SIZE: _bindgen_ty_112 = 104;
pub type _bindgen_ty_112 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_GetMemoryLayout =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_GetMemoryLayout_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_ToHostBuffer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub src: *mut PJRT_Buffer,
    pub host_layout: *mut PJRT_Buffer_MemoryLayout,
    pub dst: *mut ::std::os::raw::c_void,
    pub dst_size: usize,
    pub event: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_ToHostBuffer_Args"][::std::mem::size_of::<PJRT_Buffer_ToHostBuffer_Args>() - 56usize];
    ["Alignment of PJRT_Buffer_ToHostBuffer_Args"][::std::mem::align_of::<PJRT_Buffer_ToHostBuffer_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_ToHostBuffer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_ToHostBuffer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_ToHostBuffer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_ToHostBuffer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_ToHostBuffer_Args::src"]
        [::std::mem::offset_of!(PJRT_Buffer_ToHostBuffer_Args, src) - 16usize];
    ["Offset of field: PJRT_Buffer_ToHostBuffer_Args::host_layout"]
        [::std::mem::offset_of!(PJRT_Buffer_ToHostBuffer_Args, host_layout) - 24usize];
    ["Offset of field: PJRT_Buffer_ToHostBuffer_Args::dst"]
        [::std::mem::offset_of!(PJRT_Buffer_ToHostBuffer_Args, dst) - 32usize];
    ["Offset of field: PJRT_Buffer_ToHostBuffer_Args::dst_size"]
        [::std::mem::offset_of!(PJRT_Buffer_ToHostBuffer_Args, dst_size) - 40usize];
    ["Offset of field: PJRT_Buffer_ToHostBuffer_Args::event"]
        [::std::mem::offset_of!(PJRT_Buffer_ToHostBuffer_Args, event) - 48usize];
};
pub const PJRT_Buffer_ToHostBuffer_Args_STRUCT_SIZE: _bindgen_ty_113 = 56;
pub type _bindgen_ty_113 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_ToHostBuffer =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_ToHostBuffer_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_OnDeviceSizeInBytes_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub on_device_size_in_bytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_OnDeviceSizeInBytes_Args"]
        [::std::mem::size_of::<PJRT_Buffer_OnDeviceSizeInBytes_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_OnDeviceSizeInBytes_Args"]
        [::std::mem::align_of::<PJRT_Buffer_OnDeviceSizeInBytes_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_OnDeviceSizeInBytes_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_OnDeviceSizeInBytes_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_OnDeviceSizeInBytes_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_OnDeviceSizeInBytes_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_OnDeviceSizeInBytes_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_OnDeviceSizeInBytes_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_OnDeviceSizeInBytes_Args::on_device_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_Buffer_OnDeviceSizeInBytes_Args, on_device_size_in_bytes) - 24usize];
};
pub const PJRT_Buffer_OnDeviceSizeInBytes_Args_STRUCT_SIZE: _bindgen_ty_114 = 32;
pub type _bindgen_ty_114 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_OnDeviceSizeInBytes =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_OnDeviceSizeInBytes_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_Delete_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_Delete_Args"][::std::mem::size_of::<PJRT_Buffer_Delete_Args>() - 24usize];
    ["Alignment of PJRT_Buffer_Delete_Args"][::std::mem::align_of::<PJRT_Buffer_Delete_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_Delete_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_Delete_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_Delete_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_Delete_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_Delete_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_Delete_Args, buffer) - 16usize];
};
pub const PJRT_Buffer_Delete_Args_STRUCT_SIZE: _bindgen_ty_115 = 24;
pub type _bindgen_ty_115 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_Delete =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_Delete_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_IsDeleted_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub is_deleted: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_IsDeleted_Args"][::std::mem::size_of::<PJRT_Buffer_IsDeleted_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_IsDeleted_Args"][::std::mem::align_of::<PJRT_Buffer_IsDeleted_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_IsDeleted_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_IsDeleted_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_IsDeleted_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_IsDeleted_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_IsDeleted_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_IsDeleted_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_IsDeleted_Args::is_deleted"]
        [::std::mem::offset_of!(PJRT_Buffer_IsDeleted_Args, is_deleted) - 24usize];
};
pub const PJRT_Buffer_IsDeleted_Args_STRUCT_SIZE: _bindgen_ty_116 = 25;
pub type _bindgen_ty_116 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_IsDeleted =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_IsDeleted_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_CopyRawToHost_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub dst: *mut ::std::os::raw::c_void,
    pub offset: i64,
    pub transfer_size: i64,
    pub event: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_CopyRawToHost_Args"][::std::mem::size_of::<PJRT_Buffer_CopyRawToHost_Args>() - 56usize];
    ["Alignment of PJRT_Buffer_CopyRawToHost_Args"][::std::mem::align_of::<PJRT_Buffer_CopyRawToHost_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHost_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHost_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHost_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHost_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHost_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHost_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHost_Args::dst"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHost_Args, dst) - 24usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHost_Args::offset"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHost_Args, offset) - 32usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHost_Args::transfer_size"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHost_Args, transfer_size) - 40usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHost_Args::event"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHost_Args, event) - 48usize];
};
pub const PJRT_Buffer_CopyRawToHost_Args_STRUCT_SIZE: _bindgen_ty_117 = 56;
pub type _bindgen_ty_117 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_CopyRawToHost =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_CopyRawToHost_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_CopyRawToHostFuture_Callback_Args {
    pub struct_size: usize,
    pub callback_data: *mut ::std::os::raw::c_void,
    pub error_code: PJRT_Error_Code,
    pub error_message: *const ::std::os::raw::c_char,
    pub error_message_size: usize,
    pub dst: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_CopyRawToHostFuture_Callback_Args"]
        [::std::mem::size_of::<PJRT_Buffer_CopyRawToHostFuture_Callback_Args>() - 48usize];
    ["Alignment of PJRT_Buffer_CopyRawToHostFuture_Callback_Args"]
        [::std::mem::align_of::<PJRT_Buffer_CopyRawToHostFuture_Callback_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Callback_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Callback_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Callback_Args::callback_data"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Callback_Args, callback_data) - 8usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Callback_Args::error_code"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Callback_Args, error_code) - 16usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Callback_Args::error_message"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Callback_Args, error_message) - 24usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Callback_Args::error_message_size"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Callback_Args, error_message_size) - 32usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Callback_Args::dst"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Callback_Args, dst) - 40usize];
};
pub const PJRT_Buffer_CopyRawToHostFuture_Callback_Args_STRUCT_SIZE: _bindgen_ty_118 = 48;
pub type _bindgen_ty_118 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_CopyRawToHostFuture_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub offset: i64,
    pub transfer_size: i64,
    pub event: *mut PJRT_Event,
    pub callback_data: *mut ::std::os::raw::c_void,
    pub future_ready_callback:
        ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_CopyRawToHostFuture_Callback_Args)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_CopyRawToHostFuture_Args"]
        [::std::mem::size_of::<PJRT_Buffer_CopyRawToHostFuture_Args>() - 64usize];
    ["Alignment of PJRT_Buffer_CopyRawToHostFuture_Args"]
        [::std::mem::align_of::<PJRT_Buffer_CopyRawToHostFuture_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Args::offset"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Args, offset) - 24usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Args::transfer_size"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Args, transfer_size) - 32usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Args::event"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Args, event) - 40usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Args::callback_data"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Args, callback_data) - 48usize];
    ["Offset of field: PJRT_Buffer_CopyRawToHostFuture_Args::future_ready_callback"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyRawToHostFuture_Args, future_ready_callback) - 56usize];
};
pub const PJRT_Buffer_CopyRawToHostFuture_Args_STRUCT_SIZE: _bindgen_ty_119 = 64;
pub type _bindgen_ty_119 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_CopyRawToHostFuture =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_CopyRawToHostFuture_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_CopyToDevice_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub dst_device: *mut PJRT_Device,
    pub dst_buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_CopyToDevice_Args"][::std::mem::size_of::<PJRT_Buffer_CopyToDevice_Args>() - 40usize];
    ["Alignment of PJRT_Buffer_CopyToDevice_Args"][::std::mem::align_of::<PJRT_Buffer_CopyToDevice_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_CopyToDevice_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToDevice_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_CopyToDevice_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToDevice_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_CopyToDevice_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToDevice_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_CopyToDevice_Args::dst_device"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToDevice_Args, dst_device) - 24usize];
    ["Offset of field: PJRT_Buffer_CopyToDevice_Args::dst_buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToDevice_Args, dst_buffer) - 32usize];
};
pub const PJRT_Buffer_CopyToDevice_Args_STRUCT_SIZE: _bindgen_ty_120 = 40;
pub type _bindgen_ty_120 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_CopyToDevice =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_CopyToDevice_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_CopyToMemory_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub dst_memory: *mut PJRT_Memory,
    pub dst_buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_CopyToMemory_Args"][::std::mem::size_of::<PJRT_Buffer_CopyToMemory_Args>() - 40usize];
    ["Alignment of PJRT_Buffer_CopyToMemory_Args"][::std::mem::align_of::<PJRT_Buffer_CopyToMemory_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_CopyToMemory_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToMemory_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_CopyToMemory_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToMemory_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_CopyToMemory_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToMemory_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_CopyToMemory_Args::dst_memory"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToMemory_Args, dst_memory) - 24usize];
    ["Offset of field: PJRT_Buffer_CopyToMemory_Args::dst_buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_CopyToMemory_Args, dst_buffer) - 32usize];
};
pub const PJRT_Buffer_CopyToMemory_Args_STRUCT_SIZE: _bindgen_ty_121 = 40;
pub type _bindgen_ty_121 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_CopyToMemory =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_CopyToMemory_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_IsOnCpu_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub is_on_cpu: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_IsOnCpu_Args"][::std::mem::size_of::<PJRT_Buffer_IsOnCpu_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_IsOnCpu_Args"][::std::mem::align_of::<PJRT_Buffer_IsOnCpu_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_IsOnCpu_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_IsOnCpu_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_IsOnCpu_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_IsOnCpu_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_IsOnCpu_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_IsOnCpu_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_IsOnCpu_Args::is_on_cpu"]
        [::std::mem::offset_of!(PJRT_Buffer_IsOnCpu_Args, is_on_cpu) - 24usize];
};
pub const PJRT_Buffer_IsOnCpu_Args_STRUCT_SIZE: _bindgen_ty_122 = 25;
pub type _bindgen_ty_122 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_IsOnCpu =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_IsOnCpu_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_Device_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub device: *mut PJRT_Device,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_Device_Args"][::std::mem::size_of::<PJRT_Buffer_Device_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_Device_Args"][::std::mem::align_of::<PJRT_Buffer_Device_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_Device_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_Device_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_Device_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_Device_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_Device_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_Device_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_Device_Args::device"]
        [::std::mem::offset_of!(PJRT_Buffer_Device_Args, device) - 24usize];
};
pub const PJRT_Buffer_Device_Args_STRUCT_SIZE: _bindgen_ty_123 = 32;
pub type _bindgen_ty_123 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_Device =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_Device_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_Memory_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub memory: *mut PJRT_Memory,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_Memory_Args"][::std::mem::size_of::<PJRT_Buffer_Memory_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_Memory_Args"][::std::mem::align_of::<PJRT_Buffer_Memory_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_Memory_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_Memory_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_Memory_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_Memory_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_Memory_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_Memory_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_Memory_Args::memory"]
        [::std::mem::offset_of!(PJRT_Buffer_Memory_Args, memory) - 24usize];
};
pub const PJRT_Buffer_Memory_Args_STRUCT_SIZE: _bindgen_ty_124 = 32;
pub type _bindgen_ty_124 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_Memory =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_Memory_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_ReadyEvent_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub event: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_ReadyEvent_Args"][::std::mem::size_of::<PJRT_Buffer_ReadyEvent_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_ReadyEvent_Args"][::std::mem::align_of::<PJRT_Buffer_ReadyEvent_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_ReadyEvent_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_ReadyEvent_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_ReadyEvent_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_ReadyEvent_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_ReadyEvent_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_ReadyEvent_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_ReadyEvent_Args::event"]
        [::std::mem::offset_of!(PJRT_Buffer_ReadyEvent_Args, event) - 24usize];
};
pub const PJRT_Buffer_ReadyEvent_Args_STRUCT_SIZE: _bindgen_ty_125 = 32;
pub type _bindgen_ty_125 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_ReadyEvent =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_ReadyEvent_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_UnsafePointer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub buffer_pointer: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_UnsafePointer_Args"][::std::mem::size_of::<PJRT_Buffer_UnsafePointer_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_UnsafePointer_Args"][::std::mem::align_of::<PJRT_Buffer_UnsafePointer_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_UnsafePointer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_UnsafePointer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_UnsafePointer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_UnsafePointer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_UnsafePointer_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_UnsafePointer_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_UnsafePointer_Args::buffer_pointer"]
        [::std::mem::offset_of!(PJRT_Buffer_UnsafePointer_Args, buffer_pointer) - 24usize];
};
pub const PJRT_Buffer_UnsafePointer_Args_STRUCT_SIZE: _bindgen_ty_126 = 32;
pub type _bindgen_ty_126 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_UnsafePointer =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_UnsafePointer_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_IncreaseExternalReferenceCount_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_IncreaseExternalReferenceCount_Args"]
        [::std::mem::size_of::<PJRT_Buffer_IncreaseExternalReferenceCount_Args>() - 24usize];
    ["Alignment of PJRT_Buffer_IncreaseExternalReferenceCount_Args"]
        [::std::mem::align_of::<PJRT_Buffer_IncreaseExternalReferenceCount_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_IncreaseExternalReferenceCount_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_IncreaseExternalReferenceCount_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_IncreaseExternalReferenceCount_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_IncreaseExternalReferenceCount_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_IncreaseExternalReferenceCount_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_IncreaseExternalReferenceCount_Args, buffer) - 16usize];
};
pub const PJRT_Buffer_IncreaseExternalReferenceCount_Args_STRUCT_SIZE: _bindgen_ty_127 = 24;
pub type _bindgen_ty_127 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_IncreaseExternalReferenceCount = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Buffer_IncreaseExternalReferenceCount_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_DecreaseExternalReferenceCount_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_DecreaseExternalReferenceCount_Args"]
        [::std::mem::size_of::<PJRT_Buffer_DecreaseExternalReferenceCount_Args>() - 24usize];
    ["Alignment of PJRT_Buffer_DecreaseExternalReferenceCount_Args"]
        [::std::mem::align_of::<PJRT_Buffer_DecreaseExternalReferenceCount_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_DecreaseExternalReferenceCount_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_DecreaseExternalReferenceCount_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_DecreaseExternalReferenceCount_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_DecreaseExternalReferenceCount_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_DecreaseExternalReferenceCount_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_DecreaseExternalReferenceCount_Args, buffer) - 16usize];
};
pub const PJRT_Buffer_DecreaseExternalReferenceCount_Args_STRUCT_SIZE: _bindgen_ty_128 = 24;
pub type _bindgen_ty_128 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_DecreaseExternalReferenceCount = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Buffer_DecreaseExternalReferenceCount_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub device_memory_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args"]
        [::std::mem::size_of::<PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args>() - 32usize];
    ["Alignment of PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args"]
        [::std::mem::align_of::<PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args::device_memory_ptr"]
        [::std::mem::offset_of!(PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args, device_memory_ptr) - 24usize];
};
pub const PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args_STRUCT_SIZE: _bindgen_ty_129 = 32;
pub type _bindgen_ty_129 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_OpaqueDeviceMemoryDataPointer = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Buffer_OpaqueDeviceMemoryDataPointer_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_DonateWithControlDependency_Callback_Args {
    pub struct_size: usize,
    pub callback_data: *mut ::std::os::raw::c_void,
    pub error_code: PJRT_Error_Code,
    pub error_message: *const ::std::os::raw::c_char,
    pub error_message_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_DonateWithControlDependency_Callback_Args"]
        [::std::mem::size_of::<PJRT_Buffer_DonateWithControlDependency_Callback_Args>() - 40usize];
    ["Alignment of PJRT_Buffer_DonateWithControlDependency_Callback_Args"]
        [::std::mem::align_of::<PJRT_Buffer_DonateWithControlDependency_Callback_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Callback_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Callback_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Callback_Args::callback_data"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Callback_Args, callback_data) - 8usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Callback_Args::error_code"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Callback_Args, error_code) - 16usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Callback_Args::error_message"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Callback_Args, error_message) - 24usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Callback_Args::error_message_size"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Callback_Args, error_message_size) - 32usize];
};
pub const PJRT_Buffer_DonateWithControlDependency_Callback_Args_STRUCT_SIZE: _bindgen_ty_130 = 40;
pub type _bindgen_ty_130 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Buffer_DonateWithControlDependency_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub buffer: *mut PJRT_Buffer,
    pub callback_data: *mut ::std::os::raw::c_void,
    pub dependency_ready_callback:
        ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Buffer_DonateWithControlDependency_Callback_Args)>,
    pub out_buffer: *mut PJRT_Buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Buffer_DonateWithControlDependency_Args"]
        [::std::mem::size_of::<PJRT_Buffer_DonateWithControlDependency_Args>() - 48usize];
    ["Alignment of PJRT_Buffer_DonateWithControlDependency_Args"]
        [::std::mem::align_of::<PJRT_Buffer_DonateWithControlDependency_Args>() - 8usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Args::buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Args, buffer) - 16usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Args::callback_data"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Args, callback_data) - 24usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Args::dependency_ready_callback"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Args, dependency_ready_callback) - 32usize];
    ["Offset of field: PJRT_Buffer_DonateWithControlDependency_Args::out_buffer"]
        [::std::mem::offset_of!(PJRT_Buffer_DonateWithControlDependency_Args, out_buffer) - 40usize];
};
pub const PJRT_Buffer_DonateWithControlDependency_Args_STRUCT_SIZE: _bindgen_ty_131 = 48;
pub type _bindgen_ty_131 = ::std::os::raw::c_uint;
pub type PJRT_Buffer_DonateWithControlDependency = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_Buffer_DonateWithControlDependency_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_CopyToDeviceStream_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub stream: *mut PJRT_CopyToDeviceStream,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_CopyToDeviceStream_Destroy_Args"]
        [::std::mem::size_of::<PJRT_CopyToDeviceStream_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_CopyToDeviceStream_Destroy_Args"]
        [::std::mem::align_of::<PJRT_CopyToDeviceStream_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_CopyToDeviceStream_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_Destroy_Args::stream"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_Destroy_Args, stream) - 16usize];
};
pub const PJRT_CopyToDeviceStream_Destroy_Args_STRUCT_SIZE: _bindgen_ty_132 = 24;
pub type _bindgen_ty_132 = ::std::os::raw::c_uint;
pub type PJRT_CopyToDeviceStream_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_CopyToDeviceStream_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_CopyToDeviceStream_AddChunk_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub stream: *mut PJRT_CopyToDeviceStream,
    pub chunk: *mut PJRT_Chunk,
    pub transfer_complete: *mut PJRT_Event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_CopyToDeviceStream_AddChunk_Args"]
        [::std::mem::size_of::<PJRT_CopyToDeviceStream_AddChunk_Args>() - 40usize];
    ["Alignment of PJRT_CopyToDeviceStream_AddChunk_Args"]
        [::std::mem::align_of::<PJRT_CopyToDeviceStream_AddChunk_Args>() - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_AddChunk_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_AddChunk_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_CopyToDeviceStream_AddChunk_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_AddChunk_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_AddChunk_Args::stream"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_AddChunk_Args, stream) - 16usize];
    ["Offset of field: PJRT_CopyToDeviceStream_AddChunk_Args::chunk"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_AddChunk_Args, chunk) - 24usize];
    ["Offset of field: PJRT_CopyToDeviceStream_AddChunk_Args::transfer_complete"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_AddChunk_Args, transfer_complete) - 32usize];
};
pub const PJRT_CopyToDeviceStream_AddChunk_Args_STRUCT_SIZE: _bindgen_ty_133 = 40;
pub type _bindgen_ty_133 = ::std::os::raw::c_uint;
pub type PJRT_CopyToDeviceStream_AddChunk =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_CopyToDeviceStream_AddChunk_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_CopyToDeviceStream_TotalBytes_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub stream: *mut PJRT_CopyToDeviceStream,
    pub total_bytes: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_CopyToDeviceStream_TotalBytes_Args"]
        [::std::mem::size_of::<PJRT_CopyToDeviceStream_TotalBytes_Args>() - 32usize];
    ["Alignment of PJRT_CopyToDeviceStream_TotalBytes_Args"]
        [::std::mem::align_of::<PJRT_CopyToDeviceStream_TotalBytes_Args>() - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_TotalBytes_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_TotalBytes_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_CopyToDeviceStream_TotalBytes_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_TotalBytes_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_TotalBytes_Args::stream"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_TotalBytes_Args, stream) - 16usize];
    ["Offset of field: PJRT_CopyToDeviceStream_TotalBytes_Args::total_bytes"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_TotalBytes_Args, total_bytes) - 24usize];
};
pub const PJRT_CopyToDeviceStream_TotalBytes_Args_STRUCT_SIZE: _bindgen_ty_134 = 32;
pub type _bindgen_ty_134 = ::std::os::raw::c_uint;
pub type PJRT_CopyToDeviceStream_TotalBytes =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_CopyToDeviceStream_TotalBytes_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_CopyToDeviceStream_GranuleSize_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub stream: *mut PJRT_CopyToDeviceStream,
    pub granule_size_in_bytes: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_CopyToDeviceStream_GranuleSize_Args"]
        [::std::mem::size_of::<PJRT_CopyToDeviceStream_GranuleSize_Args>() - 32usize];
    ["Alignment of PJRT_CopyToDeviceStream_GranuleSize_Args"]
        [::std::mem::align_of::<PJRT_CopyToDeviceStream_GranuleSize_Args>() - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_GranuleSize_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_GranuleSize_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_CopyToDeviceStream_GranuleSize_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_GranuleSize_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_GranuleSize_Args::stream"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_GranuleSize_Args, stream) - 16usize];
    ["Offset of field: PJRT_CopyToDeviceStream_GranuleSize_Args::granule_size_in_bytes"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_GranuleSize_Args, granule_size_in_bytes) - 24usize];
};
pub const PJRT_CopyToDeviceStream_GranuleSize_Args_STRUCT_SIZE: _bindgen_ty_135 = 32;
pub type _bindgen_ty_135 = ::std::os::raw::c_uint;
pub type PJRT_CopyToDeviceStream_GranuleSize =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_CopyToDeviceStream_GranuleSize_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_CopyToDeviceStream_CurrentBytes_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub stream: *mut PJRT_CopyToDeviceStream,
    pub current_bytes: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_CopyToDeviceStream_CurrentBytes_Args"]
        [::std::mem::size_of::<PJRT_CopyToDeviceStream_CurrentBytes_Args>() - 32usize];
    ["Alignment of PJRT_CopyToDeviceStream_CurrentBytes_Args"]
        [::std::mem::align_of::<PJRT_CopyToDeviceStream_CurrentBytes_Args>() - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_CurrentBytes_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_CurrentBytes_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_CopyToDeviceStream_CurrentBytes_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_CurrentBytes_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_CopyToDeviceStream_CurrentBytes_Args::stream"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_CurrentBytes_Args, stream) - 16usize];
    ["Offset of field: PJRT_CopyToDeviceStream_CurrentBytes_Args::current_bytes"]
        [::std::mem::offset_of!(PJRT_CopyToDeviceStream_CurrentBytes_Args, current_bytes) - 24usize];
};
pub const PJRT_CopyToDeviceStream_CurrentBytes_Args_STRUCT_SIZE: _bindgen_ty_136 = 32;
pub type _bindgen_ty_136 = ::std::os::raw::c_uint;
pub type PJRT_CopyToDeviceStream_CurrentBytes = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_CopyToDeviceStream_CurrentBytes_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription_Create_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub topology_name: *const ::std::os::raw::c_char,
    pub topology_name_size: usize,
    pub create_options: *const PJRT_NamedValue,
    pub num_options: usize,
    pub topology: *mut PJRT_TopologyDescription,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_TopologyDescription_Create_Args"]
        [::std::mem::size_of::<PJRT_TopologyDescription_Create_Args>() - 56usize];
    ["Alignment of PJRT_TopologyDescription_Create_Args"]
        [::std::mem::align_of::<PJRT_TopologyDescription_Create_Args>() - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Create_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Create_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_TopologyDescription_Create_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Create_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Create_Args::topology_name"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Create_Args, topology_name) - 16usize];
    ["Offset of field: PJRT_TopologyDescription_Create_Args::topology_name_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Create_Args, topology_name_size) - 24usize];
    ["Offset of field: PJRT_TopologyDescription_Create_Args::create_options"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Create_Args, create_options) - 32usize];
    ["Offset of field: PJRT_TopologyDescription_Create_Args::num_options"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Create_Args, num_options) - 40usize];
    ["Offset of field: PJRT_TopologyDescription_Create_Args::topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Create_Args, topology) - 48usize];
};
pub const PJRT_TopologyDescription_Create_Args_STRUCT_SIZE: _bindgen_ty_137 = 56;
pub type _bindgen_ty_137 = ::std::os::raw::c_uint;
pub type PJRT_TopologyDescription_Create =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_TopologyDescription_Create_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription_Destroy_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub topology: *mut PJRT_TopologyDescription,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_TopologyDescription_Destroy_Args"]
        [::std::mem::size_of::<PJRT_TopologyDescription_Destroy_Args>() - 24usize];
    ["Alignment of PJRT_TopologyDescription_Destroy_Args"]
        [::std::mem::align_of::<PJRT_TopologyDescription_Destroy_Args>() - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Destroy_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Destroy_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_TopologyDescription_Destroy_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Destroy_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Destroy_Args::topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Destroy_Args, topology) - 16usize];
};
pub const PJRT_TopologyDescription_Destroy_Args_STRUCT_SIZE: _bindgen_ty_138 = 24;
pub type _bindgen_ty_138 = ::std::os::raw::c_uint;
pub type PJRT_TopologyDescription_Destroy =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_TopologyDescription_Destroy_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription_PlatformVersion_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub topology: *mut PJRT_TopologyDescription,
    pub platform_version: *const ::std::os::raw::c_char,
    pub platform_version_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_TopologyDescription_PlatformVersion_Args"]
        [::std::mem::size_of::<PJRT_TopologyDescription_PlatformVersion_Args>() - 40usize];
    ["Alignment of PJRT_TopologyDescription_PlatformVersion_Args"]
        [::std::mem::align_of::<PJRT_TopologyDescription_PlatformVersion_Args>() - 8usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformVersion_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformVersion_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformVersion_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformVersion_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformVersion_Args::topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformVersion_Args, topology) - 16usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformVersion_Args::platform_version"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformVersion_Args, platform_version) - 24usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformVersion_Args::platform_version_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformVersion_Args, platform_version_size) - 32usize];
};
pub const PJRT_TopologyDescription_PlatformVersion_Args_STRUCT_SIZE: _bindgen_ty_139 = 40;
pub type _bindgen_ty_139 = ::std::os::raw::c_uint;
pub type PJRT_TopologyDescription_PlatformVersion = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_TopologyDescription_PlatformVersion_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription_PlatformName_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub topology: *const PJRT_TopologyDescription,
    pub platform_name: *const ::std::os::raw::c_char,
    pub platform_name_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_TopologyDescription_PlatformName_Args"]
        [::std::mem::size_of::<PJRT_TopologyDescription_PlatformName_Args>() - 40usize];
    ["Alignment of PJRT_TopologyDescription_PlatformName_Args"]
        [::std::mem::align_of::<PJRT_TopologyDescription_PlatformName_Args>() - 8usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformName_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformName_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformName_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformName_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformName_Args::topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformName_Args, topology) - 16usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformName_Args::platform_name"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformName_Args, platform_name) - 24usize];
    ["Offset of field: PJRT_TopologyDescription_PlatformName_Args::platform_name_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_PlatformName_Args, platform_name_size) - 32usize];
};
pub const PJRT_TopologyDescription_PlatformName_Args_STRUCT_SIZE: _bindgen_ty_140 = 40;
pub type _bindgen_ty_140 = ::std::os::raw::c_uint;
pub type PJRT_TopologyDescription_PlatformName = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_TopologyDescription_PlatformName_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription_GetDeviceDescriptions_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub topology: *const PJRT_TopologyDescription,
    pub descriptions: *const *mut PJRT_DeviceDescription,
    pub num_descriptions: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_TopologyDescription_GetDeviceDescriptions_Args"]
        [::std::mem::size_of::<PJRT_TopologyDescription_GetDeviceDescriptions_Args>() - 40usize];
    ["Alignment of PJRT_TopologyDescription_GetDeviceDescriptions_Args"]
        [::std::mem::align_of::<PJRT_TopologyDescription_GetDeviceDescriptions_Args>() - 8usize];
    ["Offset of field: PJRT_TopologyDescription_GetDeviceDescriptions_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_GetDeviceDescriptions_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_TopologyDescription_GetDeviceDescriptions_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_GetDeviceDescriptions_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_TopologyDescription_GetDeviceDescriptions_Args::topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_GetDeviceDescriptions_Args, topology) - 16usize];
    ["Offset of field: PJRT_TopologyDescription_GetDeviceDescriptions_Args::descriptions"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_GetDeviceDescriptions_Args, descriptions) - 24usize];
    ["Offset of field: PJRT_TopologyDescription_GetDeviceDescriptions_Args::num_descriptions"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_GetDeviceDescriptions_Args, num_descriptions) - 32usize];
};
pub const PJRT_TopologyDescription_GetDeviceDescriptions_Args_STRUCT_SIZE: _bindgen_ty_141 = 40;
pub type _bindgen_ty_141 = ::std::os::raw::c_uint;
pub type PJRT_TopologyDescription_GetDeviceDescriptions = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_TopologyDescription_GetDeviceDescriptions_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_SerializedTopology {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription_Serialize_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub topology: *mut PJRT_TopologyDescription,
    pub serialized_bytes: *const ::std::os::raw::c_char,
    pub serialized_bytes_size: usize,
    pub serialized_topology: *mut PJRT_SerializedTopology,
    pub serialized_topology_deleter:
        ::std::option::Option<unsafe extern "C" fn(serialized_topology: *mut PJRT_SerializedTopology)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_TopologyDescription_Serialize_Args"]
        [::std::mem::size_of::<PJRT_TopologyDescription_Serialize_Args>() - 56usize];
    ["Alignment of PJRT_TopologyDescription_Serialize_Args"]
        [::std::mem::align_of::<PJRT_TopologyDescription_Serialize_Args>() - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Serialize_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Serialize_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_TopologyDescription_Serialize_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Serialize_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Serialize_Args::topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Serialize_Args, topology) - 16usize];
    ["Offset of field: PJRT_TopologyDescription_Serialize_Args::serialized_bytes"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Serialize_Args, serialized_bytes) - 24usize];
    ["Offset of field: PJRT_TopologyDescription_Serialize_Args::serialized_bytes_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Serialize_Args, serialized_bytes_size) - 32usize];
    ["Offset of field: PJRT_TopologyDescription_Serialize_Args::serialized_topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Serialize_Args, serialized_topology) - 40usize];
    ["Offset of field: PJRT_TopologyDescription_Serialize_Args::serialized_topology_deleter"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Serialize_Args, serialized_topology_deleter) - 48usize];
};
pub const PJRT_TopologyDescription_Serialize_Args_STRUCT_SIZE: _bindgen_ty_142 = 56;
pub type _bindgen_ty_142 = ::std::os::raw::c_uint;
pub type PJRT_TopologyDescription_Serialize =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_TopologyDescription_Serialize_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription_Deserialize_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub serialized_topology: *const ::std::os::raw::c_char,
    pub serialized_topology_size: usize,
    pub topology: *mut PJRT_TopologyDescription,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_TopologyDescription_Deserialize_Args"]
        [::std::mem::size_of::<PJRT_TopologyDescription_Deserialize_Args>() - 40usize];
    ["Alignment of PJRT_TopologyDescription_Deserialize_Args"]
        [::std::mem::align_of::<PJRT_TopologyDescription_Deserialize_Args>() - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Deserialize_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Deserialize_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_TopologyDescription_Deserialize_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Deserialize_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Deserialize_Args::serialized_topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Deserialize_Args, serialized_topology) - 16usize];
    ["Offset of field: PJRT_TopologyDescription_Deserialize_Args::serialized_topology_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Deserialize_Args, serialized_topology_size) - 24usize];
    ["Offset of field: PJRT_TopologyDescription_Deserialize_Args::topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Deserialize_Args, topology) - 32usize];
};
pub const PJRT_TopologyDescription_Deserialize_Args_STRUCT_SIZE: _bindgen_ty_143 = 40;
pub type _bindgen_ty_143 = ::std::os::raw::c_uint;
pub type PJRT_TopologyDescription_Deserialize = ::std::option::Option<
    unsafe extern "C" fn(args: *mut PJRT_TopologyDescription_Deserialize_Args) -> *mut PJRT_Error,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_TopologyDescription_Attributes_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub topology: *mut PJRT_TopologyDescription,
    pub attributes: *const PJRT_NamedValue,
    pub num_attributes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_TopologyDescription_Attributes_Args"]
        [::std::mem::size_of::<PJRT_TopologyDescription_Attributes_Args>() - 40usize];
    ["Alignment of PJRT_TopologyDescription_Attributes_Args"]
        [::std::mem::align_of::<PJRT_TopologyDescription_Attributes_Args>() - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Attributes_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Attributes_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_TopologyDescription_Attributes_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Attributes_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_TopologyDescription_Attributes_Args::topology"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Attributes_Args, topology) - 16usize];
    ["Offset of field: PJRT_TopologyDescription_Attributes_Args::attributes"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Attributes_Args, attributes) - 24usize];
    ["Offset of field: PJRT_TopologyDescription_Attributes_Args::num_attributes"]
        [::std::mem::offset_of!(PJRT_TopologyDescription_Attributes_Args, num_attributes) - 32usize];
};
pub const PJRT_TopologyDescription_Attributes_Args_STRUCT_SIZE: _bindgen_ty_144 = 40;
pub type _bindgen_ty_144 = ::std::os::raw::c_uint;
pub type PJRT_TopologyDescription_Attributes =
    ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_TopologyDescription_Attributes_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Compile_Args {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub topology: *const PJRT_TopologyDescription,
    pub program: *const PJRT_Program,
    pub compile_options: *const ::std::os::raw::c_char,
    pub compile_options_size: usize,
    pub client: *mut PJRT_Client,
    pub executable: *mut PJRT_Executable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Compile_Args"][::std::mem::size_of::<PJRT_Compile_Args>() - 64usize];
    ["Alignment of PJRT_Compile_Args"][::std::mem::align_of::<PJRT_Compile_Args>() - 8usize];
    ["Offset of field: PJRT_Compile_Args::struct_size"]
        [::std::mem::offset_of!(PJRT_Compile_Args, struct_size) - 0usize];
    ["Offset of field: PJRT_Compile_Args::extension_start"]
        [::std::mem::offset_of!(PJRT_Compile_Args, extension_start) - 8usize];
    ["Offset of field: PJRT_Compile_Args::topology"][::std::mem::offset_of!(PJRT_Compile_Args, topology) - 16usize];
    ["Offset of field: PJRT_Compile_Args::program"][::std::mem::offset_of!(PJRT_Compile_Args, program) - 24usize];
    ["Offset of field: PJRT_Compile_Args::compile_options"]
        [::std::mem::offset_of!(PJRT_Compile_Args, compile_options) - 32usize];
    ["Offset of field: PJRT_Compile_Args::compile_options_size"]
        [::std::mem::offset_of!(PJRT_Compile_Args, compile_options_size) - 40usize];
    ["Offset of field: PJRT_Compile_Args::client"][::std::mem::offset_of!(PJRT_Compile_Args, client) - 48usize];
    ["Offset of field: PJRT_Compile_Args::executable"][::std::mem::offset_of!(PJRT_Compile_Args, executable) - 56usize];
};
pub const PJRT_Compile_Args_STRUCT_SIZE: _bindgen_ty_145 = 64;
pub type _bindgen_ty_145 = ::std::os::raw::c_uint;
pub type PJRT_Compile = ::std::option::Option<unsafe extern "C" fn(args: *mut PJRT_Compile_Args) -> *mut PJRT_Error>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PJRT_Api {
    pub struct_size: usize,
    pub extension_start: *mut PJRT_Extension_Base,
    pub pjrt_api_version: PJRT_Api_Version,
    pub PJRT_Error_Destroy: PJRT_Error_Destroy,
    pub PJRT_Error_Message: PJRT_Error_Message,
    pub PJRT_Error_GetCode: PJRT_Error_GetCode,
    pub PJRT_Plugin_Initialize: PJRT_Plugin_Initialize,
    pub PJRT_Plugin_Attributes: PJRT_Plugin_Attributes,
    pub PJRT_Event_Destroy: PJRT_Event_Destroy,
    pub PJRT_Event_IsReady: PJRT_Event_IsReady,
    pub PJRT_Event_Error: PJRT_Event_Error,
    pub PJRT_Event_Await: PJRT_Event_Await,
    pub PJRT_Event_OnReady: PJRT_Event_OnReady,
    pub PJRT_Client_Create: PJRT_Client_Create,
    pub PJRT_Client_Destroy: PJRT_Client_Destroy,
    pub PJRT_Client_PlatformName: PJRT_Client_PlatformName,
    pub PJRT_Client_ProcessIndex: PJRT_Client_ProcessIndex,
    pub PJRT_Client_PlatformVersion: PJRT_Client_PlatformVersion,
    pub PJRT_Client_Devices: PJRT_Client_Devices,
    pub PJRT_Client_AddressableDevices: PJRT_Client_AddressableDevices,
    pub PJRT_Client_LookupDevice: PJRT_Client_LookupDevice,
    pub PJRT_Client_LookupAddressableDevice: PJRT_Client_LookupAddressableDevice,
    pub PJRT_Client_AddressableMemories: PJRT_Client_AddressableMemories,
    pub PJRT_Client_Compile: PJRT_Client_Compile,
    pub PJRT_Client_DefaultDeviceAssignment: PJRT_Client_DefaultDeviceAssignment,
    pub PJRT_Client_BufferFromHostBuffer: PJRT_Client_BufferFromHostBuffer,
    pub PJRT_DeviceDescription_Id: PJRT_DeviceDescription_Id,
    pub PJRT_DeviceDescription_ProcessIndex: PJRT_DeviceDescription_ProcessIndex,
    pub PJRT_DeviceDescription_Attributes: PJRT_DeviceDescription_Attributes,
    pub PJRT_DeviceDescription_Kind: PJRT_DeviceDescription_Kind,
    pub PJRT_DeviceDescription_DebugString: PJRT_DeviceDescription_DebugString,
    pub PJRT_DeviceDescription_ToString: PJRT_DeviceDescription_ToString,
    pub PJRT_Device_GetDescription: PJRT_Device_GetDescription,
    pub PJRT_Device_IsAddressable: PJRT_Device_IsAddressable,
    pub PJRT_Device_LocalHardwareId: PJRT_Device_LocalHardwareId,
    pub PJRT_Device_AddressableMemories: PJRT_Device_AddressableMemories,
    pub PJRT_Device_DefaultMemory: PJRT_Device_DefaultMemory,
    pub PJRT_Device_MemoryStats: PJRT_Device_MemoryStats,
    pub PJRT_Memory_Id: PJRT_Memory_Id,
    pub PJRT_Memory_Kind: PJRT_Memory_Kind,
    pub PJRT_Memory_DebugString: PJRT_Memory_DebugString,
    pub PJRT_Memory_ToString: PJRT_Memory_ToString,
    pub PJRT_Memory_AddressableByDevices: PJRT_Memory_AddressableByDevices,
    pub PJRT_Executable_Destroy: PJRT_Executable_Destroy,
    pub PJRT_Executable_Name: PJRT_Executable_Name,
    pub PJRT_Executable_NumReplicas: PJRT_Executable_NumReplicas,
    pub PJRT_Executable_NumPartitions: PJRT_Executable_NumPartitions,
    pub PJRT_Executable_NumOutputs: PJRT_Executable_NumOutputs,
    pub PJRT_Executable_SizeOfGeneratedCodeInBytes: PJRT_Executable_SizeOfGeneratedCodeInBytes,
    pub PJRT_Executable_GetCostAnalysis: PJRT_Executable_GetCostAnalysis,
    pub PJRT_Executable_OutputMemoryKinds: PJRT_Executable_OutputMemoryKinds,
    pub PJRT_Executable_OptimizedProgram: PJRT_Executable_OptimizedProgram,
    pub PJRT_Executable_Serialize: PJRT_Executable_Serialize,
    pub PJRT_LoadedExecutable_Destroy: PJRT_LoadedExecutable_Destroy,
    pub PJRT_LoadedExecutable_GetExecutable: PJRT_LoadedExecutable_GetExecutable,
    pub PJRT_LoadedExecutable_AddressableDevices: PJRT_LoadedExecutable_AddressableDevices,
    pub PJRT_LoadedExecutable_Delete: PJRT_LoadedExecutable_Delete,
    pub PJRT_LoadedExecutable_IsDeleted: PJRT_LoadedExecutable_IsDeleted,
    pub PJRT_LoadedExecutable_Execute: PJRT_LoadedExecutable_Execute,
    pub PJRT_Executable_DeserializeAndLoad: PJRT_Executable_DeserializeAndLoad,
    pub PJRT_LoadedExecutable_Fingerprint: PJRT_LoadedExecutable_Fingerprint,
    pub PJRT_Buffer_Destroy: PJRT_Buffer_Destroy,
    pub PJRT_Buffer_ElementType: PJRT_Buffer_ElementType,
    pub PJRT_Buffer_Dimensions: PJRT_Buffer_Dimensions,
    pub PJRT_Buffer_UnpaddedDimensions: PJRT_Buffer_UnpaddedDimensions,
    pub PJRT_Buffer_DynamicDimensionIndices: PJRT_Buffer_DynamicDimensionIndices,
    pub PJRT_Buffer_GetMemoryLayout: PJRT_Buffer_GetMemoryLayout,
    pub PJRT_Buffer_OnDeviceSizeInBytes: PJRT_Buffer_OnDeviceSizeInBytes,
    pub PJRT_Buffer_Device: PJRT_Buffer_Device,
    pub PJRT_Buffer_Memory: PJRT_Buffer_Memory,
    pub PJRT_Buffer_Delete: PJRT_Buffer_Delete,
    pub PJRT_Buffer_IsDeleted: PJRT_Buffer_IsDeleted,
    pub PJRT_Buffer_CopyToDevice: PJRT_Buffer_CopyToDevice,
    pub PJRT_Buffer_ToHostBuffer: PJRT_Buffer_ToHostBuffer,
    pub PJRT_Buffer_IsOnCpu: PJRT_Buffer_IsOnCpu,
    pub PJRT_Buffer_ReadyEvent: PJRT_Buffer_ReadyEvent,
    pub PJRT_Buffer_UnsafePointer: PJRT_Buffer_UnsafePointer,
    pub PJRT_Buffer_IncreaseExternalReferenceCount: PJRT_Buffer_IncreaseExternalReferenceCount,
    pub PJRT_Buffer_DecreaseExternalReferenceCount: PJRT_Buffer_DecreaseExternalReferenceCount,
    pub PJRT_Buffer_OpaqueDeviceMemoryDataPointer: PJRT_Buffer_OpaqueDeviceMemoryDataPointer,
    pub PJRT_CopyToDeviceStream_Destroy: PJRT_CopyToDeviceStream_Destroy,
    pub PJRT_CopyToDeviceStream_AddChunk: PJRT_CopyToDeviceStream_AddChunk,
    pub PJRT_CopyToDeviceStream_TotalBytes: PJRT_CopyToDeviceStream_TotalBytes,
    pub PJRT_CopyToDeviceStream_GranuleSize: PJRT_CopyToDeviceStream_GranuleSize,
    pub PJRT_CopyToDeviceStream_CurrentBytes: PJRT_CopyToDeviceStream_CurrentBytes,
    pub PJRT_TopologyDescription_Create: PJRT_TopologyDescription_Create,
    pub PJRT_TopologyDescription_Destroy: PJRT_TopologyDescription_Destroy,
    pub PJRT_TopologyDescription_PlatformName: PJRT_TopologyDescription_PlatformName,
    pub PJRT_TopologyDescription_PlatformVersion: PJRT_TopologyDescription_PlatformVersion,
    pub PJRT_TopologyDescription_GetDeviceDescriptions: PJRT_TopologyDescription_GetDeviceDescriptions,
    pub PJRT_TopologyDescription_Serialize: PJRT_TopologyDescription_Serialize,
    pub PJRT_TopologyDescription_Attributes: PJRT_TopologyDescription_Attributes,
    pub PJRT_Compile: PJRT_Compile,
    pub PJRT_Executable_OutputElementTypes: PJRT_Executable_OutputElementTypes,
    pub PJRT_Executable_OutputDimensions: PJRT_Executable_OutputDimensions,
    pub PJRT_Buffer_CopyToMemory: PJRT_Buffer_CopyToMemory,
    pub PJRT_Client_CreateViewOfDeviceBuffer: PJRT_Client_CreateViewOfDeviceBuffer,
    pub PJRT_Executable_Fingerprint: PJRT_Executable_Fingerprint,
    pub PJRT_Client_TopologyDescription: PJRT_Client_TopologyDescription,
    pub PJRT_Executable_GetCompiledMemoryStats: PJRT_Executable_GetCompiledMemoryStats,
    pub PJRT_Memory_Kind_Id: PJRT_Memory_Kind_Id,
    pub PJRT_ExecuteContext_Create: PJRT_ExecuteContext_Create,
    pub PJRT_ExecuteContext_Destroy: PJRT_ExecuteContext_Destroy,
    pub PJRT_Buffer_CopyRawToHost: PJRT_Buffer_CopyRawToHost,
    pub PJRT_AsyncHostToDeviceTransferManager_Destroy: PJRT_AsyncHostToDeviceTransferManager_Destroy,
    pub PJRT_AsyncHostToDeviceTransferManager_TransferData: PJRT_AsyncHostToDeviceTransferManager_TransferData,
    pub PJRT_Client_CreateBuffersForAsyncHostToDevice: PJRT_Client_CreateBuffersForAsyncHostToDevice,
    pub PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer: PJRT_AsyncHostToDeviceTransferManager_RetrieveBuffer,
    pub PJRT_AsyncHostToDeviceTransferManager_Device: PJRT_AsyncHostToDeviceTransferManager_Device,
    pub PJRT_AsyncHostToDeviceTransferManager_BufferCount: PJRT_AsyncHostToDeviceTransferManager_BufferCount,
    pub PJRT_AsyncHostToDeviceTransferManager_BufferSize: PJRT_AsyncHostToDeviceTransferManager_BufferSize,
    pub PJRT_AsyncHostToDeviceTransferManager_SetBufferError: PJRT_AsyncHostToDeviceTransferManager_SetBufferError,
    pub PJRT_AsyncHostToDeviceTransferManager_AddMetadata: PJRT_AsyncHostToDeviceTransferManager_AddMetadata,
    pub PJRT_Client_DmaMap: PJRT_Client_DmaMap,
    pub PJRT_Client_DmaUnmap: PJRT_Client_DmaUnmap,
    pub PJRT_Client_CreateUninitializedBuffer: PJRT_Client_CreateUninitializedBuffer,
    pub PJRT_Client_UpdateGlobalProcessInfo: PJRT_Client_UpdateGlobalProcessInfo,
    pub PJRT_TopologyDescription_Deserialize: PJRT_TopologyDescription_Deserialize,
    pub PJRT_Client_CreateAliasBuffer: PJRT_Client_CreateAliasBuffer,
    pub PJRT_Client_FulfillAliasBuffer: PJRT_Client_FulfillAliasBuffer,
    pub PJRT_LoadedExecutable_GetDeviceAssignment: PJRT_LoadedExecutable_GetDeviceAssignment,
    pub PJRT_Client_CreateErrorBuffer: PJRT_Client_CreateErrorBuffer,
    pub PJRT_AsyncHostToDeviceTransferManager_TransferLiteral: PJRT_AsyncHostToDeviceTransferManager_TransferLiteral,
    pub PJRT_Buffer_CopyRawToHostFuture: PJRT_Buffer_CopyRawToHostFuture,
    pub PJRT_Device_PoisonExecution: PJRT_Device_PoisonExecution,
    pub PJRT_Device_CreateAsyncTrackingEvent: PJRT_Device_CreateAsyncTrackingEvent,
    pub PJRT_AsyncTrackingEvent_Destroy: PJRT_AsyncTrackingEvent_Destroy,
    pub PJRT_Executable_GetCompileOptions: PJRT_Executable_GetCompileOptions,
    pub PJRT_Buffer_DonateWithControlDependency: PJRT_Buffer_DonateWithControlDependency,
    pub PJRT_Event_Create: PJRT_Event_Create,
    pub PJRT_Event_Set: PJRT_Event_Set,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PJRT_Api"][::std::mem::size_of::<PJRT_Api>() - 1064usize];
    ["Alignment of PJRT_Api"][::std::mem::align_of::<PJRT_Api>() - 8usize];
    ["Offset of field: PJRT_Api::struct_size"][::std::mem::offset_of!(PJRT_Api, struct_size) - 0usize];
    ["Offset of field: PJRT_Api::extension_start"][::std::mem::offset_of!(PJRT_Api, extension_start) - 8usize];
    ["Offset of field: PJRT_Api::pjrt_api_version"][::std::mem::offset_of!(PJRT_Api, pjrt_api_version) - 16usize];
    ["Offset of field: PJRT_Api::PJRT_Error_Destroy"][::std::mem::offset_of!(PJRT_Api, PJRT_Error_Destroy) - 40usize];
    ["Offset of field: PJRT_Api::PJRT_Error_Message"][::std::mem::offset_of!(PJRT_Api, PJRT_Error_Message) - 48usize];
    ["Offset of field: PJRT_Api::PJRT_Error_GetCode"][::std::mem::offset_of!(PJRT_Api, PJRT_Error_GetCode) - 56usize];
    ["Offset of field: PJRT_Api::PJRT_Plugin_Initialize"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Plugin_Initialize) - 64usize];
    ["Offset of field: PJRT_Api::PJRT_Plugin_Attributes"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Plugin_Attributes) - 72usize];
    ["Offset of field: PJRT_Api::PJRT_Event_Destroy"][::std::mem::offset_of!(PJRT_Api, PJRT_Event_Destroy) - 80usize];
    ["Offset of field: PJRT_Api::PJRT_Event_IsReady"][::std::mem::offset_of!(PJRT_Api, PJRT_Event_IsReady) - 88usize];
    ["Offset of field: PJRT_Api::PJRT_Event_Error"][::std::mem::offset_of!(PJRT_Api, PJRT_Event_Error) - 96usize];
    ["Offset of field: PJRT_Api::PJRT_Event_Await"][::std::mem::offset_of!(PJRT_Api, PJRT_Event_Await) - 104usize];
    ["Offset of field: PJRT_Api::PJRT_Event_OnReady"][::std::mem::offset_of!(PJRT_Api, PJRT_Event_OnReady) - 112usize];
    ["Offset of field: PJRT_Api::PJRT_Client_Create"][::std::mem::offset_of!(PJRT_Api, PJRT_Client_Create) - 120usize];
    ["Offset of field: PJRT_Api::PJRT_Client_Destroy"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_Destroy) - 128usize];
    ["Offset of field: PJRT_Api::PJRT_Client_PlatformName"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_PlatformName) - 136usize];
    ["Offset of field: PJRT_Api::PJRT_Client_ProcessIndex"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_ProcessIndex) - 144usize];
    ["Offset of field: PJRT_Api::PJRT_Client_PlatformVersion"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_PlatformVersion) - 152usize];
    ["Offset of field: PJRT_Api::PJRT_Client_Devices"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_Devices) - 160usize];
    ["Offset of field: PJRT_Api::PJRT_Client_AddressableDevices"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_AddressableDevices) - 168usize];
    ["Offset of field: PJRT_Api::PJRT_Client_LookupDevice"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_LookupDevice) - 176usize];
    ["Offset of field: PJRT_Api::PJRT_Client_LookupAddressableDevice"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_LookupAddressableDevice) - 184usize];
    ["Offset of field: PJRT_Api::PJRT_Client_AddressableMemories"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_AddressableMemories) - 192usize];
    ["Offset of field: PJRT_Api::PJRT_Client_Compile"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_Compile) - 200usize];
    ["Offset of field: PJRT_Api::PJRT_Client_DefaultDeviceAssignment"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_DefaultDeviceAssignment) - 208usize];
    ["Offset of field: PJRT_Api::PJRT_Client_BufferFromHostBuffer"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Client_BufferFromHostBuffer) - 216usize];
    ["Offset of field: PJRT_Api::PJRT_DeviceDescription_Id"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_DeviceDescription_Id) - 224usize];
    ["Offset of field: PJRT_Api::PJRT_DeviceDescription_ProcessIndex"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_DeviceDescription_ProcessIndex) - 232usize];
    ["Offset of field: PJRT_Api::PJRT_DeviceDescription_Attributes"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_DeviceDescription_Attributes) - 240usize];
    ["Offset of field: PJRT_Api::PJRT_DeviceDescription_Kind"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_DeviceDescription_Kind) - 248usize];
    ["Offset of field: PJRT_Api::PJRT_DeviceDescription_DebugString"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_DeviceDescription_DebugString) - 256usize];
    ["Offset of field: PJRT_Api::PJRT_DeviceDescription_ToString"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_DeviceDescription_ToString) - 264usize];
    ["Offset of field: PJRT_Api::PJRT_Device_GetDescription"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Device_GetDescription) - 272usize];
    ["Offset of field: PJRT_Api::PJRT_Device_IsAddressable"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Device_IsAddressable) - 280usize];
    ["Offset of field: PJRT_Api::PJRT_Device_LocalHardwareId"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Device_LocalHardwareId) - 288usize];
    ["Offset of field: PJRT_Api::PJRT_Device_AddressableMemories"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Device_AddressableMemories) - 296usize];
    ["Offset of field: PJRT_Api::PJRT_Device_DefaultMemory"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Device_DefaultMemory) - 304usize];
    ["Offset of field: PJRT_Api::PJRT_Device_MemoryStats"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Device_MemoryStats) - 312usize];
    ["Offset of field: PJRT_Api::PJRT_Memory_Id"][::std::mem::offset_of!(PJRT_Api, PJRT_Memory_Id) - 320usize];
    ["Offset of field: PJRT_Api::PJRT_Memory_Kind"][::std::mem::offset_of!(PJRT_Api, PJRT_Memory_Kind) - 328usize];
    ["Offset of field: PJRT_Api::PJRT_Memory_DebugString"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Memory_DebugString) - 336usize];
    ["Offset of field: PJRT_Api::PJRT_Memory_ToString"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Memory_ToString) - 344usize];
    ["Offset of field: PJRT_Api::PJRT_Memory_AddressableByDevices"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Memory_AddressableByDevices) - 352usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_Destroy"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_Destroy) - 360usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_Name"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_Name) - 368usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_NumReplicas"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_NumReplicas) - 376usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_NumPartitions"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_NumPartitions) - 384usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_NumOutputs"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_NumOutputs) - 392usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_SizeOfGeneratedCodeInBytes"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_SizeOfGeneratedCodeInBytes) - 400usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_GetCostAnalysis"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_GetCostAnalysis) - 408usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_OutputMemoryKinds"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_OutputMemoryKinds) - 416usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_OptimizedProgram"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_OptimizedProgram) - 424usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_Serialize"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_Serialize) - 432usize];
    ["Offset of field: PJRT_Api::PJRT_LoadedExecutable_Destroy"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_LoadedExecutable_Destroy) - 440usize];
    ["Offset of field: PJRT_Api::PJRT_LoadedExecutable_GetExecutable"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_LoadedExecutable_GetExecutable) - 448usize];
    ["Offset of field: PJRT_Api::PJRT_LoadedExecutable_AddressableDevices"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_LoadedExecutable_AddressableDevices) - 456usize];
    ["Offset of field: PJRT_Api::PJRT_LoadedExecutable_Delete"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_LoadedExecutable_Delete) - 464usize];
    ["Offset of field: PJRT_Api::PJRT_LoadedExecutable_IsDeleted"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_LoadedExecutable_IsDeleted) - 472usize];
    ["Offset of field: PJRT_Api::PJRT_LoadedExecutable_Execute"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_LoadedExecutable_Execute) - 480usize];
    ["Offset of field: PJRT_Api::PJRT_Executable_DeserializeAndLoad"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Executable_DeserializeAndLoad) - 488usize];
    ["Offset of field: PJRT_Api::PJRT_LoadedExecutable_Fingerprint"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_LoadedExecutable_Fingerprint) - 496usize];
    ["Offset of field: PJRT_Api::PJRT_Buffer_Destroy"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Buffer_Destroy) - 504usize];
    ["Offset of field: PJRT_Api::PJRT_Buffer_ElementType"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Buffer_ElementType) - 512usize];
    ["Offset of field: PJRT_Api::PJRT_Buffer_Dimensions"]
        [::std::mem::offset_of!(PJRT_Api, PJRT_Buffer_Dimensions) - 520usize];
